[
  {
    "title": "Top 10 Startup and Tech Funding News - June 9, 2025",
    "description": "It’s Monday, June 9, 2025. Hope you had a great weekend. We’re back with your daily tech funding roundup, tracking where capital is flowing and which startups are laying the groundwork for what’s next. Today’s deals span AI coding assistants, fintech, cybersecurity, defense tech, biotech, climate innovation, and more. From Anysphere’s $900 million raise to",
    "url": "https://techstartups.com/2025/06/09/top-10-startup-and-tech-funding-news-june-9-2025/",
    "source": {
      "name": "TechStartups.com"
    },
    "publishedAt": "2025-06-09T23:02:34Z"
  },
  {
    "title": "Top 10 Startup and Tech Funding News for the Week Ending June 6, 2025",
    "description": "It’s Friday, June 6, 2025—and we’re wrapping up the week with your daily tech funding snapshot, spotlighting where capital is flowing and which startups are gearing up for their next leap. Today’s lineup features a wide-ranging mix of startups spanning AI infrastructure, biotech, fintech, climate tech, and digital health. From Grammarly’s eye-popping $1 billion growth",
    "url": "https://techstartups.com/2025/06/06/top-10-startup-and-tech-funding-news-for-the-week-ending-june-6-2025/",
    "source": {
      "name": "TechStartups.com"
    },
    "publishedAt": "2025-06-06T23:08:24Z"
  },
  {
    "title": "Top tech startup funding news for today, May 21, 2025",
    "description": "It’s May 21, 2025, and we’re back with your daily funding rundown—where the money’s going, who’s writing the checks, and which startups are making moves. From fintech and AI to sustainability and biotech, today’s batch covers a lot of ground. Some raised big, some stayed quiet on details, but all eyes are on what comes",
    "url": "https://techstartups.com/2025/05/21/top-tech-startup-funding-news-for-today-may-21-2025/",
    "source": {
      "name": "TechStartups.com"
    },
    "publishedAt": "2025-05-21T22:01:38Z"
  },
  {
    "title": "Klarna CEO says AI helped company shrink workforce by 40%",
    "description": "The Swedish fintech provider has been outspoken about its aggressive adoption of AI tools across the company.",
    "url": "https://www.cnbc.com/2025/05/14/klarna-ceo-says-ai-helped-company-shrink-workforce-by-40percent.html",
    "source": {
      "name": "CNBC"
    },
    "publishedAt": "2025-05-14T19:29:53Z"
  },
  {
    "title": "Stripe unveils AI foundation model for payments, reveals ‘deeper partnership’ with Nvidia",
    "description": "Fintech giant Stripe announced Wednesday a slew of new product launches at its annual Stripe Sessions user event. The highlights include a new AI",
    "url": "https://techcrunch.com/2025/05/07/stripe-unveils-ai-foundation-model-for-payments-reveals-deeper-partnership-with-nvidia/",
    "source": {
      "name": "TechCrunch"
    },
    "publishedAt": "2025-05-07T21:31:20Z"
  },
  {
    "title": "Four Ways AI Is Transforming Fintech",
    "description": "Comparisons between AI and the early internet are unavoidable. So let’s get them out of the way: we’re fast approaching a time where apps without AI will seem as unthinkable as doing business without the internet. Right now, there’s lot of talk about fintechs adding AI to enhance core functionality within their consumer apps. In",
    "url": "https://techstartups.com/2025/04/17/four-ways-ai-is-transforming-fintech/",
    "source": {
      "name": "TechStartups.com"
    },
    "publishedAt": "2025-04-17T21:19:01Z"
  },
  {
    "title": "Fintech founder charged with fraud after 'AI' shopping app found to be powered by humans in the Philippines",
    "description": "Albert Saniger, the founder and former CEO of Nate, an AI shopping app that promised a “universal” checkout experience, was charged with defrauding",
    "url": "https://techcrunch.com/2025/04/10/fintech-founder-charged-with-fraud-after-ai-shopping-app-found-to-be-powered-by-humans-in-the-philippines/",
    "source": {
      "name": "TechCrunch"
    },
    "publishedAt": "2025-04-10T21:42:42Z"
  },
  {
    "title": "A Chinese tech giant says it slashed AI costs using only Chinese chips",
    "description": "Earlier this year, DeepSeek briefly crashed Nvidia’s stock because of speculation that its models require far fewer chips. Now, Chinese fintech giant Ant",
    "url": "https://techcrunch.com/2025/03/24/a-chinese-tech-giant-says-it-slashed-ai-costs-using-only-chinese-chips/",
    "source": {
      "name": "TechCrunch"
    },
    "publishedAt": "2025-03-24T23:39:18Z"
  },
  {
    "title": "VC Sheel Mohnot talks about Twitter fame, fintech, and the truth about AI startups",
    "description": "If you follow fintech on X, it’s very likely that you have come across the account of Sheel Mohnot, co-founder and general partner of Better Tomorrow",
    "url": "https://techcrunch.com/2025/02/12/vc-sheel-mohnot-talks-about-twitter-fame-fintech-and-the-truth-about-ai-startups/",
    "source": {
      "name": "TechCrunch"
    },
    "publishedAt": "2025-02-12T18:00:00Z"
  },
  {
    "title": "Zest AI secures $200M growth funding from Insight Partners to advance AI-driven lending solutions",
    "description": "Zest AI, a fintech startup revolutionizing lending with AI-driven solutions, announced today it has raised a $200 million growth investment from Insight Partners. This funding will support Zest AI's continued efforts to improve underwriting, fraud protection, and generative AI capabilities, with a focus on shaping the future of lending through innovative technology. Zest AI uses",
    "url": "https://techstartups.com/2024/12/13/zest-ai-secures-200m-growth-funding-from-insight-partners-to-advance-ai-driven-lending-solutions/",
    "source": {
      "name": "TechStartups.com"
    },
    "publishedAt": "2024-12-13T14:49:21Z"
  }
]
