[
  {
    "title": "A comprehensive list of 2025 tech layoffs",
    "content": "Latest\nAI\nAmazon\nApps\nBiotech & Health\nClimate\nCloud Computing\nCommerce\nCrypto\nEnterprise\nEVs\nFintech\nFundraising\nGadgets\nGaming\nGoogle\nGovernment & Policy\nHardware\nInstagram\nLayoffs\nMedia & Entertainment\nMeta\nMicrosoft\nPrivacy\nRobotics\nSecurity\nSocial\nSpace\nStartups\nTikTok\nTransportation\nVenture\nEvents\nStartup Battlefield\nStrictlyVC\nNewsletters\nPodcasts\nVideos\nPartner Content\nTechCrunch Brand Studio\nCrunchboard\nContact Us\nThe tech layoff wave is still kicking in 2025. Last year sawmore than 150,000 job cutsacross 549 companies, according to independent layoffs trackerLayoffs.fyi. So far this year, more than 22,000 workers have been the victim of reductions across the tech industry, with a staggering 16,084 cuts taking place in February alone.\nWe’re tracking layoffs in the tech industry in 2025 so you can see the trajectory of the cutbacks and understand the impact on innovation across all types of companies. As businesses continue to embrace AI and automation, this tracker serves as a reminder of the human impact of layoffs — and what could be at stake with increased innovation.\nBelow you’ll find a comprehensive list of all the known tech layoffs that have occurred in 2025, which will be updated regularly. If you have a tip on a layoff, contact ushere. If you prefer to remain anonymous, you can contact ushere.\n\nAnnounced thatit is letting go of around 90 employees, with 40 in Israel and 50 in Poland. The most recent round of job cuts comes after the Israel-based gaming company laid off 50 employees a few weeks ago.\nHas let go of around25 employees from the 58-person team, the company confirmed to TechCrunch. Evernote’s founder Phil Libin launched the video startup in 2020, offeringAirtime CreatorandAirtime Camera.\nIs laying offmore employees, just a few weeks after announcing a job cut of over 6,500 in May,which was around 3% of its global workforce. The most recent layoffs affected software engineers, product managers, technical program managers, marketers, and legal counsels.\nPlans to downsize its workforce byletting go of 68 employees, approximately 4% of its total staff, per Reuters. The San Francisco telehealth platform said that its layoffs were unrelated to a U.S. ban on producing large quantities of the weight-loss drug Wegovy. The startup said it intends to keep on recruiting employees who fit in with its long-term expansion plans.\nIs reportedlylaying off around 100 employees from its devices and services division, including those working on the Alexa voice assistant, Echo smart speakers, Ring video doorbells, and Zoox robotaxis. The company has reduced its workforce by approximately 27,000 since the start of 2022 to cut costs.\nWill cut over 6,500 jobs, affecting 3% of its worldwide workforce. As of June, the Seattle-headquartered company had a total of 228,000 employees globally. It would be one of the company’s biggest layoffs since it cut 10,000 employees in 2023.\nReportedly plans to let go of 248 employees, or about 22% of its workforce, to reduce expenses and improve efficiency, it said. The San Francisco-based edtech startup, which offers textbook rentals and tutoring services, has seen a drop in web traffic for months as students opt for AI tools instead of traditional edtech platforms.\nIsreducing its workforce by 13%as part of a reorganization that aims to reduce costs, shore up margins, and streamline its organizational structure.\nIslaying off 5% of its global workforce, or around 500 people. The company said the layoffs were part of “a strategic plan (the ‘Plan’) to evolve its operations to yield greater efficiencies as the Company continues to scale its business with focus and discipline to meet its goal of $10 billion in ending [Annual Recurring Revenue]” in its 8-K filing.\nHascut roughly 25% of its current workforce. The Vancouver-based company, which is developing a technology to generate fusion energy, has raised $440 million from investors, including Jeff Bezos, Temasek, and BDC Capital.\nReduced its headcount by 20 employees,accounting for 10% of its total workforce. In April 2023, the Israeli cybersecurity startup had previously laid off a similar number of employees during a round of layoffs.\nHasshut down its operationsmonths after announcing major expansion plans, per Sifted. The British climate startup has let go of approximately 200 employees, according toa LinkedIn post by James Reynolds, the head of talent.\nIsreportedlyeliminating 700 jobs, affecting 6% of its total workforce, as it reorganizes for its operational efficiency. The company, based in San Francisco, provides data storage, cloud services, and CloudOps solutions for businesses.\nIs reportedly letting go of approximately 300 to 400 employees, including around 100 at Respawn Entertainment, to focus on its “long-term strategic priorities,” according toBloomberg.\nIslaying off around 3%of its employees as part of its restructuring. The job cuts will mainly affect midlevel positions in the product and technology teams. The latest round of layoffs comes after the company let go of hundreds of employees from its marketing team globally in early March.\nHas reduced its workforce by about 200 employeesin its product and technology divisions as part of a restructuring measure. The India-based e-commerce platform for pre-owned vehicles provides a range of services like buying and selling pre-owned cars, financing, insurance, driver-on-demand, and more. In 2023, the SoftBank-backed startup raised $450 million at a valuation of $3.3 billion.\nIs letting go of over 100 employees in its Reality Labs division, which manages virtual reality and wearable technology,according to The Verge.The job cuts affect employees developing VR experiences for Meta’s Quest headsets and staff working on hardware operations to streamline similar work between the two teams.\nAnnounced itsplan to lay off more than 21,000 employees, or roughly 20% of its workforce, in April. The move comes ahead of Intel’s Q1 earnings call helmed byrecently appointed CEO Lip-Bu Tan, who took over from longtime chief Pat Gelsinger last year.\nIs laying off 200 people at its Factory Zero in Detroit and Hamtramck facility in Michigan, which produces GM’s electric vehicles. The cuts come amid the EV slowdown and is not caused by tariffs, according toa report.\nHasreportedlylet go of around 100 employees since the start of 2025. Earlier this week, about 50 employees from the tech and product teams were let go in the latest round of job cuts. The India-based insurtech startup has raised a total of $125 million to date.\nWill reduce its workforce by 150 positions following its decision not to proceed with its IPO,per Bloomberg. The San Francisco-based car rental startup, which had about 1,000 staff in 2024, said the layoffs will bolster its long-term growth plans during economic uncertainty.\nLaid off roughly 200 employeesto improve efficiency and profitability. It’s the startup’s second round of layoffs in five months, following the job cuts of around 300 employees in December. The conversational AI company, backed by Tiger Global and Fidelity, was last valued at $1.4 billion in 2021. The startup is based in San Francisco and operates in India.\nHasreportedlyeliminated 200 jobs, affecting around one-third of its employees. The German logistics startup reduced a significant number of sales staff.\nWill stop its operations in China, affecting around 2,000 employees. The move came after Microsoft decided to end outsourcing after-sales support to Wicresoft amid increasing trade tensions. Wicresoft, Microsoft’s first joint venture in China, was founded in 2022 and operates in the U.S., Europe, and Japan. It has over 10,000 employees.\nPlans to cut 123 jobs,affecting about 4% of its workforce, according to a report by MarketWatch. The software company prioritizes key strategic areas like artificial intelligence for profitable growth.\nHaslaid off hundreds of employeesin its platforms and devices division, which covers Android, Pixel phones, the Chrome browser, and more, according to The Information.\nIscontemplatingadditional layoffs that could happen by May, Business Insider reported, citing anonymous sources. The company is said to be discussing reducing the number of middle managers and non-coders in a bid to increase the ratio of programmers to product managers.\nThe WordPress.com developeris laying off 16% of its workforce across departments. Before the layoffs, the company’s website showed it had 1,744 employees, so more than 270 staff may have been laid off.\nHas let go of10 to 12 technical writersapproximately nine months after telling its employees to use generative AI tools wherever possible. The company, which had around 5,500 staff in 2024, wasvalued at $26 billionafter a secondary stock sale in 2024.\nHaslaid off 2,800 employees, affecting 62% of its total staff. The layoffs come weeks after the embattled Swedish battery maker filed for bankruptcy.\nLet go of 931 employees, around 8% of its workforce, as part of a reorganization,according to an internal email seen by TechCrunch. Jack Dorsey, the co-founder and CEO of the fintech company, wrote in the email that the layoffs were not for financial reasons or to replace workers with AI.\nHas laid off 198 employees, who make up about two-thirds of its U.S. workforce, pera media report. The layoff comes a month after the company was acquired by Bending Spoons, an Italian app developer, for $233 million. Brightcove had 600 employees worldwide, with 300 in the U.S., as of December 2023.\nHasreportedlylaid off 130 employees, or 3.5% of its total workforce of 3,700 people. Acxiom is owned by IPG, and the news comes just a day after IPG and Omnicom Group shareholders approved the companies’ potential merger.\nPlans to close its office in Washington, D.C., and let go of its policy team there by the end of March,TechCrunch has confirmed. Sequoia opened its Washington office five years ago to deepen its relationship with policymakers. Three full-time employees are expected to be affected, per Forbes.\nAnnouncedplans to let go of approximately 5,600 jobs globallyin its automation and electric-vehicle charging businesses as part of efforts to improve competitiveness.\nIsreportedly laying off 273 employees, closing its distribution center in Grand Prairie, Texas, and consolidating to another site in Irving to manage the volume in the region.\nHascut 45 employees, more than half of its workforce, after being acquired by cybersecurity companyArmis for $120 million in March.\nWill reportedly reduce 22 employees,representing 7% of its workforce. Most of those affected are based in Israel as the company undergoes a streamlining process. The New York- and Tel Aviv-headquartered cybersecurity firmhas raised $100 million at a valuation of about $500 millionin 2021.\nWill cut 22 jobs, affecting nearlya quarter of its total workforce,following the announcement of the AI startup’s strategicpartnership with Microsoft.\nAnnounced it will beshutting down several of its officesin accordance with Elon Musk’s DOGE, including its Office of Technology, Policy, and Strategy and the DEI branch in the Office of Diversity and Equal Opportunity.\nHas reportedly laid off some staff, according toLinkedIn posts from ex-employees.The company has not confirmed the layoffs, and it is currently unknown how many workers were affected.\nAnnounced plans tolet go of 340 employeesin its technology division as part of a new restructuring effort.\nWill cut2,500 employees,or 5% of its total staff, in response to its shares sliding 19% in the first fiscal quarter.\nWill cutup to 300 workers in Dublin,accounting for roughly 10% of the company’s workforce in Ireland.\nAnnounced it willlay off 65 employees,affecting 5% of its total workforce.\nIs reportedly set to lay offover 1,000 employees and contractorsin a cost-cutting effort. It’s the second round of cuts for the company in just five months.\nReduced itstotal headcount by 16%as the gaming startup shifts its focus to be “scrappier” and “more efficient.”\nWasshut downjust three years after it was acquired by Flipkart. It is currently unknown how many employees were affected.\nWill cutup to 2,000 jobsas part of its “Future Now” restructuring plan that hopes to save the company $300 million before the end of its fiscal year.\nAnnounced500 job cutsafter it wassold to Wonder Group for $650 million.The number of cuts affected more than 20% of its previous workforce.\nAnnounced plansto lay off 1,350 employees,affecting 9% of its total workforce, in an attempt to reshape its GTM model. The company is alsomaking reductions in its facilities,though it does not plan to close any offices.\nIs planning to cut employees in itsPeople Operations and cloud organizations teamsin a new reorganization effort. The company is offering a voluntary exit program to U.S.-based People Operations employees.\nReduced its headcountby 25 employees,accounting for 16% of its total workforce. The company is planning to release a commercial version of its proteome analysis platform in 2026.\nWill reportedlycut a few dozen employees in Israel,potentially affecting 10% of its 250-person workforce in the country.\nCut1,100 jobs in a reorganizing effortthat affected its tech workers. The coffee chain will now outsource some tech work to third-party employees.\nLaid offdozens of employeesover the last few weeks, including around 10% of staff in one day, after failing to meet its sales growth targets. The “headless commerce” platformraised money at a $1.9 billion valuationjust a few years ago.\nWill cutroughly 5% of its current workforcein a new efficiency drive to increase profitability and growth.\nLaid off more employeesin a new effort to cut costs, though the total number is unknown. Last year, the travel giantcut about 1,500 rolesin its Product & Technology division.\nHasceased operationsand has laid off its employees after selling its business and technology to Israeli cybersecurity company Tufin. The cuts affect roughly 300 people.\nIsshutting down its operationsamid “ongoing challenges in healthcare.” It’s unclear the number of employees affected. In 2023, the women’s healthcare startupraised $18 millionto fund its expansion.\nCut51 jobs in its San Francisco headquarters,according to state filings with the Employment Development Department. The SaaS startup previously reduced its headcount by 8% in 2023.\nHascut 120 employees,affecting 44% of its total staff. It’s the Y Combinator-backed Nigerian startup’s second layoff round in just five months.\nReportedlylaid off dozens of employeesas part of a new cost-cutting effort that aims to ensure “long-term success” in the startup’s mission to curb misinformation online.\nWill lay off about 10% of its workforce, affectingmore than 1,000 employees.According to an email to staff obtained by CNN, the cuts will largely have an impact on positions in engineering and program management.\nAnnounced in an SEC filing that it willcut around 450 positionsbetween February and July 2025, with a complete restructuring set to be completed in the fall, following its new partnership with Zillow.\nIs laying off6% of its total workforce,the cybersecurity firm confirmed to TechCrunch. The cuts come less than two weeks after Sophos acquired Secureworks for $859 million.\nWill cutnearly 200 employeesas it introduces redundancy measures and closes down its operations in Poland and Kenya.\nReportedlyconducted another round of layoffs.It’s unknown how many employees were affected.\nCut nearly 200 employees, CEO Mike Seckler announcedin a note to employees, citing “potential adverse events” like a recession or rising interest rates.\nCut 120 jobs, affecting roughlyone-third of its total workforce,TechCrunch exclusively learned. The move comes just a year after the Dutch startupcut 90 employeesfollowing its rebrand.\nLaid offabout 500 employees,affecting 15% of its workforce, citing poor business performance. The new cuts follow twoearlierlayoff roundsfor the company that affected roughly 200 employees.\nReportedly let go ofapproximately 200 employees,according to The Verge. The company previouslycut 100 employeesas part of a layoff round in August 2024.\nLaid off1,750 employees,as originally reported by Bloomberg and confirmed independently by TechCrunch. The cuts affect roughly 8.5% of the enterprise HR platform’s total headcount.\nLaid off 180 employees,the company confirmed to TechCrunch.The cuts come just over one year after the access and identity management giantlet go of 400 workers.\nIs laying off50% of its workforce, including CEO Marc Whitten and several other top executives, as it prepares to shut down operations. What remains of the autonomous vehicle company will move under General Motors.\nIs reportedly eliminatingmore than 1,000 jobs.The cuts come as the giant is actively recruiting and hiring workers to sell new AI products.\nHas shut down operations, CEO Paul Kesserwaniannounced on LinkedIn.The fintech startup’s post-money valuationin 2022 was $82.4 million,according to PitchBook.\nLaid off150 employees based in the U.S., affecting roughly 18% of its total workforce, in an effort to reach profitability.\nLaid offdozens of workers in its communications departmentin order to help the company “move faster, increase ownership, strengthen our culture, and bring teams closer to customers.”\nIslaying off 300 people,according to a leaked memo reported by Business Insider. However, according to the memo, the fintech giant is planning to grow its total headcount by 17%.\nLaid off15 employeesas the augmented writing startup undergoes a restructuring effort.\nIscutting 75 employeesin an effort to “ensure the long-term sustainability and success” of the company. The audio company last cut 200 writers in July 2024 months afterpartnering with ElevenLabs.\nIs planning tocut 58 employeesin response to an “ongoing macroeconomic challenges and continued uncertainty in the solar industry.”\nAnnounced in an internal memo that it willcut 5% of its stafftargeting “low performers” as the company prepares for “an intense year.”As of its latest quarterly report,Meta currently has more than 72,000 employees.\nWill cut up to 730 jobs,affecting 3% of its total workforce,as it plans to exit operations in Germany and focus on physical retailers.\nIs shutting down its operations,affecting 63 employees.The delivery startup said employees will be paid through January 15 without severance.\nIslaying off 114 employeesas part of a team realignment, per a new WARN notice filing, focusing its efforts on a robotic printing system.\nEliminated 37 jobs, affecting roughly 10% of its total workforce, even as the companypursues “aggressive” hiring.\nIs cuttingdozens of employeesacross its global markets as part of a strategic reorganization to increase profitability.\nPlans to lay off400 employees globally.It’s the company’s fourth layoff roundsince January 2024as the solar industry as a whole faces a downturn.\nThe fintech startup, founded in 2018,abruptly shut down earlier this year.Per an email from CEO Paul Aaron, the closure follows anunsuccessful attempt to find a buyer, thoughEmployer.com has a new offer under considerationto acquire the company post-shutdown.\nThis list updates regularly.\nOn April 24, 2025, we corrected the number of layoffs that happened in March.\nTopics\nAudience Development Manager\nAlyssa Stringer was formerly the Audience Development Manager for TechCrunch. She previously worked for HW Media as Audience Development Manager across HousingWire, RealTrends and FinLedger media brands. Prior to her experience in audience development, Alyssa worked as a content writer and holds a Bachelor’s in Journalism at the University of North Texas.\nReporter, Asia\nKate Park is a reporter at TechCrunch, with a focus on technology, startups and venture capital in Asia. She previously was a financial journalist at Mergermarket covering M&A, private equity and venture capital.\nFrom seed to Series C and beyond—founders and VCs of all stages are heading to Boston. Be part of the conversation. Save $200+ now and tap into powerful takeaways, peer insights, and game-changing connections.\nGoogle reportedly plans to cut ties with Scale AI\nNew details emerge on Meta’s $14.3B deal for Scale\n11 startups from YC Demo Day that investors are talking about\nGoogle Cloud outage brings down a lot of the internet\nWaymo rides cost more than Uber or Lyft — and people are paying anyway\nEurope, we’re not leaving. Period.\nOpenAI releases o3-pro, a souped-up version of its o3 AI reasoning model\n© 2025 TechCrunch Media LLC.",
    "url": "https://techcrunch.com/2025/06/16/tech-layoffs-2025-list/",
    "source": {
      "name": "TechCrunch"
    },
    "publishedAt": "2025-06-16T13:48:36Z"
  },
  {
    "title": "CRDB Bank Migrates Acquiring and Issuing Systems to BPC SmartVisa Platform",
    "content": "Migrating to SmartVista platform has enabled CRDB Bank to consolidate its multi-country ecosystem under one microservices architecture, boosting operational efficiency while aligning with the national regulations and the international scheme certifications.\nCRDB Bank said it selected BPC as it sought a modern, scalable multi-institutional technological platform with the capacity for instant innovative card product launches, advanced integrational capabilities and affordable total cost of ownership.\nFollowing the move, CRDB Bank plans to expand its operations across Tanzania, Burundi, and DR Congo.\n“Migrating our switch and card management systems to BPC’s platform has significantly expanded our issuing and acquiring capabilities,” explainedAbdulmajid Nsekela, group CEO for CRDB Bank. “This strategic partnership provided us with tools to keep up with our goal to offer modern, secure, and convenient banking services.”\nBPC migrated the issuing and acquiring functionality of CRDB Bank, its subsidiaries in Burundi and DR Congo, and affiliates such asAmana,VisionFund, andKCBL(now part of bank CBT). The revamped card issuing capabilities extend from the ability to issue any type of card, from corporate, virtual, proprietary, loyalty, specialised cards like fuel and hospital cards, to internationally branded cards,Visa,Mastercard, andUPI.\nOn the acquiring side, CRDB Bank now accepts global brands across all of itsPOSnetwork, as well as offering cardless withdrawals, foreign exchange at ATMs and advanced services like utility payments and dynamic currency conversion.\nLeveraging the advanced integration capabilities of the SmartVista platform, CRDB Bank has connected its core modules with its own mobile banking (Simbanking) and agency banking (Wakala), facilitating seamless, omnichannel experiences for its customers through its entire multi-institutional network.\nGrant Truter, chief commercial officer, business development and SaaS operations – MEA at BPC, also commented: “It is an honour to have CRDB place its trust in BPC’s expertise for this critical legacy migration. We specialise in delivering scalable, future-proven solutions that empower our customers to expand their networks and bring payment innovations to their customers. Through our next-generation SmartVista platform, we support CRDB’s vision of providing modern banking experiences and help them drive financial inclusion and innovation.”\nThrough the adoption of BPC’s platform, CRDB Bank benefits from the new modular infrastructure that has ensured seamless integration of all applications and components and compliance with international schemes and PCI-DSS standards, has offered instant onboarding of affiliate institutions to the CRDB platform, and boosted flexibility for continuous innovations. Over 4.5 million cards have already been issued through the upgraded issuing platform, marking a significant milestone in CRDB Bank’s digital transformation journey.\nThe Fintech Times",
    "url": "https://thefintechtimes.com/crdb-bank-migrates-acquiring-and-issuing-systems-to-bpc-smartvisa-platform/",
    "source": {
      "name": "Fintech Times"
    },
    "publishedAt": "2025-06-17T04:00:26Z"
  },
  {
    "title": "Mastercard Ramps Up Customer Onboarding and Streamlines Payments With Cloud Edge in APAC",
    "content": "Cloud computing will account for over $1trillion in value across the world’s top 500 companies, but in the Asia Pacific region specifically, the technology is going to be integral for the growth of fintech. In fact, according toMordorIntelligence, it is set to drive the market to a projected value of nearly $311billion by 2029.\nFintechs worldwide are expected togrow approximately three times fasterthan the overall banking industrythrough 2028, powered largely by emerging markets growth in Asia Pacific. To ensure fintechs worldwide have the best opportunity to grow, Mastercard has made Cloud Edge available in Asia Pacific markets (including India,Australia,Singapore, Hong Kong SAR, Thailand), the United States, Canada and parts of Europe, Latin America, the Caribbean, Middle East and Africa.\nMastercard Cloud Edge provides customers, including issuers, acquirers, network enablement partners and payment processors, with:\n“With Cloud Edge, Mastercard brings pioneering innovations in cloud and payments to Asia Pacific banks, financial institutions, and cloud-native organisations – meeting forward-thinking customers where they want to be,” saidSandeepMalhotra, executive vice president, core payments, Asia Pacific, Mastercard.\n“Cloud Edge reinforces Mastercard’s commitment to resiliency, redundancy and security while offering customers cost efficiency as well as greater choice, speed and flexibility. For instance, with cloud computing, fintechs can serve customers easily during demand spikes like national holidays or sales events without needing more physical infrastructure.”\nFor example,Episode Six, a global provider of enterprise-grade ledger and cards infrastructure, is using Cloud Edge to assist banks, fintechs and payments organisations in Asia Pacific as they design and launch leading digital payment propositions like credit and B2B payments.\n“All of Episode Six’s bank-grade technology was created specifically for the cloud, and as such, we understand how important infrastructure is for partners to scale with greater security now and in the future,” saidJohnMitchell, co-founder and CEO, Episode Six. “We are excited to collaborate with Mastercard on Cloud Edge so that we can reduce time to market for their clients, while ensuring security, backup and protection by encrypting and storing data in the cloud.”\n“The AWS Regions across Asia Pacific offer Mastercard extensive connectivity and secure cloud services. Together with Mastercard’s global footprint, this provides organisations in the region with payment network access at low latency, ensuring seamless operations as well as compliance with regional data residency regulations,” saidScottMullins, managing director, financial services, AWS.\nThe Fintech Times",
    "url": "https://thefintechtimes.com/mastercard-ramps-up-customer-onboarding-and-streamlines-payments-with-cloud-edge-in-apac/",
    "source": {
      "name": "Fintech Times"
    },
    "publishedAt": "2025-06-17T00:30:09Z"
  },
  {
    "title": "Stable Launches to Help UK SMEs ‘Stop Wasting Time’ and ‘Start Smashing Growth Goals’",
    "content": "Acting as a strategic layer between SMEs and the often-overwhelming and complex fintech ecosystem,Stableplans to distil complex options into clear, high-performance tools for growth.\nEquals Group‘s former chief commercial officerTom Kiddle, ex-deputy chief financial officerSteve Paul, and founding CTODom Hutson, teamed up to establish the new company after recognising that UK SMEs remain underserved, which is hindering their ability to grow.\n“We created Stable to bring together the best tech under one roof, so British businesses can stop wasting time and start smashing their growth goals in 2025,” explained co-founder Kiddle.\nStable combines deep sector expertise withAI infrastructurethat streamlines how SMEs access and manage finance: from frictionless onboarding to smart funding options that not only red tape, but also speed up access to essential capital and services.\nIts launch comes having already established partnerships with a number of fintech providers, including Equals Money,Stored,Spark Finance,Navro, andFinseta, to deliver lending, collections, and payment solutions to UK businesses.\nJames Hickman, CEO of Finseta, commented: “UK SMEs are bombarded by choice but often rely on their bank for payments and foreign exchange services, where they are underserved and overcharged. The Stable partnership gets world-class payment capabilities quickly into the hands of UK businesses that rely on them for growth.”\n“Our partnership with Stable means we can reach more business owners who need funding quickly and effectively,” addedJulian Dobbin, founder of Spark Finance.\nRecognising that the financial industry is fragmented in many ways,Stablesays it aims to position itself as a trusted broker and aggregator of high-performance fintech solutions. Ultimately, it hopes to empower SMEs in the UK by simplifying and expanding access to smarter tools, enabling them to grow faster and more confidently.\nIan Strafford-Taylor, co-CEO ofEquals-Railsr, also commented: “I am delighted to see two graduates of the ‘Equals Academy’ coming up with such an innovative business idea that will provide much-needed service to smaller business that are so often overlooked. We are delighted to be a partner to this nascent business and look forward to assisting in its success.”\nTom joined The Fintech Times in 2022 as part of the operations team; later joining the editorial team as a journalist.",
    "url": "https://thefintechtimes.com/stable-launches-to-help-uk-smes-stop-wasting-time-and-start-smashing-growth-goals/",
    "source": {
      "name": "Fintech Times"
    },
    "publishedAt": "2025-06-16T12:30:10Z"
  },
  {
    "title": "RiseUp and Salt Edge Join Forces to Bridge Financial Insights and Payments With Open Banking",
    "content": "Simply integrating open banking isn’t enough. Organisations that utilise the tech must differentiate themselves by creating value from the data they gain. By partnering withSalt Edge, RiseUp is doing just that. UK businesses will receive a richer financial experience and a deeper understanding of their customers’ financial behaviours. The integration will seeRiseUpsimplify money management through the combination of AI-driven insights, smart behavioural technology, and real-time data analysis.\nBy combining RiseUp’s behavioural intelligence and AI-powered insights with Salt Edge’s secure, open banking-compliant platform, the partnership allows businesses to move from data aggregation to meaningful customer engagement. This enables financial institutions to identify key financial moments better and help consumers take action, whether it’s saving, lending, or building long-term financial well-being.\nStephenWinyard, chief sales officer at Salt Edge, said: “We’re thrilled to be partnering with RiseUp to bring a smarter, more connected financial experience to UK users. By integrating Salt Edge’s robust open banking infrastructure, we’re helping to make financial management more intuitive, personalised, and secure.\n“Our comprehensive suite of services, including AIS and PIS, ensures that RiseUp can offer seamless access to real-time financial data and enable frictionless payments, all while maintaining the highest levels of compliance and security. Together, we’re enabling businesses to deliver smarter financial solutions and creating a more connected, actionable experience that drives better financial outcomes for consumers.”\nFounded in 2017, RiseUp harnesses open banking and AI to deliver smarter financial experiences that drive growth and improve KPIs for financial institutions and fintechs. Salt Edge brings expertise in secure bank connectivity, offering regulated access to account information services (AIS) and payment initiation services (PIS) across thousands of financial institutions in over 50 countries.\nThis partnership empowers businesses to unlock new value by turning financial data into personalised experiences that engage users and accelerate innovation.\nIt represents a step change in how financial institutions can connect insights to action, enabling real-time, personalised nudges and seamless payment journeys that help consumers build lasting financial wellbeing.\nYuvalSamet, CEO and co-founder of RiseUp, said: “Open banking has given us unprecedented access to financial data, but the true value lies in transforming that data into meaningful action. Our partnership with Salt Edge enables exactly that, combining their trusted infrastructure with RiseUp’s AI on top, to help financial institutions identify key financial moments and drive real customer engagement.\n“Together, we’re moving beyond data aggregation to unlock real growth and empower people to make smarter, more confident financial decisions.”\n\nThe Fintech Times",
    "url": "https://thefintechtimes.com/riseup-and-salt-edge-join-forces-to-bridge-financial-insights-and-payments-with-open-banking/",
    "source": {
      "name": "Fintech Times"
    },
    "publishedAt": "2025-06-16T10:01:17Z"
  },
  {
    "title": "Ria Money Transfer Sets Sights on Supporting Businesses in Malaysia to Manage Worker Wages",
    "content": "By digitally streamlining wage distribution, the Ria Prepaid Card programme, in collaboration withMastercard, provides an omnichannel solution to employers struggling with conventional banking access for their workforce.\nThe Ria Wallet enables users to deposit funds, withdraw cash from ATMs, pay bills, and also facilitates domestic and international transfers. Customers can also make payments in millions of locations in Malaysia via QR payment linked toDuitNow.\nAccording to the United Nations-ledInternational Organization of Migration(IOM), Malaysian migrants represent an estimated 15.3 per cent of Malaysia’s total workforce, many of whom are unbanked. The Ria Wallet addresses the challenges faced by both workers and employers in the country’s cash-centric payment landscape.\nEspen Kristensen, Ria Money Transfer’s managing director, Asia Pacific, expressed his excitement for the expansion of Ria’s service portfolio in Malaysia: “We understand the challenges employers in Malaysia face when it comes to managing wages for their workers. Through the Ria Wallet, companies will be able to benefit from a digital solution that improves transparency and compliance across their operations.”\nThe Ria Wallet also streamlines payroll management for Malaysia-based companies throughout industries heavily dependent on migrant workers, including construction, agriculture, and manufacturing.\nHaving established a presence inMalaysiain 2001, Ria Money Transfer is now considered a trusted provider of money transfer services locally. Leveraging a large physical network of 624,000 locations worldwide and its presence in nearly 200 countries and territories, Ria aims to provide a diverse and seamless service experience to all customers.\nIn collaboration with Mastercard, the Ria Prepaid Card programme underscores the company’s commitment to driving positive social impact through the financial empowerment of different communities worldwide.\nThe Fintech Times",
    "url": "https://thefintechtimes.com/ria-money-transfer-sets-sights-on-supporting-businesses-in-malaysia-to-manage-worker-wages/",
    "source": {
      "name": "Fintech Times"
    },
    "publishedAt": "2025-06-16T02:30:08Z"
  },
  {
    "title": "Banks Go Digital-First: The New Standard for 2025",
    "content": "Banking is no longer just about managing money—it’s about delivering digital experiences that are seamless, secure, and deeply personalized. In 2025, banks across the globe are making bold moves to go digital-first, driven by changing consumer habits, rising fintech competition, and the demand for real-time financial access.\nThis shift isn’t a trend—it’s a transformation. And it’s happening fast.\nA study by Visa and Tink revealed that almost half (44%) of young consumers in the UK believe neobanks offer significantly better tools and services than high street banks, and 27% already use third-party money management tools. This generation doesn’t just want digital options—they expect them to be fast, friendly, and helpful.\nRead more:Revolut Leads Digital Banking Surge in The UK as Downloads Top Legacy Banks\nThe research also found that 37% of UK consumers like their bank to give them more visibility over their finances. These numbers underline how digital experience now drives trust and loyalty.\nTraditional banks, meanwhile, are feeling the pressure. 57% of banking executives say that attracting young customers is their biggest challenge for the coming year, and 79% see money management tools as critical to winning new clients.\nDigital-first banking is no longer about just checking balances. Today’s leading banks are building features that give customers insights, guidance, and control over their financial lives.\nAccording toVisaand Tink’s research, modern mobile banking apps are starting to act like digital financial coaches. Features now being built into apps include:\nProactive balance forecasting to help avoid overdrafts\nPersonalized alerts for unusual spending or duplicate charges\nAutomated budgeting suggestions based on previous transactions\nSubscription tracking with the ability to cancel or pause in-app\nIn fact, 50% of UK customers said they want their bank to help them manage subscriptions, and 30% said they’d switch providers just to receive alerts on double charges or budgeting tips.\nThis digital coaching approach benefits both sides. Banks gain more engaged, loyal users; customers gain clarity and control over their spending.\nGoing digital-first doesn’t just mean speed and convenience—it must also mean safety.\nAccording to Visa, implementing world-class security across the entire customer journey is now a baseline expectation. This includesbiometric logins(face and fingerprint) and real-time fraud alerts.\nAs fraud risks grow with faster payments, banks are shifting to proactive fraud detection, using AI models to spot suspicious behaviour in real time. These systems don’t just stop fraud—they also help reduce friction for good transactions.\nDigital-first banks are also embracing embedded finance, where banking services are built into non-banking platforms.\nVisa notes that embedded finance tools are gaining traction, especially within the merchant ecosystem. For example, lending services are now being integrated into checkout flows, and white-label payment systems are enabling marketplaces to offer their own branded wallets.\nThis approach benefits everyone:\nBanks gain new distribution channels\nPlatforms improve user stickiness\nConsumers get seamless, contextual financial services\nDevelopers can build fast using Visa’s open APIs and SDKs\nThe rise of open banking is also pushing banks to become more flexible and API-driven. One practical use case is subscription management—where banks help customers track, control, and cancel recurring charges directly within the app.\nVisa’s solution includes identifying where a user’s card is stored, flagging new subscriptions, and offering controls to pause or stop charges instantly.\nFor example, YellowPepper in Peru used Visa’s aliasing technology to launch PLIN, a peer-to-peer app where users can send money with just a phone number, showing how banks can partner with fintechs to deliver user-friendly experiences.\nDigital-first isn’t a product. It’s a mindset—and a long-term strategy. Banks that succeed in 2025 and beyond will be those that put mobile tools at the heart of their offering, use AI to drive personalized insights, build secure, real-time payment rails, partner through APIs to extend reach, and stay responsive to shifting customer expectations.\nFor banks, this isn’t just about digital transformation—it’s about future survival.\nThe digital-first wave is not coming. It’s already here. Banks that lead with technology, simplicity, and customer value will be the ones that thrive in the fast-changing world of payments. Those that don’t may find themselves outpaced by more agile, customer-focused competitors.\nBanking is no longer just about managing money—it’s about delivering digital experiences that are seamless, secure, and deeply personalized. In 2025, banks across the globe are making bold moves to go digital-first, driven by changing consumer habits, rising fintech competition, and the demand for real-time financial access.\nThis shift isn’t a trend—it’s a transformation. And it’s happening fast.\nA study by Visa and Tink revealed that almost half (44%) of young consumers in the UK believe neobanks offer significantly better tools and services than high street banks, and 27% already use third-party money management tools. This generation doesn’t just want digital options—they expect them to be fast, friendly, and helpful.\nRead more:Revolut Leads Digital Banking Surge in The UK as Downloads Top Legacy Banks\nThe research also found that 37% of UK consumers like their bank to give them more visibility over their finances. These numbers underline how digital experience now drives trust and loyalty.\nTraditional banks, meanwhile, are feeling the pressure. 57% of banking executives say that attracting young customers is their biggest challenge for the coming year, and 79% see money management tools as critical to winning new clients.\nDigital-first banking is no longer about just checking balances. Today’s leading banks are building features that give customers insights, guidance, and control over their financial lives.\nAccording toVisaand Tink’s research, modern mobile banking apps are starting to act like digital financial coaches. Features now being built into apps include:\nProactive balance forecasting to help avoid overdrafts\nPersonalized alerts for unusual spending or duplicate charges\nAutomated budgeting suggestions based on previous transactions\nSubscription tracking with the ability to cancel or pause in-app\nIn fact, 50% of UK customers said they want their bank to help them manage subscriptions, and 30% said they’d switch providers just to receive alerts on double charges or budgeting tips.\nThis digital coaching approach benefits both sides. Banks gain more engaged, loyal users; customers gain clarity and control over their spending.\nGoing digital-first doesn’t just mean speed and convenience—it must also mean safety.\nAccording to Visa, implementing world-class security across the entire customer journey is now a baseline expectation. This includesbiometric logins(face and fingerprint) and real-time fraud alerts.\nAs fraud risks grow with faster payments, banks are shifting to proactive fraud detection, using AI models to spot suspicious behaviour in real time. These systems don’t just stop fraud—they also help reduce friction for good transactions.\nDigital-first banks are also embracing embedded finance, where banking services are built into non-banking platforms.\nVisa notes that embedded finance tools are gaining traction, especially within the merchant ecosystem. For example, lending services are now being integrated into checkout flows, and white-label payment systems are enabling marketplaces to offer their own branded wallets.\nThis approach benefits everyone:\nBanks gain new distribution channels\nPlatforms improve user stickiness\nConsumers get seamless, contextual financial services\nDevelopers can build fast using Visa’s open APIs and SDKs\nThe rise of open banking is also pushing banks to become more flexible and API-driven. One practical use case is subscription management—where banks help customers track, control, and cancel recurring charges directly within the app.\nVisa’s solution includes identifying where a user’s card is stored, flagging new subscriptions, and offering controls to pause or stop charges instantly.\nFor example, YellowPepper in Peru used Visa’s aliasing technology to launch PLIN, a peer-to-peer app where users can send money with just a phone number, showing how banks can partner with fintechs to deliver user-friendly experiences.\nDigital-first isn’t a product. It’s a mindset—and a long-term strategy. Banks that succeed in 2025 and beyond will be those that put mobile tools at the heart of their offering, use AI to drive personalized insights, build secure, real-time payment rails, partner through APIs to extend reach, and stay responsive to shifting customer expectations.\nFor banks, this isn’t just about digital transformation—it’s about future survival.\nThe digital-first wave is not coming. It’s already here. Banks that lead with technology, simplicity, and customer value will be the ones that thrive in the fast-changing world of payments. Those that don’t may find themselves outpaced by more agile, customer-focused competitors.",
    "url": "https://www.financemagnates.com/fintech/payments/banks-go-digital-first-the-new-standard-for-2025/",
    "source": {
      "name": "Finance Magnates – FinTech"
    },
    "publishedAt": "2025-06-16T04:21:47Z"
  },
  {
    "title": "Mirai School of Technology Is Changing Engineering in India - Here's How Students Are Learning AI from Day One",
    "content": "BusinessWire India\n\nNew Delhi [India], June 16: In a world where artificial intelligence is reshaping every industry, traditional engineering education remains trapped in yesterday's paradigms. India's AI market alone is expected to reach $17 billion by 2027, growing at over 25% annually. Yet in most colleges, students are still waiting. Waiting to code. Waiting to build. Waiting for \"real\" learning to begin, usually in the final year.\n\nThat's where Mirai School of Technology (MSOT) comes in. Based in India, MSOT is building a completely new kind of B.Tech program - one where students start building AI projects from their first semester, guided by experts who've worked at top global companies.\n\n\"We're not just teaching AI - we're training the people who will shape its future,\" say the founding team: Arpit Sarda (ex-JP Morgan), Kartik Mathur, and Varun Kohli (the team behind Coding Blocks, which has trained over 250,000 coders).\"\n\nWhat Makes MOST Different?\n\nFrom the moment students step into Mirai School of Technology's classrooms, the experience feels different. No dull lectures, no outdated textbooks. Instead, students learn to build apps, design AI tools, and solve real problems - with support from mentors who have worked at companies like Google, Microsoft, and JP Morgan.\n\nClassrooms are equipped with Apple labs, personal MacBooks, robotics kits, and premium AI tools like GitHub Copilot and ChatGPT Plus. Students also get access to MiraiVerse Labs, where they can simulate tech projects in a virtual world.\n\nA 4-Year Roadmap That's Built for the Future\n\nYear 1: Start Building Immediately\n\nStudents learn core coding languages - Python, JavaScript, and C++ - and build real-world projects like a Netflix-style recommendation engine or healthcare management apps. By the end of the year, they've already submitted entries to major tech contests like SIH and ICPC.\n\nYear 2: Step into AI\n\nNow the real AI work begins. Students explore machine learning, natural language processing, and deep learning. They build real-time tools like object detection systems (inspired by Tesla) and cloud dashboards like AWS CloudWatch. Many take part in global contests like Google Summer of Code.\n\nYear 3: Build Big, Think Bigger\n\nThis year is all about scale and specialization. Students work with Large Language Models (LLMs), generative AI, cybersecurity, and blockchain. A six-month paid internship lets them apply their skills in the real world.\n\nYear 4: Lead the Change\n\nIn the final year, students launch industry-ready platforms - e-commerce systems, AI-powered apps, and enterprise software using OpenCV, Azure, and more. Many build products that serve real businesses and communities.\n\nFor the Top 20%, A Place to Shine: Mirai School of Technology keeps its intake selective. Only the top 20% of applicants are admitted - those who show true curiosity, drive, and potential. This ensures that students learn with equally driven peers, just like they would in a real tech company.\n\nLife After MSOT: Jobs, Startups, and More\n\nWhat happens after four years?\n\nMirai School of Technology graduates don't just find jobs - they command them. With 100% placement support, over 20 career mentors, and training in resume building, interviews, and startup pitching, students are ready to lead in companies or start their own.\n\nWhether it's working in AI, fintech, healthcare, robotics, or launching a product of their own, MSOT alumni will be equipped with both the technical skills and entrepreneurial mindset to make a mark.\n\nIf you're ready to build the future, you can register for MSOT and join the next cohort. Admission timeline is 20th June 2025.\n\nWhy This Matters for India\n\nAccording to NASSCOM, India will need over 1 million AI professionals by 2026, but there's already a 51% gap between demand and supply. Traditional colleges aren't producing job-ready AI talent - but Mirai School of Technology is changing that.\n\nWith its hands-on learning, future-facing curriculum, and real-world exposure, MSOT is preparing India's next generation of AI leaders of today.\n\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by BusinessWire India. ANI will not be responsible in any way for the content of the same)",
    "url": "https://www.srilankasource.com/news/278284163/mirai-school-of-technology-is-changing-engineering-in-india-here-how-students-are-learning-ai-from-day-one",
    "source": {
      "name": "Sri Lanka Source"
    },
    "publishedAt": "2025-06-16"
  }
]