[
  {
    "title": "The cracks in the OpenAI-Microsoft relationship are reportedly widening",
    "content": "Latest\nAI\nAmazon\nApps\nBiotech & Health\nClimate\nCloud Computing\nCommerce\nCrypto\nEnterprise\nEVs\nFintech\nFundraising\nGadgets\nGaming\nGoogle\nGovernment & Policy\nHardware\nInstagram\nLayoffs\nMedia & Entertainment\nMeta\nMicrosoft\nPrivacy\nRobotics\nSecurity\nSocial\nSpace\nStartups\nTikTok\nTransportation\nVenture\nEvents\nStartup Battlefield\nStrictlyVC\nNewsletters\nPodcasts\nVideos\nPartner Content\nTechCrunch Brand Studio\nCrunchboard\nContact Us\nPosted:\nOpenAI and Microsoft may be reaching an inflection point in their relationship, according to areportfrom The Wall Street Journal.\nThe report, citing anonymous sources, says OpenAI executives have considered publicly accusing Microsoft of anticompetitive behavior throughout their partnership. OpenAI executives also mulled whether to seek a federal regulatory review of their contract with Microsoft.\nOpenAI is trying to loosen Microsoft’s grip on its intellectual property and computing resources, but the startup also needs the tech giant’s approval to complete its for-profit conversion.\nThe two companies are in a standoff over OpenAI’s $3 billion acquisition of the AI coding startup, Windsurf. OpenAI doesn’t want Microsoft to get Windsurf’s intellectual property — which could enhance the cloud provider’s own AI coding tool, GitHub Copilot — according to the report.\nWhile Microsoft was once a major accelerant to OpenAI’s growth, the companies’ relationship has grown tense. In recent months, OpenAI has reportedly tried toreduce its reliance on Microsoft for cloud services.\nTopics\nFrom seed to Series C and beyond—founders and VCs of all stages are heading to Boston. Be part of the conversation. Save $200+ now and tap into powerful takeaways, peer insights, and game-changing connections.\nSubscribe for the industry’s biggest tech news\nEvery weekday and Sunday, you can get the best of TechCrunch’s coverage.\nTechCrunch's AI experts cover the latest news in the fast-moving field.\nEvery Monday, gets you up to speed on the latest advances in aerospace.\nStartups are the core of TechCrunch, so get our best coverage delivered weekly.\nBy submitting your email, you agree to ourTermsandPrivacy Notice.\n© 2025 TechCrunch Media LLC.",
    "url": "https://techcrunch.com/2025/06/16/the-cracks-in-the-openai-microsoft-relationship-are-reportedly-widening/",
    "source": {
      "name": "TechCrunch"
    },
    "publishedAt": "2025-06-16T22:40:51Z"
  },
  {
    "title": "Finland warms up the world’s largest sand battery, and the economics look appealing",
    "content": "Latest\nAI\nAmazon\nApps\nBiotech & Health\nClimate\nCloud Computing\nCommerce\nCrypto\nEnterprise\nEVs\nFintech\nFundraising\nGadgets\nGaming\nGoogle\nGovernment & Policy\nHardware\nInstagram\nLayoffs\nMedia & Entertainment\nMeta\nMicrosoft\nPrivacy\nRobotics\nSecurity\nSocial\nSpace\nStartups\nTikTok\nTransportation\nVenture\nEvents\nStartup Battlefield\nStrictlyVC\nNewsletters\nPodcasts\nVideos\nPartner Content\nTechCrunch Brand Studio\nCrunchboard\nContact Us\nIt doesn’t look like much, but Finland recently flipped the switch on the world’s largest sand-based battery.\nYes, sand.\nA sand battery is a type of thermal energy storage system that uses sand or crushed rock to store heat. Electricity — typically from renewable sources — is used to heat the sand. That stored heat can later be used for various ends, including to warm buildings.\nThe economics are compelling, and it’s hard to get any cheaper than the crushed soapstone now housed inside an insulated silo in the small town of Pornainen. The soapstone was basically trash — discarded from a Finnish fireplace maker.\nThough it might not be as visually impressive as a large lithium-ion battery pack, the 2,000 metric tons of pulverized rock inside the 49-foot-wide silo promises to slash Pornainen’s carbon emissions, helping the town eliminate costly oil that currently helps power the town’s district heating network.\nLike many Scandinavian towns, Pornainen operates a central boiler that heats water for homes and buildings around town. Polar Night’s battery can store 1,000 megawatt-hours of heat for weeks at a time, enough for a week’s worth of heating in the chilly Finnish winter. From storage to recovery, only about 10% to 15% of the heat is lost, and the temperature at the outlet can be up to 400°C.\nThe town’s district heating system also relies on burning wood chips, and the sand battery will reduce that consumption by about 60%, according to Polar Night. Heat from the battery could also generate electricity, though the process would sacrifice some efficiency.\nAs renewables have gotten cheaper, interest in thermal batteries has grown. Beyond Polar Night, numerous startups are pursuing thermal batteries. Scotland-based Sunamp isbuilding onethat relies on the same material that gives salt-and-vinegar potato chips their flavor. Electrified Thermal Solutions, TechCrunch’s Startup Battlefield 2023runner-up, has created a type of brick that canproduce heatapproaching 2,000°C. And Fourth Power is making graphite blocks thatstore electricityas 2,400°C heat.\nPornainen’s battery is charged using electricity from the grid, and its massive storage capacity allows the operator to draw power when it’s cheapest. Finland’s grid ismostly renewables(43%) and nuclear (26%), meaning its electricity is pretty clean. It’s also thecheapest in Europeat just under €0.08 per kilowatt-hour — less than half the EU average.\nPolar Night didn’t disclose the project’s cost, though the raw materials are cheap and the structure itself isn’t particularly complex. A much smaller prototype built a few years ago cost around$25 per kilowatt-hourof storage, the company estimated at the time. It’s likely the new version is cheaper. Lithium-ion batteries cost around$115 per kilowatt-hour.\n\nTopics\nSenior Reporter, Climate\nFrom seed to Series C and beyond—founders and VCs of all stages are heading to Boston. Be part of the conversation. Save $200+ now and tap into powerful takeaways, peer insights, and game-changing connections.\nGoogle reportedly plans to cut ties with Scale AI\nNew details emerge on Meta’s $14.3B deal for Scale\n11 startups from YC Demo Day that investors are talking about\nGoogle Cloud outage brings down a lot of the internet\nWaymo rides cost more than Uber or Lyft — and people are paying anyway\nEurope, we’re not leaving. Period.\nOpenAI releases o3-pro, a souped-up version of its o3 AI reasoning model\n© 2025 TechCrunch Media LLC.",
    "url": "https://techcrunch.com/2025/06/16/finland-warms-up-the-worlds-largest-sand-battery-and-the-economics-look-appealing/",
    "source": {
      "name": "TechCrunch"
    },
    "publishedAt": "2025-06-16T21:54:29Z"
  },
  {
    "title": "Instagram tests a reposts feature",
    "content": "Latest\nAI\nAmazon\nApps\nBiotech & Health\nClimate\nCloud Computing\nCommerce\nCrypto\nEnterprise\nEVs\nFintech\nFundraising\nGadgets\nGaming\nGoogle\nGovernment & Policy\nHardware\nInstagram\nLayoffs\nMedia & Entertainment\nMeta\nMicrosoft\nPrivacy\nRobotics\nSecurity\nSocial\nSpace\nStartups\nTikTok\nTransportation\nVenture\nEvents\nStartup Battlefield\nStrictlyVC\nNewsletters\nPodcasts\nVideos\nPartner Content\nTechCrunch Brand Studio\nCrunchboard\nContact Us\nInstagram is testing the ability for users to repost posts, the company confirmed to TechCrunch on Monday. The move doesn’t come as a surprise, as the social network wasspotted developingthe feature as far back as 2022.\nSome users havereported seeingthe feature on their accounts, with onenoting that userswill be able to repost their own content in addition to other users’ posts.\nOf course, not everyone will be on board if Instagram decides to roll out the change officially, especially since it would add yet another content format to a platform already overcrowded with posts, Stories, Reels, Notes, DMs, ads, and more.\nOn the other hand, some people will welcome the change since it will allow them to share and amplify interesting content like they already do on other platforms.\nAlthough you can currently share someone’s post in your Story, this upcoming repost functionality will let you reshare the post in Instagram’s Feed. In addition, some people currently use workarounds and third-party apps to repost content, so an official reshare feature would get rid of the need to find alternatives.\nAs for creators, the repost functionality could be a way for them to boost their reach and discoverability. Plus, Instagram is flooded with reposted memes and photos that often don’t credit original posters, so the addition of a repost feature could help ensure that creators receive credit when their content is shared widely.\nIt makes sense for Instagram to introduce the ability to repost, especially since the format has been adopted by other social networks like Threads and TikTok. It’s worth noting that reposts were popularized by Twitter’s introduction ofthe “Retweet” featureback in 2009.\nAs with any other test feature, it’s unknown when or if Instagram plans to release its repost functionality to all users.\n\nTopics\nConsumer News Reporter\nAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nFrom seed to Series C and beyond—founders and VCs of all stages are heading to Boston. Be part of the conversation. Save $200+ now and tap into powerful takeaways, peer insights, and game-changing connections.\nGoogle reportedly plans to cut ties with Scale AI\nNew details emerge on Meta’s $14.3B deal for Scale\n11 startups from YC Demo Day that investors are talking about\nGoogle Cloud outage brings down a lot of the internet\nWaymo rides cost more than Uber or Lyft — and people are paying anyway\nEurope, we’re not leaving. Period.\nOpenAI releases o3-pro, a souped-up version of its o3 AI reasoning model\n© 2025 TechCrunch Media LLC.",
    "url": "https://techcrunch.com/2025/06/16/instagram-tests-a-reposts-feature/",
    "source": {
      "name": "TechCrunch"
    },
    "publishedAt": "2025-06-16T19:04:33Z"
  },
  {
    "title": "Instagram users complain of mass bans, pointing finger at AI",
    "content": "Latest\nAI\nAmazon\nApps\nBiotech & Health\nClimate\nCloud Computing\nCommerce\nCrypto\nEnterprise\nEVs\nFintech\nFundraising\nGadgets\nGaming\nGoogle\nGovernment & Policy\nHardware\nInstagram\nLayoffs\nMedia & Entertainment\nMeta\nMicrosoft\nPrivacy\nRobotics\nSecurity\nSocial\nSpace\nStartups\nTikTok\nTransportation\nVenture\nEvents\nStartup Battlefield\nStrictlyVC\nNewsletters\nPodcasts\nVideos\nPartner Content\nTechCrunch Brand Studio\nCrunchboard\nContact Us\nInstagram users have for weeks complained about a significant increase in accounts being mistakenly banned or suspended. Many suspect, without direct evidence, that the issues may have to do with the use of AI automation.\nReached for comment, Meta has so far not offered an on-record statement.\nAccording to a growing number of social media posts, including on sites like Reddit and X, Instagram users report that their accounts were banned even though they had not violated the company’s terms of service or other policies. In addition, when they submitted an appeal to have their account reviewed, some claimed they received no response.\nOthers pointed out that they have no other way to directly contact a member of Meta’s support team, leaving them at a loss for what to do next.\n“I’ve already submitted multiple appeals, uploaded my ID, and tried reaching out to Meta through all the official channels, but I’ve been completely ignored. It feels like I’m shouting into a void,”wroteone Reddit user (u/Dyrovicious) about having their personal Instagram account banned.\n(We should note that Meta offersVerified accountsubscriptions for creators and businesses that offer priority access to customer service.)\nThe Instagram Redditcommunity’stop posts are nearly entirely focused on the ban wave and have been for weeks. On X, users areflooding Instagram’s replieswith pleas for the company to do something about the account suspensions or, at the very least, acknowledge the problem publicly. A Change.orgpetitionabout the bans now has over 4,000 signatures.\nThe situation has gotten so tense that some are nowthreatening to file a class action lawsuitagainst Meta over the bans.\nOf course, large internet companies will inevitably encounter a certain number of false positives due to their reliance on automated moderation systems, which occasionally make mistakes. However, an excessive number of bans is something that’s become a more recent focus — and one where many immediately suspect AI may be at fault.\nFor instance, Pinterest earlier this year was facing a similar problem with mass bans, which saw users complaining that their actions and posts hadn’t violated the company’s policies. One group of users had alsothreatenedlegal action over the bans at the time. Pinterest in May finallyadmittedthat the mass bans were a mistake caused by an “internal error,” but wouldn’t pinpoint the exact cause. The company claimed that the error was not due to AI moderation, though.\nIn Instagram’s case, the issues aren’t just affecting personal use of the app but also people’s livelihoods, as businesses have been caught up in the mass bans.\n“This is my livelihood, my full-time job. I heavily rely on Instagram for leads,”wrote one Reddit user(u/Paigejust) about their suspension.\n“This ban has directly affected my business and all of the hard work and branding that I’ve spent countless hours pouring into my business, my gym, and my students,” a gym owner on Reddit (u/CourtShaw)shared.\nWithout access to internal company data, it’s hard from the outside to tell whether recent bans represent an uptick in the number of typical false positives or not. To date, Meta has not publicly acknowledged the issue.\nIn addition, some of the Instagram users affected have reported that they’re being falsely banned for serious offenses, including CSE (child sexual exploitation). Theypointed outthat this is a career and reputation-ruining accusation, leaving them highly concerned.\n\nTopics\nConsumer News Editor\nSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nFrom seed to Series C and beyond—founders and VCs of all stages are heading to Boston. Be part of the conversation. Save $200+ now and tap into powerful takeaways, peer insights, and game-changing connections.\nGoogle reportedly plans to cut ties with Scale AI\nNew details emerge on Meta’s $14.3B deal for Scale\n11 startups from YC Demo Day that investors are talking about\nGoogle Cloud outage brings down a lot of the internet\nWaymo rides cost more than Uber or Lyft — and people are paying anyway\nEurope, we’re not leaving. Period.\nOpenAI releases o3-pro, a souped-up version of its o3 AI reasoning model\n© 2025 TechCrunch Media LLC.",
    "url": "https://techcrunch.com/2025/06/16/instagram-users-complain-of-mass-bans-pointing-finger-at-ai/",
    "source": {
      "name": "TechCrunch"
    },
    "publishedAt": "2025-06-16T18:44:04Z"
  },
  {
    "title": "Deadline day: Startup Battlefield 200 applications close at midnight",
    "content": "Latest\nAI\nAmazon\nApps\nBiotech & Health\nClimate\nCloud Computing\nCommerce\nCrypto\nEnterprise\nEVs\nFintech\nFundraising\nGadgets\nGaming\nGoogle\nGovernment & Policy\nHardware\nInstagram\nLayoffs\nMedia & Entertainment\nMeta\nMicrosoft\nPrivacy\nRobotics\nSecurity\nSocial\nSpace\nStartups\nTikTok\nTransportation\nVenture\nEvents\nStartup Battlefield\nStrictlyVC\nNewsletters\nPodcasts\nVideos\nPartner Content\nTechCrunch Brand Studio\nCrunchboard\nContact Us\nThese are your final hours to apply to the most iconic pitch competition in tech —Startup Battlefield 200.\nBattle it out in front of 10,000+ startup leaders, investors, and media atTechCrunch Disrupt 2025. It’s your moment to be seen, funded, and remembered — and maybe even walk away with $100,000 in equity-free funding.\nThis isn’t your average pitch. It’s where the bold go to break out. If your startup has traction, vision, and grit, you’ve got until 11:59 p.m. PT tonight to enter.\nTwo hundred startups will be selected. Twenty will pitch live on the main stage. One will win the Disrupt Cup and take home $100,000 in equity-free funding.\nThis is the launchpad of legends: Trello, Mint, Dropbox, Getaround, Discord, and many more.Now it’s your turn.\nWe want pre-Series A startups with MVPs and massive ambition. Whether you’re bootstrapped or already funded — if you’re bold enough, you’re battle-ready. Select Series A startups may qualify too.\nApplications close at 11:59 p.m. PT tonight. Don’t wait.Apply now.\nTopics\nFrom seed to Series C and beyond—founders and VCs of all stages are heading to Boston. Be part of the conversation. Save $200+ now and tap into powerful takeaways, peer insights, and game-changing connections.\nGoogle reportedly plans to cut ties with Scale AI\nNew details emerge on Meta’s $14.3B deal for Scale\n11 startups from YC Demo Day that investors are talking about\nGoogle Cloud outage brings down a lot of the internet\nWaymo rides cost more than Uber or Lyft — and people are paying anyway\nEurope, we’re not leaving. Period.\nOpenAI releases o3-pro, a souped-up version of its o3 AI reasoning model\n© 2025 TechCrunch Media LLC.",
    "url": "https://techcrunch.com/2025/06/16/deadline-day-startup-battlefield-200-applications-close-at-midnight/",
    "source": {
      "name": "TechCrunch"
    },
    "publishedAt": "2025-06-16T18:00:00Z"
  },
  {
    "title": "WeChat’s HarmonyOS version surpasses six million installs",
    "content": "According to data from Huawei’s AppGallery, the HarmonyOS version of WeChat has surpassed 6 million installations, with an average of about 100,000 downloads per day. Since its launch in January, the app has steadily added features and now supports core functions including messaging, WeChat Pay, mini programs and video channels. New capabilities, such as forwarding saved content and long-press translation for text messages, were introduced in the latest update. As more Huawei devices come preinstalled with HarmonyOS — an operating system developed independently of Android and iOS — the growing user base is expected to drive further adoption. The trend highlights the expanding role of the Harmony ecosystem in the social app sector. [IThome, in Chinese]",
    "url": "https://technode.com/2025/06/16/wechats-harmonyos-version-surpasses-six-million-installs/",
    "source": {
      "name": "TechNode (動點科技)"
    },
    "publishedAt": "2025-06-16T13:53:55Z"
  },
  {
    "title": "Chinese phone maker Transsion rapidly expanding electric scooter business in Africa",
    "content": "Chinese phone maker Transsion has recently established a mobility division to explore opportunities in electric two-wheelers and related sectors. The company, which makes around half of the mobile phones sold in Africa, is rapidly scaling its electric two-wheeler operations across Africa and in developing countries on other continents, sources said. To support this expansion, Transsion is recruiting for several key roles, including Country Head of Mobility and Overseas Key Account Manager. According to Chinese job platform Boss Zhipin, the Country Head of Mobility based in Côte d’Ivoire will lead Transsion’s electric two-wheeler operations in the country, focusing on developing partnerships with local businesses and building teams that support customer needs. The Overseas Key Account Manager based in Nigeria will focus on client development and relationship management in the Nigerian market. [IThome, in Chinese]\n",
    "url": "https://technode.com/2025/06/16/chinese-phone-maker-transsion-rapidly-expanding-electric-scooter-business-in-africa/",
    "source": {
      "name": "TechNode (動點科技)"
    },
    "publishedAt": "2025-06-16T07:30:00Z"
  },
  {
    "title": "CATL to build 10 battery swap stations in Hong Kong by 2027",
    "content": "CATL is planning to build 10 battery swap stations for electric vehicles across Hong Kong by the end of 2026, in a move the battery giant expects to significantly reduce the time it takes to charge an EV in the city and to improve working efficiency for local taxi drivers. The company said on June 13 it will collaborate with Chinese state-owned automaker FAW and Dragon Rise New Energy Holdings Ltd, a Hong Kong-listed energy infrastructure provider, to push the adoption of the technology in Hong Kong. As part of the move, a number of right-hand-drive versions of FAW’s E-QM5 electric sedan under its Hongqi or Red Flag marque, known to be former state leader Chairman Mao Zedong’s favorite car brand, will incorporate CATL’s swappable EV batteries and be distributed in the city. CATL in December announced plans to build 1,000 battery swap stations in China in 2025. A joint venture between CATL and Orange Energy, the energy unit of ride-hailing platform Didi, will render development and operative support for the battery swap online platform. [TechNodereporting,The Paper, in Chinese]\n\nUpdated: The story was updated on June 16 to better reflect Didi’s role in the joint collaboration.\n",
    "url": "https://technode.com/2025/06/16/catl-to-build-10-battery-swap-stations-in-hong-kong-by-2027/",
    "source": {
      "name": "TechNode (動點科技)"
    },
    "publishedAt": "2025-06-16T06:59:06Z"
  },
  {
    "title": "Tencent not in talks to acquire Nexon, source says: report",
    "content": "A source close to Tencent has revealed on Friday that “Tencent has not been in contact with the founder’s family to discuss a deal, nor is it considering acquiring Nexon.” Earlier media reports claimed that Tencent was exploring a potential acquisition of South Korean game developer Nexon at a valuation of $15 billion and had already approached the founder’s family. Public information shows that NXC, the holding company of Nexon’s founding family, owns 48.42% of Nexon, while the Public Investment Fund of Saudi Arabia is the second-largest shareholder with a 10.51% stake. [BKE Economy, in Chinese]",
    "url": "https://technode.com/2025/06/15/tencent-not-in-talks-to-acquire-nexon-source-says-report/",
    "source": {
      "name": "TechNode (動點科技)"
    },
    "publishedAt": "2025-06-15T13:05:07Z"
  },
  {
    "title": "NetEase’s wuxia game Justice debuts on Steam, global launch expected this year",
    "content": "NetEase’s martial arts MMORPG Justice (Nishuihan) launched its Steam store page, with a global release expected later this year. The Steam version is anticipated to include the full content along with localization optimized for overseas players. While the release date and pricing remain unannounced, further details will be revealed soon. Justice (Nishuihan) is an open-world martial arts MMORPG developed by NetEase, featuring immersive storytelling, free exploration, a light progression system, and a mix of PvE and PvP gameplay—all designed to recreate an authentic and dynamic wuxia world. [TechNode reporting]",
    "url": "https://technode.com/2025/06/14/neteases-wuxia-game-justice-debuts-on-steam-global-launch-expected-this-year/",
    "source": {
      "name": "TechNode (動點科技)"
    },
    "publishedAt": "2025-06-14T11:19:25Z"
  },
  {
    "title": "OpenAI 獲美國防部合約、將開發 AI 以應對國安挑戰",
    "content": "華爾街日報週一（6 月 16 日）報導，OpenAI 公共部門獲得美國國防部一份價值 2 億美元的合約，OpenAI 將藉此協助軍方應對國家安全挑戰。\n五角大廈週一表示，OpenAI將與美國國防部首席數位人工智慧辦公室（CDAO）合作開發原型前沿人工智慧（AI）能力，以應對作戰和企業領域的關鍵挑戰。\nReuters報導，五角大廈週一表示，這項工作主要將在華盛頓特區及其附近進行，預計在2026年7月完成。\n白宮預算管理局（OMB）4月發布新指引、指示聯邦機構須確保政府和大眾受益於具競爭力的美國AI市場（不包括國家安全和國防系統）。\nCNBC報導，OpenAI發言人日前透露，排除來自微軟（Microsoft）的授權收入和一次性大額交易不計、OpenAI年度經常性營收（ARR）已達到100億美元，遠高於去年一整年的ARR（55億美元）。\nOpenAI新任招聘主管Joaquin Quinonero Candela週一在LinkedIn發表專文指出，OpenAI員工規模在過去兩年半中擴增將近10倍、目前正面臨前所未有的成長壓力，全世界都在關注OpenAI將如何利用通用人工智慧（AGI）進行招聘。\n根據史丹佛大學公布的2025年人工智慧指數報告（2025 AI Index Report），OpenAI 2024年發布7個值得關注的AI模型，與Google並列第一。\n（本文由MoneyDJ新聞授權轉載；首圖來源：Unsplash）\n文章看完覺得有幫助，何不給我們一個鼓勵\n您的咖啡贊助將是讓我們持續走下去的動力\n從這裡可透過《Google 新聞》追蹤 TechNews\n科技新知，時時更新",
    "url": "https://infosecu.technews.tw/2025/06/17/openai-wins-200-million-us-defense-contract/",
    "source": {
      "name": "TechNews (台灣)"
    },
    "publishedAt": "2025-06-17T02:30:16Z"
  },
  {
    "title": "政府 111 簡訊防詐升級，6 月起新增手機末三碼與機關具名驗證",
    "content": "為防範詐騙集團假冒政府名義發送簡訊，數位發展部宣布自 6 月 1 日起，強化「111 政府專屬短碼簡訊平台」識別機制，新增「手機號碼末三碼」與「發送機關名稱」兩項辨識資訊，結合原有的 111 簡訊專屬來源號碼，構成三重防詐識別，提高民眾判斷真偽的能力。\n\n數發部指出，過去詐騙集團曾透過非法 2G 基地台，以蓋台方式發送偽冒簡訊，造成民眾困擾。為此，政府整合簡訊平台服務內容，推動「政府簡訊安心辨識三步驟」，透過「111 號碼」、「手機末三碼」及「具名機關」三重驗證，協助民眾快速辨別是否為官方訊息。\n數發部說明，該平台具備多層防護設計，所有發送機關須經過授權，並採 IP 白名單與加密傳輸控管，簡訊亦不保留收件人資料，以降低個資風險。發送方式則支援人工與 API 串接，亦可依需求進行定期推播。\n數發部統計，自平台於 112 年上線以來，已有超過 500 個政府機關及國營事業使用，發送量突破 6,000 萬則，涵蓋水電帳單、就醫提醒、勞保通知、疫苗接種等多項民生應用。\n未來數發部將持續與國家通訊傳播委員會及內政部警政署合作，從訊息來源確認、通訊監管到詐騙查緝等面向強化聯防，打造穩固且可信的政府對外簡訊通報體系。\n（首圖來源：pixabay）\n文章看完覺得有幫助，何不給我們一個鼓勵\n您的咖啡贊助將是讓我們持續走下去的動力\n從這裡可透過《Google 新聞》追蹤 TechNews\n科技新知，時時更新",
    "url": "https://infosecu.technews.tw/2025/06/17/111-moda-security/",
    "source": {
      "name": "TechNews (台灣)"
    },
    "publishedAt": "2025-06-17T02:29:31Z"
  },
  {
    "title": "傳歐盟輸美商品關稅定為 10%？歐盟執委會否認",
    "content": "近期有消息指出，歐盟已接受輸美商品遭課徵 10% 關稅的提案，不過，歐盟執委會出面駁斥此說，稱談判仍在進行中。\n德國商報（Handelsblatt）近日報導，歐盟談判代表已同意美國對歐盟進口產品統一徵收10%關稅，以避免歐盟汽車、藥品和電子產品被加徵關稅。消息指出，若美國放寬歐洲汽車關稅，歐盟也打算降低美國汽車進口關稅，並承認部分美國產品標準。\n不過，歐盟執委會發表聲明指出，談判仍在進行中，目前尚未達成任何協議，歐盟反對美國不合理且非法的關稅政策。\n川普政府4月以來掀起貿易戰，但之後暫緩中國以外區域的對等關稅90日（維持10%基本稅率）。川普還一度威脅要對歐盟課徵50%關稅，但同意延至7月9日實施；歐盟現還面臨25%的汽車關稅和50%的鋼鋁關稅。\n歐盟貿易執委塞夫柯維奇（Maros Sefcovic）和美國貿易代表格里爾（Jamieson Greer）將在本週於加拿大召開的G7峰會上進一步談判。\n川普在參與G7峰會前夕再度重申自己是個「關稅人」（tariff person），暗示與各國會晤的重點將擺在關稅協議。\n英國已於5月率先和美國談成雙邊貿易協議，輸美商品維持10%稅率，同時獲降低鋼鐵、汽車關稅。不過，歐盟曾表示，此一條件對歐盟27國來說是不可接受的。\n先前已有多方消息指出，川普政府設定的關稅地板稅率就是10%起跳，任何貿易夥伴的關稅待遇都不會低於這一數字。\n（本文由MoneyDJ新聞授權轉載；首圖來源：Unsplash）\n文章看完覺得有幫助，何不給我們一個鼓勵\n您的咖啡贊助將是讓我們持續走下去的動力\n從這裡可透過《Google 新聞》追蹤 TechNews\n科技新知，時時更新",
    "url": "https://technews.tw/2025/06/17/euro-10-percent-tariff-deny/",
    "source": {
      "name": "TechNews (台灣)"
    },
    "publishedAt": "2025-06-17T02:20:53Z"
  },
  {
    "title": "AMD 目標價獲調高、盼 GPU 事業 Q4 回神  股價飆 8%",
    "content": "超微（AMD）獲 Piper Sandler 以繪圖處理器（GPU）事業有望於第四季回神為由上修目標價，股價聞訊飆高。\nCNBC、MarketWatch等外電報導，Piper Sandler將AMD目標價從125美元上修至140美元，投資評等維持在「加碼」。該證券認為，AMD因華盛頓當局對中國的先進晶片出口管制而引發的8億美元費用，等到Q4就能大致認列完畢。\nAMD上週發表次世代AI晶片「Instinct MI400」系列。值得注意的是，AMD推出「Helios」伺服器機櫃，可連結數千顆MI400晶片、預定2026年問世。這款晶片系統對於雲端業者及大型語言模型開發商等AI客戶而言，將具有舉足輕重的地位。\nPiper Sandler報告稱，「我們對AMD本週的產品發布會感到振奮，尤其是Helios機櫃，這對AMD Instinct的成長至關重要。」\nAMD在產品發表會上宣布的合作夥伴包括OpenAI、Facebook母公司Meta Platforms、甲骨文（Oracle）及微軟（Microsoft）。\n美國銀行分析師團隊相信，AMD還會高調宣布另一家夥伴，也就是亞馬遜網路服務公司（Amazon Web Services，AWS）。美銀將AMD目標價維持在130美元、投資評等維持在「買進」。\nAMD 16日股價應聲大漲8.81%、收126.39美元，創1月7日以來收盤新高，漲幅居費城半導體指數30支成分股之冠。\n（本文由MoneyDJ新聞授權轉載；首圖來源：shutterstock）\n文章看完覺得有幫助，何不給我們一個鼓勵\n您的咖啡贊助將是讓我們持續走下去的動力\n從這裡可透過《Google 新聞》追蹤 TechNews\n科技新知，時時更新",
    "url": "https://finance.technews.tw/2025/06/17/amd-shares-rise-9-percent-after-analysts-say-they-expect-a-snapback-for-chipmaker/",
    "source": {
      "name": "TechNews (台灣)"
    },
    "publishedAt": "2025-06-17T02:15:35Z"
  },
  {
    "title": "川普出面助 EchoStar 保住頻譜執照  股價暴漲近 50%",
    "content": "EchoStar 為美國電信公司，利用衛星技術提供行動通信網路服務。日前有報導指出，美國總統川普出面牽線，協助 EchoStar 保住頻譜執照，消息迅速引發投資圈關注，16 日 EchoStar 股價暴漲近 50%。\n彭博社13日率先報導，據知情人士爆料，EchoStar遭控未履行5G網路建設與涵蓋義務，美國聯邦通訊委員會（FCC）近日啟動調查，不排除撤銷EchoStar的頻譜執照。EchoStar因此事向白宮求援，在美國總統川普居中牽線下，EchoStar董事長Charlie Ergen 12日會見FCC主席Brendan Carr，力求保住頻譜執照。\n川普親自開口告訴FCC主席Carr，他不希望看到美國大企業破產倒閉，敦促Carr與Ergen共同努力，朝達成協議的目標邁進。\n6月16日，EchoStar股價驟升49.11%、收25.11美元，寫下2008年1月2日以來最大單日漲幅。EchoStar先前表示，由於FCC審查結果變數難料，該公司暫無法支付5億美元的借款利息。\n（本文由MoneyDJ新聞授權轉載；首圖來源：EchoStar）\n文章看完覺得有幫助，何不給我們一個鼓勵\n您的咖啡贊助將是讓我們持續走下去的動力\n從這裡可透過《Google 新聞》追蹤 TechNews\n科技新知，時時更新",
    "url": "https://finance.technews.tw/2025/06/17/echostar-soars-50-percent-after-report-trump-urged-echostar/",
    "source": {
      "name": "TechNews (台灣)"
    },
    "publishedAt": "2025-06-17T02:00:05Z"
  },
  {
    "title": "China’s $9 AI Video Tool Kling 2.1 Adds Audio—Can It Beat Google’s $250 Veo 3?",
    "content": "$106,871.00\n$2,571.88\n$2.24\n$653.65\n$151.37\n$0.999734\n$0.173716\n$0.274051\n$2,567.62\n$0.632685\n$42.17\n$106,911.00\n$3,096.78\n$2.99\n$470.52\n$13.51\n$9.26\n$0.261155\n$19.14\n$51.65\n$2.96\n$0.999821\n$0.00001193\n$2,747.72\n$2,572.63\n$86.70\n$0.1547\n$1.00\n$322.96\n$0.99954\n$3.85\n$4.53\n$106,836.00\n$7.61\n$0.00001054\n$0.580911\n$278.30\n$1.18\n$364.22\n$51.47\n$4.67\n$1.00\n$5.40\n$2.26\n$0.090485\n$32.65\n$183.09\n$16.98\n$1.055\n$0.786763\n$1.00\n$0.615216\n$0.075882\n$16.41\n$9.76\n$0.02229071\n$0.089636\n$4.44\n$4.15\n$107,028.00\n$0.297918\n$0.200422\n$0.680709\n$3.42\n$2.46\n$2,572.89\n$0.320029\n$0.999548\n$0.947486\n$4.45\n$0.175845\n$0.996729\n$103.71\n$0.999721\n$11.17\n$1.45\n$160.41\n$0.419386\n$1.23\n$2,928.06\n$0.01792205\n$1.83\n$2,692.47\n$1.70\n$1.14\n$0.00001476\n$11.58\n$0.33664\n$1.00\n$3.50\n$0.58719\n$0.999881\n$0.01554261\n$0.644606\n$0.175823\n$2,747.41\n$0.059181\n$0.999377\n$2,696.49\n$106,652.00\n$0.153643\n$654.15\n$106,704.00\n$2,699.83\n$3,424.96\n$3,402.49\n$0.838411\n$0.08746\n$107,533.00\n$0.52779\n$0.441267\n$0.601946\n$1.11\n$169.13\n$0.00007742\n$2.19\n$0.826892\n$197.05\n$2.28\n$2,779.60\n$111.45\n$0.703851\n$42.54\n$20.63\n$0.01502962\n$0.999488\n$0.00000067\n$4.04\n$0.267685\n$0.781412\n$0.169532\n$32.55\n$0.01016551\n$1.094\n$0.01305309\n$0.460307\n$0.107576\n$0.997777\n$42.03\n$106,270.00\n$0.56216\n$0.580221\n$2.17\n$0.531276\n$2,570.84\n$2,570.35\n$106,806.00\n$0.352302\n$0.998825\n$2,748.05\n$0.204234\n$0.668847\n$2,673.79\n$1.51\n$106,881.00\n$0.266537\n$2,572.71\n$8.81\n$0.997563\n$0.01450234\n$42.00\n$53.88\n$0.435525\n$1.46\n$2.44\n$0.174102\n$1.53\n$0.04428865\n$0.061115\n$0.999711\n$1.00\n$38.20\n$0.349411\n$0.00000042\n$1.09\n$0.121486\n$1.082\n$1.007\n$0.999768\n$0.514058\n$0.407814\n$5.66\n$14.06\n$0.396724\n$0.00455296\n$0.00679103\n$2,731.41\n$0.00001959\n$0.532172\n$0.075739\n$2.34\n$0.00378371\n$0.998765\n$2,566.27\n$5.75\n$0.00000094\n$0.140916\n$0.03692508\n$1.18\n$2,835.40\n$0.03683982\n$0.139089\n$0.00377804\n$0.01775428\n$1.42\n$2,810.38\n$0.843598\n$106,862.00\n$0.337504\n$0.159807\n$2,570.48\n$106,520.00\n$0.501531\n$0.00005991\n$0.782318\n$0.03284134\n$19.78\n$1.19\n$164.41\n$0.00376566\n$0.999683\n$0.99892\n$0.00000154\n$0.999267\n$0.067208\n$2,567.59\n$0.311681\n$115.12\n$0.00566351\n$19.14\n$0.200343\n$0.999704\n$0.640992\n$106,917.00\n$0.01883861\n$1.004\n$1.77\n$0.625821\n$1.017\n$0.196924\n$9.20\n$2,146.72\n$103,863.00\n$6.42\n$0.00381959\n$105,080.00\n$15.21\n$23.19",
    "url": "https://decrypt.co/325459/kling-ai-video-tool-audio-beat-googles-250-veo-3",
    "source": {
      "name": "Decrypt"
    },
    "publishedAt": "2025-06-17T00:40:14Z"
  },
  {
    "title": "Avalanche Launches Free Gaming 'Battle Pass' With AVAX and NFT Rewards",
    "content": "$106,871.00\n$2,571.88\n$2.24\n$653.65\n$151.37\n$0.999734\n$0.173716\n$0.274051\n$2,567.62\n$0.632685\n$42.17\n$106,911.00\n$3,096.78\n$2.99\n$470.52\n$13.51\n$9.26\n$0.261155\n$19.14\n$51.65\n$2.96\n$0.999821\n$0.00001193\n$2,747.72\n$2,572.63\n$86.70\n$0.1547\n$1.00\n$322.96\n$0.99954\n$3.85\n$4.53\n$106,836.00\n$7.61\n$0.00001054\n$0.580911\n$278.30\n$1.18\n$364.22\n$51.47\n$4.67\n$1.00\n$5.40\n$2.26\n$0.090485\n$32.65\n$183.09\n$16.98\n$1.055\n$0.786763\n$1.00\n$0.615216\n$0.075882\n$16.41\n$9.76\n$0.02229071\n$0.089636\n$4.44\n$4.15\n$107,028.00\n$0.297918\n$0.200422\n$0.680709\n$3.42\n$2.46\n$2,572.89\n$0.320029\n$0.999548\n$0.947486\n$4.45\n$0.175845\n$0.996729\n$103.71\n$0.999721\n$11.17\n$1.45\n$160.41\n$0.419386\n$1.23\n$2,928.06\n$0.01792205\n$1.83\n$2,692.47\n$1.70\n$1.14\n$0.00001476\n$11.58\n$0.33664\n$1.00\n$3.50\n$0.58719\n$0.999881\n$0.01554261\n$0.644606\n$0.175823\n$2,747.41\n$0.059181\n$0.999377\n$2,696.49\n$106,652.00\n$0.153643\n$654.15\n$106,704.00\n$2,699.83\n$3,424.96\n$3,402.49\n$0.838411\n$0.08746\n$107,533.00\n$0.52779\n$0.441267\n$0.601946\n$1.11\n$169.13\n$0.00007742\n$2.19\n$0.826892\n$197.05\n$2.28\n$2,779.60\n$111.45\n$0.703851\n$42.54\n$20.63\n$0.01502962\n$0.999488\n$0.00000067\n$4.04\n$0.267685\n$0.781412\n$0.169532\n$32.55\n$0.01016551\n$1.094\n$0.01305309\n$0.460307\n$0.107576\n$0.997777\n$42.03\n$106,270.00\n$0.56216\n$0.580221\n$2.17\n$0.531276\n$2,570.84\n$2,570.35\n$106,806.00\n$0.352302\n$0.998825\n$2,748.05\n$0.204234\n$0.668847\n$2,673.79\n$1.51\n$106,881.00\n$0.266537\n$2,572.71\n$8.81\n$0.997563\n$0.01450234\n$42.00\n$53.88\n$0.435525\n$1.46\n$2.44\n$0.174102\n$1.53\n$0.04428865\n$0.061115\n$0.999711\n$1.00\n$38.20\n$0.349411\n$0.00000042\n$1.09\n$0.121486\n$1.082\n$1.007\n$0.999768\n$0.514058\n$0.407814\n$5.66\n$14.06\n$0.396724\n$0.00455296\n$0.00679103\n$2,731.41\n$0.00001959\n$0.532172\n$0.075739\n$2.34\n$0.00378371\n$0.998765\n$2,566.27\n$5.75\n$0.00000094\n$0.140916\n$0.03692508\n$1.18\n$2,835.40\n$0.03683982\n$0.139089\n$0.00377804\n$0.01775428\n$1.42\n$2,810.38\n$0.843598\n$106,862.00\n$0.337504\n$0.159807\n$2,570.48\n$106,520.00\n$0.501531\n$0.00005991\n$0.782318\n$0.03284134\n$19.78\n$1.19\n$164.41\n$0.00376566\n$0.999683\n$0.99892\n$0.00000154\n$0.999267\n$0.067208\n$2,567.59\n$0.311681\n$115.12\n$0.00566351\n$19.14\n$0.200343\n$0.999704\n$0.640992\n$106,917.00\n$0.01883861\n$1.004\n$1.77\n$0.625821\n$1.017\n$0.196924\n$9.20\n$2,146.72\n$103,863.00\n$6.42\n$0.00381959\n$105,080.00\n$15.21\n$23.19",
    "url": "https://decrypt.co/325391/avalanche-launches-gaming-battle-pass-rewards",
    "source": {
      "name": "Decrypt"
    },
    "publishedAt": "2025-06-17T00:19:17Z"
  },
  {
    "title": "Cantor Sees 75% Upside in Solana-Focused Stocks With New Analyst Coverage",
    "content": "$106,871.00\n$2,571.88\n$2.24\n$653.65\n$151.37\n$0.999734\n$0.173716\n$0.274051\n$2,567.62\n$0.632685\n$42.17\n$106,911.00\n$3,096.78\n$2.99\n$470.52\n$13.51\n$9.26\n$0.261155\n$19.14\n$51.65\n$2.96\n$0.999821\n$0.00001193\n$2,747.72\n$2,572.63\n$86.70\n$0.1547\n$1.00\n$322.96\n$0.99954\n$3.85\n$4.53\n$106,836.00\n$7.61\n$0.00001054\n$0.580911\n$278.30\n$1.18\n$364.22\n$51.47\n$4.67\n$1.00\n$5.40\n$2.26\n$0.090485\n$32.65\n$183.09\n$16.98\n$1.055\n$0.786763\n$1.00\n$0.615216\n$0.075882\n$16.41\n$9.76\n$0.02229071\n$0.089636\n$4.44\n$4.15\n$107,028.00\n$0.297918\n$0.200422\n$0.680709\n$3.42\n$2.46\n$2,572.89\n$0.320029\n$0.999548\n$0.947486\n$4.45\n$0.175845\n$0.996729\n$103.71\n$0.999721\n$11.17\n$1.45\n$160.41\n$0.419386\n$1.23\n$2,928.06\n$0.01792205\n$1.83\n$2,692.47\n$1.70\n$1.14\n$0.00001476\n$11.58\n$0.33664\n$1.00\n$3.50\n$0.58719\n$0.999881\n$0.01554261\n$0.644606\n$0.175823\n$2,747.41\n$0.059181\n$0.999377\n$2,696.49\n$106,652.00\n$0.153643\n$654.15\n$106,704.00\n$2,699.83\n$3,424.96\n$3,402.49\n$0.838411\n$0.08746\n$107,533.00\n$0.52779\n$0.441267\n$0.601946\n$1.11\n$169.13\n$0.00007742\n$2.19\n$0.826892\n$197.05\n$2.28\n$2,779.60\n$111.45\n$0.703851\n$42.54\n$20.63\n$0.01502962\n$0.999488\n$0.00000067\n$4.04\n$0.267685\n$0.781412\n$0.169532\n$32.55\n$0.01016551\n$1.094\n$0.01305309\n$0.460307\n$0.107576\n$0.997777\n$42.03\n$106,270.00\n$0.56216\n$0.580221\n$2.17\n$0.531276\n$2,570.84\n$2,570.35\n$106,806.00\n$0.352302\n$0.998825\n$2,748.05\n$0.204234\n$0.668847\n$2,673.79\n$1.51\n$106,881.00\n$0.266537\n$2,572.71\n$8.81\n$0.997563\n$0.01450234\n$42.00\n$53.88\n$0.435525\n$1.46\n$2.44\n$0.174102\n$1.53\n$0.04428865\n$0.061115\n$0.999711\n$1.00\n$38.20\n$0.349411\n$0.00000042\n$1.09\n$0.121486\n$1.082\n$1.007\n$0.999768\n$0.514058\n$0.407814\n$5.66\n$14.06\n$0.396724\n$0.00455296\n$0.00679103\n$2,731.41\n$0.00001959\n$0.532172\n$0.075739\n$2.34\n$0.00378371\n$0.998765\n$2,566.27\n$5.75\n$0.00000094\n$0.140916\n$0.03692508\n$1.18\n$2,835.40\n$0.03683982\n$0.139089\n$0.00377804\n$0.01775428\n$1.42\n$2,810.38\n$0.843598\n$106,862.00\n$0.337504\n$0.159807\n$2,570.48\n$106,520.00\n$0.501531\n$0.00005991\n$0.782318\n$0.03284134\n$19.78\n$1.19\n$164.41\n$0.00376566\n$0.999683\n$0.99892\n$0.00000154\n$0.999267\n$0.067208\n$2,567.59\n$0.311681\n$115.12\n$0.00566351\n$19.14\n$0.200343\n$0.999704\n$0.640992\n$106,917.00\n$0.01883861\n$1.004\n$1.77\n$0.625821\n$1.017\n$0.196924\n$9.20\n$2,146.72\n$103,863.00\n$6.42\n$0.00381959\n$105,080.00\n$15.21\n$23.19",
    "url": "https://decrypt.co/325457/cantor-solana-focused-stocks-analyst-coverage",
    "source": {
      "name": "Decrypt"
    },
    "publishedAt": "2025-06-16T23:55:16Z"
  },
  {
    "title": "JP Morgan Files Trademark for JPMD: Is It a Stablecoin?",
    "content": "$106,871.00\n$2,571.88\n$2.24\n$653.65\n$151.37\n$0.999734\n$0.173716\n$0.274051\n$2,567.62\n$0.632685\n$42.17\n$106,911.00\n$3,096.78\n$2.99\n$470.52\n$13.51\n$9.26\n$0.261155\n$19.14\n$51.65\n$2.96\n$0.999821\n$0.00001193\n$2,747.72\n$2,572.63\n$86.70\n$0.1547\n$1.00\n$322.96\n$0.99954\n$3.85\n$4.53\n$106,836.00\n$7.61\n$0.00001054\n$0.580911\n$278.30\n$1.18\n$364.22\n$51.47\n$4.67\n$1.00\n$5.40\n$2.26\n$0.090485\n$32.65\n$183.09\n$16.98\n$1.055\n$0.786763\n$1.00\n$0.615216\n$0.075882\n$16.41\n$9.76\n$0.02229071\n$0.089636\n$4.44\n$4.15\n$107,028.00\n$0.297918\n$0.200422\n$0.680709\n$3.42\n$2.46\n$2,572.89\n$0.320029\n$0.999548\n$0.947486\n$4.45\n$0.175845\n$0.996729\n$103.71\n$0.999721\n$11.17\n$1.45\n$160.41\n$0.419386\n$1.23\n$2,928.06\n$0.01792205\n$1.83\n$2,692.47\n$1.70\n$1.14\n$0.00001476\n$11.58\n$0.33664\n$1.00\n$3.50\n$0.58719\n$0.999881\n$0.01554261\n$0.644606\n$0.175823\n$2,747.41\n$0.059181\n$0.999377\n$2,696.49\n$106,652.00\n$0.153643\n$654.15\n$106,704.00\n$2,699.83\n$3,424.96\n$3,402.49\n$0.838411\n$0.08746\n$107,533.00\n$0.52779\n$0.441267\n$0.601946\n$1.11\n$169.13\n$0.00007742\n$2.19\n$0.826892\n$197.05\n$2.28\n$2,779.60\n$111.45\n$0.703851\n$42.54\n$20.63\n$0.01502962\n$0.999488\n$0.00000067\n$4.04\n$0.267685\n$0.781412\n$0.169532\n$32.55\n$0.01016551\n$1.094\n$0.01305309\n$0.460307\n$0.107576\n$0.997777\n$42.03\n$106,270.00\n$0.56216\n$0.580221\n$2.17\n$0.531276\n$2,570.84\n$2,570.35\n$106,806.00\n$0.352302\n$0.998825\n$2,748.05\n$0.204234\n$0.668847\n$2,673.79\n$1.51\n$106,881.00\n$0.266537\n$2,572.71\n$8.81\n$0.997563\n$0.01450234\n$42.00\n$53.88\n$0.435525\n$1.46\n$2.44\n$0.174102\n$1.53\n$0.04428865\n$0.061115\n$0.999711\n$1.00\n$38.20\n$0.349411\n$0.00000042\n$1.09\n$0.121486\n$1.082\n$1.007\n$0.999768\n$0.514058\n$0.407814\n$5.66\n$14.06\n$0.396724\n$0.00455296\n$0.00679103\n$2,731.41\n$0.00001959\n$0.532172\n$0.075739\n$2.34\n$0.00378371\n$0.998765\n$2,566.27\n$5.75\n$0.00000094\n$0.140916\n$0.03692508\n$1.18\n$2,835.40\n$0.03683982\n$0.139089\n$0.00377804\n$0.01775428\n$1.42\n$2,810.38\n$0.843598\n$106,862.00\n$0.337504\n$0.159807\n$2,570.48\n$106,520.00\n$0.501531\n$0.00005991\n$0.782318\n$0.03284134\n$19.78\n$1.19\n$164.41\n$0.00376566\n$0.999683\n$0.99892\n$0.00000154\n$0.999267\n$0.067208\n$2,567.59\n$0.311681\n$115.12\n$0.00566351\n$19.14\n$0.200343\n$0.999704\n$0.640992\n$106,917.00\n$0.01883861\n$1.004\n$1.77\n$0.625821\n$1.017\n$0.196924\n$9.20\n$2,146.72\n$103,863.00\n$6.42\n$0.00381959\n$105,080.00\n$15.21\n$23.19",
    "url": "https://decrypt.co/325431/jp-morgan-files-trademark-for-jpmd-is-it-a-stablecoin",
    "source": {
      "name": "Decrypt"
    },
    "publishedAt": "2025-06-16T22:06:17Z"
  },
  {
    "title": "Crypto Is Now Trump's Second-Most Lucrative Source of Income",
    "content": "$106,871.00\n$2,571.88\n$2.24\n$653.65\n$151.37\n$0.999734\n$0.173716\n$0.274051\n$2,567.62\n$0.632685\n$42.17\n$106,911.00\n$3,096.78\n$2.99\n$470.52\n$13.51\n$9.26\n$0.261155\n$19.14\n$51.65\n$2.96\n$0.999821\n$0.00001193\n$2,747.72\n$2,572.63\n$86.70\n$0.1547\n$1.00\n$322.96\n$0.99954\n$3.85\n$4.53\n$106,836.00\n$7.61\n$0.00001054\n$0.580911\n$278.30\n$1.18\n$364.22\n$51.47\n$4.67\n$1.00\n$5.40\n$2.26\n$0.090485\n$32.65\n$183.09\n$16.98\n$1.055\n$0.786763\n$1.00\n$0.615216\n$0.075882\n$16.41\n$9.76\n$0.02229071\n$0.089636\n$4.44\n$4.15\n$107,028.00\n$0.297918\n$0.200422\n$0.680709\n$3.42\n$2.46\n$2,572.89\n$0.320029\n$0.999548\n$0.947486\n$4.45\n$0.175845\n$0.996729\n$103.71\n$0.999721\n$11.17\n$1.45\n$160.41\n$0.419386\n$1.23\n$2,928.06\n$0.01792205\n$1.83\n$2,692.47\n$1.70\n$1.14\n$0.00001476\n$11.58\n$0.33664\n$1.00\n$3.50\n$0.58719\n$0.999881\n$0.01554261\n$0.644606\n$0.175823\n$2,747.41\n$0.059181\n$0.999377\n$2,696.49\n$106,652.00\n$0.153643\n$654.15\n$106,704.00\n$2,699.83\n$3,424.96\n$3,402.49\n$0.838411\n$0.08746\n$107,533.00\n$0.52779\n$0.441267\n$0.601946\n$1.11\n$169.13\n$0.00007742\n$2.19\n$0.826892\n$197.05\n$2.28\n$2,779.60\n$111.45\n$0.703851\n$42.54\n$20.63\n$0.01502962\n$0.999488\n$0.00000067\n$4.04\n$0.267685\n$0.781412\n$0.169532\n$32.55\n$0.01016551\n$1.094\n$0.01305309\n$0.460307\n$0.107576\n$0.997777\n$42.03\n$106,270.00\n$0.56216\n$0.580221\n$2.17\n$0.531276\n$2,570.84\n$2,570.35\n$106,806.00\n$0.352302\n$0.998825\n$2,748.05\n$0.204234\n$0.668847\n$2,673.79\n$1.51\n$106,881.00\n$0.266537\n$2,572.71\n$8.81\n$0.997563\n$0.01450234\n$42.00\n$53.88\n$0.435525\n$1.46\n$2.44\n$0.174102\n$1.53\n$0.04428865\n$0.061115\n$0.999711\n$1.00\n$38.20\n$0.349411\n$0.00000042\n$1.09\n$0.121486\n$1.082\n$1.007\n$0.999768\n$0.514058\n$0.407814\n$5.66\n$14.06\n$0.396724\n$0.00455296\n$0.00679103\n$2,731.41\n$0.00001959\n$0.532172\n$0.075739\n$2.34\n$0.00378371\n$0.998765\n$2,566.27\n$5.75\n$0.00000094\n$0.140916\n$0.03692508\n$1.18\n$2,835.40\n$0.03683982\n$0.139089\n$0.00377804\n$0.01775428\n$1.42\n$2,810.38\n$0.843598\n$106,862.00\n$0.337504\n$0.159807\n$2,570.48\n$106,520.00\n$0.501531\n$0.00005991\n$0.782318\n$0.03284134\n$19.78\n$1.19\n$164.41\n$0.00376566\n$0.999683\n$0.99892\n$0.00000154\n$0.999267\n$0.067208\n$2,567.59\n$0.311681\n$115.12\n$0.00566351\n$19.14\n$0.200343\n$0.999704\n$0.640992\n$106,917.00\n$0.01883861\n$1.004\n$1.77\n$0.625821\n$1.017\n$0.196924\n$9.20\n$2,146.72\n$103,863.00\n$6.42\n$0.00381959\n$105,080.00\n$15.21\n$23.19",
    "url": "https://decrypt.co/325440/crypto-is-now-trumps-second-most-lucrative-source-income",
    "source": {
      "name": "Decrypt"
    },
    "publishedAt": "2025-06-16T21:46:53Z"
  },
  {
    "title": "Android 16 QPR1 Beta 2 adds new animation for the power button long-press gesture",
    "content": "Affiliate links on Android Authority may earn us a commission.Learn more.\n5 hours ago\n\nIn addition to refreshed UI elements, Android’s newMaterial 3 Expressivedesign language is set to introduce some slick new animations. Wegave you an early look at these animationslast month, and Google has now started testing the new power button long-press animation in the latest Android 16 QPR1 beta release.\nGoogle rolled out Android 16 QPR1 beta 2 last week alongside the stable Android 16 update for its Pixel devices. In addition to significant changes, such as a desktop mode, desktop windowing for tablets, custom keyboard shortcuts, and taskbar overflow, the update introduces the new squeeze animation that appears when you long-press the power button to summon the voice assistant.\nAs shown previously, it appears as a black overlay that expands inwards from the screen borders and disappears just before the assistant overlay pops up. You can see it in action in the attached video (via A_Button117 on Discord). This new animation will likely reach users with Android 16 QPR1, which is expected to arrive shortly after Google unveils the new Pixel 10 lineup.",
    "url": "https://www.androidauthority.com/android-16-qpr1-beta-2-power-button-animation-3567943/",
    "source": {
      "name": "Android Authority"
    },
    "publishedAt": "2025-06-16T21:50:26Z"
  },
  {
    "title": "Galaxy Watch 8 series never looked better in this new leak",
    "content": "Affiliate links on Android Authority may earn us a commission.Learn more.\n6 hours ago\n\nAlthough the exact date isstill up for dispute, it’s believed that Samsung will hold its next launch event in early July. Despite being only weeks away from the event, leaks aren’t showing any sign of slowing down. The Galaxy Watch 8 series is expected to be unveiled at the show, and a new leak has just given us another look at the lineup.\nCourtesy of tipsterEvan Blass, we have a few new images of the Galaxy Watch 8 to check out. While we saw similar images just last week, these pictures provide a higher-resolution, upfront look at the smartwatches.\nBased on these images, we can gather that Samsung plans to use the “squircle” design for all three models. The crown for the Classic also appears to have notches, giving it just enough of a distinction from the Ultra. Meanwhile, the Ultra (2025) features a blue colorway instead of last year’s Orange.\nThe Galaxy Watch 8 series is expected to launch alongside Samsung’s next-gen foldables next month. These devices should come with One UI 8 Watch installed, which is set to introduceseveral new features.",
    "url": "https://www.androidauthority.com/galaxy-watch-8-new-images-3567994/",
    "source": {
      "name": "Android Authority"
    },
    "publishedAt": "2025-06-16T20:53:30Z"
  },
  {
    "title": "Your WhatsApp Status view is about to get ads",
    "content": "Affiliate links on Android Authority may earn us a commission.Learn more.\n6 hours ago\n\nAds have crept into every corner of Meta’s ecosystem. Facebook, Instagram, and Reels are filled with them. For years, WhatsApp stood apart as the company’s only major platform without advertising. Now, that’s changing: ads are coming to WhatsApp, too.\nMeta revealed in a new announcement thatWhatsAppis testing ads in the Status row at the top of the Updates tab. This is the first time we’ve seen advertising in WhatsApp since Facebook acquired the popular messaging app in 2014. But don’t worry, Meta insists your private messages remain end-to-end encrypted and are still off limits for advertising. The new ad placements are limited to Status updates, not your personal chats.\nMeta confirmed three new features: ads in Status, paid channel subscriptions, and promoted channels.  WhatsApp is clearly following a familiar playbook, because it sounds a lot like what we already see in Telegram and Instagram. Ads in Status look the same as Instagram Stories. These are full-screen visuals from brands, with the option to message them directly. You’ll still be able to tap through Status posts as usual, but not before they try to sell you something.\nChannels are getting a monetization boost. Creators can now offer subscriptions, so followers pay for exclusive content. There are still no details on payment methods, but it will most likely use Meta Pay. The new Promoted Channels section will help creators get discovered by showing potential channel subscriptions of interest.\nFor now, the changes are confined to the Updates tab. But if you’re used to a completely ad-free experience with the world’s most popular messaging app, it may start feeling a little like the rest of Meta’s apps, and soon.",
    "url": "https://www.androidauthority.com/whatsapp-status-ads-3567882/",
    "source": {
      "name": "Android Authority"
    },
    "publishedAt": "2025-06-16T20:36:33Z"
  },
  {
    "title": "Pixel 10 camera leak reveals Google’s trick for better close-ups",
    "content": "Affiliate links on Android Authority may earn us a commission.Learn more.\n7 hours ago\n\nThere have been plenty of leaks regarding the Pixel 10 series, especially when it comes to the camera situation.Android Authoritypreviously revealed thecamera specsfor the entire series. But new information is still coming out, like Google possibly giving the device tele-macro capabilities.\nAccording to a report fromAndroid Headlines, thePixel 10 serieswill gain telemacro functionality. This is a feature that allows the phone to use the telephoto lens for macro photography instead of the ultrawide. It’s something that has been gaining traction recently, with appearances in the OPPO Find N5 and the OnePlus 13.\nAlthough the Pixel 10 series may use the telephoto sensor for macro photography, Google may not remove macro functionality from the ultrawide sensor. The outlet explains that the reason for this is that the telephoto’s minimum focusing distance is further than the ultrawide’s. As a result, how far away you are from your subject will determine which lens is used.\nThe Pixel 10 series is expected to launch near the end of August. An earlier leak suggested an August 13 release, but was later changed to August 20 after citing a delay. The phones are expected to ship on August 28.",
    "url": "https://www.androidauthority.com/pixel-10-tele-macro-3567952/",
    "source": {
      "name": "Android Authority"
    },
    "publishedAt": "2025-06-16T19:57:43Z"
  },
  {
    "title": "Samsung Galaxy S25 Edge truly discounted for the first time",
    "content": "Affiliate links on Android Authority may earn us a commission.Learn more.\n7 hours ago\nWe’ve seen some Samsung Galaxy S25 Edge deals already, but there haven’t been any actual discounts until today. Instead, you would get a storage upgrade or a free gift card. This is the first time we’ve seen the Samsung Galaxy S25 Edge price reduced, and you can take it home at a $44 discount.\nBuy the Samsung Galaxy S25 Edge for $1055.99 ($44 off)\nThis offer is available from Amazon. Just know that the discount only applies to the Titanium Jetblack and Titanium Silver color versions.\nIt’s nice to see the Samsung Galaxy S25 Edge getting a few sales so soon after its launch. It was only released in late May, which was about a couple of weeks ago.\nThe Samsung Galaxy S25 Edge is mainly known for its super-thin design. It measures a mere 5.8mm in thickness! That is not the only thing the Samsung Galaxy S25 Edge has going for itself, though. This is a high-end, capable smartphone. In fact, we often compare it to theSamsung Galaxy S25 Plusin many other departments. They look very similar, are very close in size (except for the thinness, of course).\nThe Galaxy S25 Edge is actually better in some ways, though. It has a titanium frame, putting it closer to theSamsung Galaxy S25 Ultrain terms of build. It also has a Gorilla Glass Ceramic 2 front and a Gorilla Glass Victus 2 back. And you still get anIP68 ratingfor water and dust resistance.\nThe performance is up there with the best, as this phone features aQualcomm Snapdragon 8 Elitechipset and 12GB of RAM. To summarize, it can handle any app you throw at it. A good premium handset will always have a great screen, and this one does too. It has a large 6.7-inch LTPO AMOLED 2X panel with a QHD+ resolution and a smooth 120Hz refresh rate.\nOf course, the phone has its downsides. Any phone this thin has to make sacrifices somewhere, and such is the case here. The obvious one is the battery, which is pretty small at 3,900mAh. We also wish the cameras were better.\nAll things considered, the Samsung Galaxy S25 Edge is a very interesting phone with a super slim body, great performance, top-of-the-line specs, and an overall amazing experience. This is its first actual discount, so go catch it before it goes away!",
    "url": "https://www.androidauthority.com/samsung-galaxy-s25-edge-deal-3-3567964/",
    "source": {
      "name": "Android Authority"
    },
    "publishedAt": "2025-06-16T19:21:16Z"
  },
  {
    "title": "Instagram’s New Features: Spotify Integration To Notes And Customizable Grid",
    "content": "Instagramhas introducedSpotify music integration into Notes, allowing users to share the songs they’re currently listening to in real time. Announced on Thursday (June 12), this update enhances the temporary status feature located in the Stories section by syncing directly with Spotify, updating as the music changes. This integration builds upon last year’s “Add to Spotify” button and provides a more dynamic, real-time connection between the two platforms.\nThe update echoes nostalgic features from older messaging platforms like MSN, where users could display what they were listening to. Until now, music could only be added manually to Notes; the new feature automates the process, improving the experience and making it more expressive. Instagram explained that this change is part of its broader“Anyway” campaign, which aims to reduce pressure on users andencourage creativity and spontaneous sharing.\nUsers will be able to tap the green bubble above profile icons in Notes to view the full song title and artist name. (Image: Meta)\nAnother key feature coming soon is theability to manually rearrange posts on a user’s profile grid. Starting next week, users will be able to reposition content in any order, moving beyond the current reverse-chronological layout. This feature grants more control over how one’s profile is presented, especially beneficial for creators and brands.\nThe customizable grids will be very welcomed by many Instagram users (Image: Meta)\nAdditionally, Instagram is expanding access to areels testing featurethat lets creators preview how their videos perform with new audiences before sharing them publicly. Previously limited in availability, this tool reportedly led to a 40% increase in posting frequency among early adopters, according to the platform.\nThese changes align with Instagram’s ongoing effort to support users inmanaging the pressure and anxiety of posting online, which the “Anyway” campaign directly addresses. While more features aimed at easing this experience are in development, further details will be revealed in the future.\nFinally, Meta confirmed that anative Instagram app for iPad is in development—a long-requested addition, especially given that Android tablets already have dedicated support. This move could enhance the user experience for Apple tablet users and is part of broader efforts to modernize the platform across devices.\nFiled inCellphones. Read more aboutInstagram,Meta,Social Media,SpotifyandUpdate.",
    "url": "https://www.ubergizmo.com/2025/06/instagram-spotify-notes-grid/",
    "source": {
      "name": "Ubergizmo"
    },
    "publishedAt": "2025-06-15T18:00:44Z"
  },
  {
    "title": "iPhone 17 Pro: Apple A19 Pro Chip Could Match M4’s Performance",
    "content": "A new leak suggests that theApple A19 Pro, the upcoming chip expected to power theiPhone 17 Pro, could deliver a significant leap in performance—especially insingle-core processing. The leak, shared by reputable sourceDigital Chat Station, indicates that the chip may reach performance levels comparable to Apple’sM4 processor, which currently powers the newestiPad Proand severalMacs.\nAccording to early benchmarks usingGeekbench 6, theA19 Procould score over4,000 points in single-core performance. That would represent an18% improvementover the currentA18 Pro, which averages about3,400 points. More impressively, the A19 Pro maysurpass the M4’s single-core performance, which is typically around3,600 points, and even approach theM4 Max, Apple’s most powerful chip to date.\nIn terms ofmulti-core performance, the A19 Pro is expected to score more than10,000 points, a notable jump from the A18 Pro’s average of8,500 points. This would again be an18% increase, reinforcing the trend of mobile processors closing the gap with desktop-class chips.\nHowever, despite these improvements, theA19 Pro may still face tough competition. High-end Android chipsets likeSnapdragon 8 Elite Gen 2andMediaTek Dimensity 9500are also due to arrive with architectural improvements that could challenge or even surpass Apple’s offering in some areas—particularly inmulti-core tasks.\nAnother notable detail in the leak is thatevery model in the iPhone 17 lineup will feature high refresh rate displays, a feature previously limited to Pro models. This shift would make base models more competitive and appealing, especially for users focused on smooth visuals and gaming.\nWhile the exact specifications remain unconfirmed, and benchmark scores are still speculative, the information suggests thatApple is pushing for major gains in both performance and efficiencywith the A19 Pro. The move also reflects the broader industry trend ofsmartphones becoming more capable replacements for lightweight computing tasks.\nMore reliable performance benchmarks and details about the A19 Pro chip and theiPhone 17 seriesare expected to surface closer to launch, likely inSeptember 2025, if Apple follows its usual release schedule. Until then, this rumor paints a picture of a powerful and competitive year for mobile silicon.\nFiled inApple>Rumors. Read more aboutApple.",
    "url": "https://www.ubergizmo.com/2025/06/iphone-17-pro-apple-a19-pro-m4/",
    "source": {
      "name": "Ubergizmo"
    },
    "publishedAt": "2025-06-14T18:00:51Z"
  },
  {
    "title": "RedMagic Gaming Tablet 3 Pro Debuts With Snapdragon 8 Elite And 165 Hz OLED Display",
    "content": "RedMagic has officially launched theGaming Tablet 3 Pro, a high-performance compact gaming tablet designed to rival the recently launchedLenovo Legion Y700 Gen 4. Confirmed for a global release under the nameRedMagic Astra Gaming Tablet, it combines flagship-level specs with a gamer-focused design and efficient thermal management.\nThe device features a9.06-inchOLEDdisplaywith a2.4K resolution,165 Hz refresh rate,1,600 nits brightness, and ultra-thin4.9 mm bezels. It adopts a16:10 aspect ratioand includes5,280 Hz PWM dimmingfor eye comfort and2,000 Hz touch sampling, enhanced by a dedicated chip for faster input response.\nUnder the hood, it’s powered by theSnapdragon 8 Elite processor, paired with theproprietary RedCore R3 Pro chip, which boosts performance and system responsiveness. RedMagic claims the device scoresover 3.34 million points on AnTuTu. RAM options include12 GB, 16 GB, or 24 GBofLPDDR5T memory at 9600 MT/s, while storage goes up to1 TB of UFS 4.1 Pro.\nTheactive cooling systemincludes a built-in fan and liquid metal solution for rapid heat dissipation—crucial for sustained gaming sessions. While camera specs are modest, with a9 MP frontand13 MP rear camera, the tablet compensates with an8,200mAhbatterysupporting80W fast charging, reaching 50% in just 20 minutes.\nConnectivity includesWi-Fi,Bluetooth,NFC, and aUSB-C 3.2 Gen 2 portwith data speeds up to 10 Gbps. It also offersstereo speakers, aside-mountedfingerprint reader, and runsAndroid 15with RedMagic OS 10.5, which features an AI assistant and gamer-focused UI enhancements.\nEvery one discussing about oneplus pad3  and it's price ,But here some thing big in small and most beautiful tab in the world 😍Redmagic tab 3 pro9inch amoled 165 hzs8elite8200mah ,80wt charging brickPrice soon ,pic.twitter.com/Vl9yFMbi3G\n— ( పీక పీకా) తెలుగు🚩 (@chowspresident)June 6, 2025\n\nRedMagic also revealed a range of gaming accessories:\nIceBlade Magnetic Keyboard(aluminum body, 8,000 Hz polling rate, 0.1 ms latency):~US$ 145\nCooling fansfor phones: from~US$ 50\nLow-latency earbuds:~US$ 60\nGaming controllers(clip-on or standard, with Hall effect sticks and gyroscope):~US$ 60–92\nAdditionally, the company teased agaming laptopfeaturing anIntel Core Ultra 9 HX processorandNVIDIA GeForce RTX 5090, with more details expected soon.\nThe global release is scheduled forJuly 1st.\n12 GB + 256 GB:~US$ 570\n16 GB + 512 GB:~US$ 670\n24 GB + 1 TB:~US$ 850\nFiled inGaming>Tablets. Read more aboutQualcomm Snapdragon 8 Elite.",
    "url": "https://www.ubergizmo.com/2025/06/redmagic-gaming-tablet-3-pro/",
    "source": {
      "name": "Ubergizmo"
    },
    "publishedAt": "2025-06-13T18:00:13Z"
  },
  {
    "title": "Huawei Launches Pura 80 Series With 1-Inch Sensor And Movable Telephoto Lens",
    "content": "Huawei has officially launched its flagshipPura 80 series, which includes thePura 80,Pura 80 Pro,Pura 80 Pro+, and the premium-tierPura 80 Ultra. Building on the Pura 70 lineup, the new models introduce enhanced performance, upgraded camera systems, and improved durability. All devices share a metal-glass construction, IP69 certification, and second-generation Kunlun Glass protection.\nThe highlight of the series is thePura 80 Ultra, which debuts with a50 MP 1-inch RYYB main sensor, offering a wide dynamic range of up to 16 EV, opticalimage stabilization(OIS), and amovable periscope telephoto lenscapable of 3.7x to9.4x optical zoom. The periscope lens uses a50 MP sensorthat shifts to12.5 MPat maximum zoom to retain quality. The camera system also includes a40 MP ultrawide lens, a13 MP ultrawide front camera, and amultispectral sensorto enhance color capture.\nThe Pura 80 Ultra features a6.8-inchOLEDdisplaywith 2848 x 1276 resolution, avariable refresh rate from 1 to 120 Hz, and brightness up to3,000 nits. It supports stereo sound and runsHarmonyOS 5.1. Under the hood, it has16 GB RAM,512 GB or 1 TB storage, and is believed to be powered by theKirin 9020 chip, offering a 36% performance boost over the Pura 70 Ultra.\nIts5,700mAhbatterysupports100W wired,80W wireless, and20W reverse wireless charging. Connectivity includes5G,Wi-Fi 7,Bluetooth 5.2,NFC,satellite communication, and aside-mountedfingerprint scanner.\nPura 80: 6.6-inch display, 50 MP main camera (variable aperture), 12 MP periscope (5.5x), 13 MP ultrawide.\nPura 80 Pro / Pro+: 6.8-inch displays, 50 MP 1-inch sensor, 48 MP telephoto (4x zoom), 40 MP ultrawide, multispectral sensor.\nAll models supportsatellite messaging(dual in Pro Plus),Wi-Fi 7,Bluetooth 5.2, and66W to 100W chargingdepending on the variant.\nHuawei Pura 80 is a clear evolution from the Pura 70.\nHuawei Pura 80 Ultra\n16 GB + 512 GB:~US$ 1,880\n16 GB + 1 TB:~US$ 2,150\nHuawei Pura 80 Pro\n12 GB + 256 GB:~US$ 940\n12 GB + 512 GB:~US$ 1,012\n12 GB + 1 TB:~US$ 1,157\nHuawei Pura 80 Pro Plus\n16 GB + 512 GB:~US$ 1,157\n16 GB + 1 TB:~US$ 1,301\nCurrently, thePura 80base model is not yet available in China. ThePura 80 Ultrabegins shipping June 26,with global availability details yet to be announced.\nFiled inCellphones. Read more aboutharmonyOSandHuawei.",
    "url": "https://www.ubergizmo.com/2025/06/huawei-pura-80-series/",
    "source": {
      "name": "Ubergizmo"
    },
    "publishedAt": "2025-06-12T18:00:14Z"
  },
  {
    "title": "Android 16: Final Version Now Available For Pixel Devices",
    "content": "On June 10, Googleofficially rolledout thestable version of Android 16for itsPixel smartphones, following six months of testing. The latest Android release introduces notablevisual upgrades, enhancedaccessibility features, and improvements focused onuser convenience,security, andmulti-device functionality.\nAndroid 16 debuts theMaterial 3 Expressivedesign language, offering a more dynamic and personalized user interface across supported apps and system elements. One of the major usability improvements involveslive updates in notificationsfor ride-sharing and food delivery apps. These allow users to monitor real-time information, such as a driver’s route or order status, directly from the notification panel—eliminating the need to open the app repeatedly.\nThe system also introducesautomatic grouping of notificationsfrom the same app, reducing clutter in the notification shade and making important alerts easier to manage. Google is collaborating with partners likeSamsung(via Now Bar),OPPO, andOnePlusto bring these notification improvements to more devices.AAnA\nAndroid 16 includes key enhancements for users withhearing aids. ThroughBluetooth LE Audio, users can now make voice calls using their hearing aids, significantly improving call clarity in noisy environments. Additionally, Android 16 enablesnative volume controlof hearing aids directly from the smartphone, offering greater convenience and better integration.\nOn the security front, Android 16 introducesAdvanced Protection, Google’s most robust mobile security system to date. This feature suite guards against a wide range of digital threats, includingcyberattacks,malicious apps,unsafe websites, andfraudulent calls. The protection is integrated with core Google apps such asChrome,Messages, andPhone, and can also be extended tothird-party appsthat choose to participate.\nIn partnership withSamsung, Google is also launching adesktop modefor tablets running Android 16, drawing inspiration fromSamsung DeX. This mode allows users to open apps in resizable windows, use split-screen functionality, and interact with the interface more like a PC. The goal is to enhance productivity on large-screen devices.\nUsers can open multiple windows, freely move them across the screen, and adjust their size as needed. Additional features, includingcustom keyboard shortcuts,external monitor support, anddesktop UI refinements, are expected to roll out later in the year. Android 16 isnow available forPixel devices, with broader availability for other manufacturers scheduled for2025. The following models are compatible with the update:\nFiled inCellphones>Tablets. Read more aboutAndroid 16,Google,Google PixelandMaterial Design.",
    "url": "https://www.ubergizmo.com/2025/06/android-16-final-version/",
    "source": {
      "name": "Ubergizmo"
    },
    "publishedAt": "2025-06-11T18:00:01Z"
  }
]