[
  {
    "title": "A comprehensive list of 2025 tech layoffs",
    "content": "Latest\nAI\nAmazon\nApps\nBiotech & Health\nClimate\nCloud Computing\nCommerce\nCrypto\nEnterprise\nEVs\nFintech\nFundraising\nGadgets\nGaming\nGoogle\nGovernment & Policy\nHardware\nInstagram\nLayoffs\nMedia & Entertainment\nMeta\nMicrosoft\nPrivacy\nRobotics\nSecurity\nSocial\nSpace\nStartups\nTikTok\nTransportation\nVenture\nEvents\nStartup Battlefield\nStrictlyVC\nNewsletters\nPodcasts\nVideos\nPartner Content\nTechCrunch Brand Studio\nCrunchboard\nContact Us\nThe tech layoff wave is still kicking in 2025. Last year sawmore than 150,000 job cutsacross 549 companies, according to independent layoffs trackerLayoffs.fyi. So far this year, more than 22,000 workers have been the victim of reductions across the tech industry, with a staggering 16,084 cuts taking place in February alone.\nWe’re tracking layoffs in the tech industry in 2025 so you can see the trajectory of the cutbacks and understand the impact on innovation across all types of companies. As businesses continue to embrace AI and automation, this tracker serves as a reminder of the human impact of layoffs — and what could be at stake with increased innovation.\nBelow you’ll find a comprehensive list of all the known tech layoffs that have occurred in 2025, which will be updated regularly. If you have a tip on a layoff, contact ushere. If you prefer to remain anonymous, you can contact ushere.\n\nAnnounced thatit is letting go of around 90 employees, with 40 in Israel and 50 in Poland. The most recent round of job cuts comes after the Israel-based gaming company laid off 50 employees a few weeks ago.\nHas let go of around25 employees from the 58-person team, the company confirmed to TechCrunch. Evernote’s founder Phil Libin launched the video startup in 2020, offeringAirtime CreatorandAirtime Camera.\nIs laying offmore employees, just a few weeks after announcing a job cut of over 6,500 in May,which was around 3% of its global workforce. The most recent layoffs affected software engineers, product managers, technical program managers, marketers, and legal counsels.\nPlans to downsize its workforce byletting go of 68 employees, approximately 4% of its total staff, per Reuters. The San Francisco telehealth platform said that its layoffs were unrelated to a U.S. ban on producing large quantities of the weight-loss drug Wegovy. The startup said it intends to keep on recruiting employees who fit in with its long-term expansion plans.\nIs reportedlylaying off around 100 employees from its devices and services division, including those working on the Alexa voice assistant, Echo smart speakers, Ring video doorbells, and Zoox robotaxis. The company has reduced its workforce by approximately 27,000 since the start of 2022 to cut costs.\nWill cut over 6,500 jobs, affecting 3% of its worldwide workforce. As of June, the Seattle-headquartered company had a total of 228,000 employees globally. It would be one of the company’s biggest layoffs since it cut 10,000 employees in 2023.\nReportedly plans to let go of 248 employees, or about 22% of its workforce, to reduce expenses and improve efficiency, it said. The San Francisco-based edtech startup, which offers textbook rentals and tutoring services, has seen a drop in web traffic for months as students opt for AI tools instead of traditional edtech platforms.\nIsreducing its workforce by 13%as part of a reorganization that aims to reduce costs, shore up margins, and streamline its organizational structure.\nIslaying off 5% of its global workforce, or around 500 people. The company said the layoffs were part of “a strategic plan (the ‘Plan’) to evolve its operations to yield greater efficiencies as the Company continues to scale its business with focus and discipline to meet its goal of $10 billion in ending [Annual Recurring Revenue]” in its 8-K filing.\nHascut roughly 25% of its current workforce. The Vancouver-based company, which is developing a technology to generate fusion energy, has raised $440 million from investors, including Jeff Bezos, Temasek, and BDC Capital.\nReduced its headcount by 20 employees,accounting for 10% of its total workforce. In April 2023, the Israeli cybersecurity startup had previously laid off a similar number of employees during a round of layoffs.\nHasshut down its operationsmonths after announcing major expansion plans, per Sifted. The British climate startup has let go of approximately 200 employees, according toa LinkedIn post by James Reynolds, the head of talent.\nIsreportedlyeliminating 700 jobs, affecting 6% of its total workforce, as it reorganizes for its operational efficiency. The company, based in San Francisco, provides data storage, cloud services, and CloudOps solutions for businesses.\nIs reportedly letting go of approximately 300 to 400 employees, including around 100 at Respawn Entertainment, to focus on its “long-term strategic priorities,” according toBloomberg.\nIslaying off around 3%of its employees as part of its restructuring. The job cuts will mainly affect midlevel positions in the product and technology teams. The latest round of layoffs comes after the company let go of hundreds of employees from its marketing team globally in early March.\nHas reduced its workforce by about 200 employeesin its product and technology divisions as part of a restructuring measure. The India-based e-commerce platform for pre-owned vehicles provides a range of services like buying and selling pre-owned cars, financing, insurance, driver-on-demand, and more. In 2023, the SoftBank-backed startup raised $450 million at a valuation of $3.3 billion.\nIs letting go of over 100 employees in its Reality Labs division, which manages virtual reality and wearable technology,according to The Verge.The job cuts affect employees developing VR experiences for Meta’s Quest headsets and staff working on hardware operations to streamline similar work between the two teams.\nAnnounced itsplan to lay off more than 21,000 employees, or roughly 20% of its workforce, in April. The move comes ahead of Intel’s Q1 earnings call helmed byrecently appointed CEO Lip-Bu Tan, who took over from longtime chief Pat Gelsinger last year.\nIs laying off 200 people at its Factory Zero in Detroit and Hamtramck facility in Michigan, which produces GM’s electric vehicles. The cuts come amid the EV slowdown and is not caused by tariffs, according toa report.\nHasreportedlylet go of around 100 employees since the start of 2025. Earlier this week, about 50 employees from the tech and product teams were let go in the latest round of job cuts. The India-based insurtech startup has raised a total of $125 million to date.\nWill reduce its workforce by 150 positions following its decision not to proceed with its IPO,per Bloomberg. The San Francisco-based car rental startup, which had about 1,000 staff in 2024, said the layoffs will bolster its long-term growth plans during economic uncertainty.\nLaid off roughly 200 employeesto improve efficiency and profitability. It’s the startup’s second round of layoffs in five months, following the job cuts of around 300 employees in December. The conversational AI company, backed by Tiger Global and Fidelity, was last valued at $1.4 billion in 2021. The startup is based in San Francisco and operates in India.\nHasreportedlyeliminated 200 jobs, affecting around one-third of its employees. The German logistics startup reduced a significant number of sales staff.\nWill stop its operations in China, affecting around 2,000 employees. The move came after Microsoft decided to end outsourcing after-sales support to Wicresoft amid increasing trade tensions. Wicresoft, Microsoft’s first joint venture in China, was founded in 2022 and operates in the U.S., Europe, and Japan. It has over 10,000 employees.\nPlans to cut 123 jobs,affecting about 4% of its workforce, according to a report by MarketWatch. The software company prioritizes key strategic areas like artificial intelligence for profitable growth.\nHaslaid off hundreds of employeesin its platforms and devices division, which covers Android, Pixel phones, the Chrome browser, and more, according to The Information.\nIscontemplatingadditional layoffs that could happen by May, Business Insider reported, citing anonymous sources. The company is said to be discussing reducing the number of middle managers and non-coders in a bid to increase the ratio of programmers to product managers.\nThe WordPress.com developeris laying off 16% of its workforce across departments. Before the layoffs, the company’s website showed it had 1,744 employees, so more than 270 staff may have been laid off.\nHas let go of10 to 12 technical writersapproximately nine months after telling its employees to use generative AI tools wherever possible. The company, which had around 5,500 staff in 2024, wasvalued at $26 billionafter a secondary stock sale in 2024.\nHaslaid off 2,800 employees, affecting 62% of its total staff. The layoffs come weeks after the embattled Swedish battery maker filed for bankruptcy.\nLet go of 931 employees, around 8% of its workforce, as part of a reorganization,according to an internal email seen by TechCrunch. Jack Dorsey, the co-founder and CEO of the fintech company, wrote in the email that the layoffs were not for financial reasons or to replace workers with AI.\nHas laid off 198 employees, who make up about two-thirds of its U.S. workforce, pera media report. The layoff comes a month after the company was acquired by Bending Spoons, an Italian app developer, for $233 million. Brightcove had 600 employees worldwide, with 300 in the U.S., as of December 2023.\nHasreportedlylaid off 130 employees, or 3.5% of its total workforce of 3,700 people. Acxiom is owned by IPG, and the news comes just a day after IPG and Omnicom Group shareholders approved the companies’ potential merger.\nPlans to close its office in Washington, D.C., and let go of its policy team there by the end of March,TechCrunch has confirmed. Sequoia opened its Washington office five years ago to deepen its relationship with policymakers. Three full-time employees are expected to be affected, per Forbes.\nAnnouncedplans to let go of approximately 5,600 jobs globallyin its automation and electric-vehicle charging businesses as part of efforts to improve competitiveness.\nIsreportedly laying off 273 employees, closing its distribution center in Grand Prairie, Texas, and consolidating to another site in Irving to manage the volume in the region.\nHascut 45 employees, more than half of its workforce, after being acquired by cybersecurity companyArmis for $120 million in March.\nWill reportedly reduce 22 employees,representing 7% of its workforce. Most of those affected are based in Israel as the company undergoes a streamlining process. The New York- and Tel Aviv-headquartered cybersecurity firmhas raised $100 million at a valuation of about $500 millionin 2021.\nWill cut 22 jobs, affecting nearlya quarter of its total workforce,following the announcement of the AI startup’s strategicpartnership with Microsoft.\nAnnounced it will beshutting down several of its officesin accordance with Elon Musk’s DOGE, including its Office of Technology, Policy, and Strategy and the DEI branch in the Office of Diversity and Equal Opportunity.\nHas reportedly laid off some staff, according toLinkedIn posts from ex-employees.The company has not confirmed the layoffs, and it is currently unknown how many workers were affected.\nAnnounced plans tolet go of 340 employeesin its technology division as part of a new restructuring effort.\nWill cut2,500 employees,or 5% of its total staff, in response to its shares sliding 19% in the first fiscal quarter.\nWill cutup to 300 workers in Dublin,accounting for roughly 10% of the company’s workforce in Ireland.\nAnnounced it willlay off 65 employees,affecting 5% of its total workforce.\nIs reportedly set to lay offover 1,000 employees and contractorsin a cost-cutting effort. It’s the second round of cuts for the company in just five months.\nReduced itstotal headcount by 16%as the gaming startup shifts its focus to be “scrappier” and “more efficient.”\nWasshut downjust three years after it was acquired by Flipkart. It is currently unknown how many employees were affected.\nWill cutup to 2,000 jobsas part of its “Future Now” restructuring plan that hopes to save the company $300 million before the end of its fiscal year.\nAnnounced500 job cutsafter it wassold to Wonder Group for $650 million.The number of cuts affected more than 20% of its previous workforce.\nAnnounced plansto lay off 1,350 employees,affecting 9% of its total workforce, in an attempt to reshape its GTM model. The company is alsomaking reductions in its facilities,though it does not plan to close any offices.\nIs planning to cut employees in itsPeople Operations and cloud organizations teamsin a new reorganization effort. The company is offering a voluntary exit program to U.S.-based People Operations employees.\nReduced its headcountby 25 employees,accounting for 16% of its total workforce. The company is planning to release a commercial version of its proteome analysis platform in 2026.\nWill reportedlycut a few dozen employees in Israel,potentially affecting 10% of its 250-person workforce in the country.\nCut1,100 jobs in a reorganizing effortthat affected its tech workers. The coffee chain will now outsource some tech work to third-party employees.\nLaid offdozens of employeesover the last few weeks, including around 10% of staff in one day, after failing to meet its sales growth targets. The “headless commerce” platformraised money at a $1.9 billion valuationjust a few years ago.\nWill cutroughly 5% of its current workforcein a new efficiency drive to increase profitability and growth.\nLaid off more employeesin a new effort to cut costs, though the total number is unknown. Last year, the travel giantcut about 1,500 rolesin its Product & Technology division.\nHasceased operationsand has laid off its employees after selling its business and technology to Israeli cybersecurity company Tufin. The cuts affect roughly 300 people.\nIsshutting down its operationsamid “ongoing challenges in healthcare.” It’s unclear the number of employees affected. In 2023, the women’s healthcare startupraised $18 millionto fund its expansion.\nCut51 jobs in its San Francisco headquarters,according to state filings with the Employment Development Department. The SaaS startup previously reduced its headcount by 8% in 2023.\nHascut 120 employees,affecting 44% of its total staff. It’s the Y Combinator-backed Nigerian startup’s second layoff round in just five months.\nReportedlylaid off dozens of employeesas part of a new cost-cutting effort that aims to ensure “long-term success” in the startup’s mission to curb misinformation online.\nWill lay off about 10% of its workforce, affectingmore than 1,000 employees.According to an email to staff obtained by CNN, the cuts will largely have an impact on positions in engineering and program management.\nAnnounced in an SEC filing that it willcut around 450 positionsbetween February and July 2025, with a complete restructuring set to be completed in the fall, following its new partnership with Zillow.\nIs laying off6% of its total workforce,the cybersecurity firm confirmed to TechCrunch. The cuts come less than two weeks after Sophos acquired Secureworks for $859 million.\nWill cutnearly 200 employeesas it introduces redundancy measures and closes down its operations in Poland and Kenya.\nReportedlyconducted another round of layoffs.It’s unknown how many employees were affected.\nCut nearly 200 employees, CEO Mike Seckler announcedin a note to employees, citing “potential adverse events” like a recession or rising interest rates.\nCut 120 jobs, affecting roughlyone-third of its total workforce,TechCrunch exclusively learned. The move comes just a year after the Dutch startupcut 90 employeesfollowing its rebrand.\nLaid offabout 500 employees,affecting 15% of its workforce, citing poor business performance. The new cuts follow twoearlierlayoff roundsfor the company that affected roughly 200 employees.\nReportedly let go ofapproximately 200 employees,according to The Verge. The company previouslycut 100 employeesas part of a layoff round in August 2024.\nLaid off1,750 employees,as originally reported by Bloomberg and confirmed independently by TechCrunch. The cuts affect roughly 8.5% of the enterprise HR platform’s total headcount.\nLaid off 180 employees,the company confirmed to TechCrunch.The cuts come just over one year after the access and identity management giantlet go of 400 workers.\nIs laying off50% of its workforce, including CEO Marc Whitten and several other top executives, as it prepares to shut down operations. What remains of the autonomous vehicle company will move under General Motors.\nIs reportedly eliminatingmore than 1,000 jobs.The cuts come as the giant is actively recruiting and hiring workers to sell new AI products.\nHas shut down operations, CEO Paul Kesserwaniannounced on LinkedIn.The fintech startup’s post-money valuationin 2022 was $82.4 million,according to PitchBook.\nLaid off150 employees based in the U.S., affecting roughly 18% of its total workforce, in an effort to reach profitability.\nLaid offdozens of workers in its communications departmentin order to help the company “move faster, increase ownership, strengthen our culture, and bring teams closer to customers.”\nIslaying off 300 people,according to a leaked memo reported by Business Insider. However, according to the memo, the fintech giant is planning to grow its total headcount by 17%.\nLaid off15 employeesas the augmented writing startup undergoes a restructuring effort.\nIscutting 75 employeesin an effort to “ensure the long-term sustainability and success” of the company. The audio company last cut 200 writers in July 2024 months afterpartnering with ElevenLabs.\nIs planning tocut 58 employeesin response to an “ongoing macroeconomic challenges and continued uncertainty in the solar industry.”\nAnnounced in an internal memo that it willcut 5% of its stafftargeting “low performers” as the company prepares for “an intense year.”As of its latest quarterly report,Meta currently has more than 72,000 employees.\nWill cut up to 730 jobs,affecting 3% of its total workforce,as it plans to exit operations in Germany and focus on physical retailers.\nIs shutting down its operations,affecting 63 employees.The delivery startup said employees will be paid through January 15 without severance.\nIslaying off 114 employeesas part of a team realignment, per a new WARN notice filing, focusing its efforts on a robotic printing system.\nEliminated 37 jobs, affecting roughly 10% of its total workforce, even as the companypursues “aggressive” hiring.\nIs cuttingdozens of employeesacross its global markets as part of a strategic reorganization to increase profitability.\nPlans to lay off400 employees globally.It’s the company’s fourth layoff roundsince January 2024as the solar industry as a whole faces a downturn.\nThe fintech startup, founded in 2018,abruptly shut down earlier this year.Per an email from CEO Paul Aaron, the closure follows anunsuccessful attempt to find a buyer, thoughEmployer.com has a new offer under considerationto acquire the company post-shutdown.\nThis list updates regularly.\nOn April 24, 2025, we corrected the number of layoffs that happened in March.\nTopics\nAudience Development Manager\nAlyssa Stringer was formerly the Audience Development Manager for TechCrunch. She previously worked for HW Media as Audience Development Manager across HousingWire, RealTrends and FinLedger media brands. Prior to her experience in audience development, Alyssa worked as a content writer and holds a Bachelor’s in Journalism at the University of North Texas.\nReporter, Asia\nKate Park is a reporter at TechCrunch, with a focus on technology, startups and venture capital in Asia. She previously was a financial journalist at Mergermarket covering M&A, private equity and venture capital.\nFrom seed to Series C and beyond—founders and VCs of all stages are heading to Boston. Be part of the conversation. Save $200+ now and tap into powerful takeaways, peer insights, and game-changing connections.\nGoogle reportedly plans to cut ties with Scale AI\nNew details emerge on Meta’s $14.3B deal for Scale\n11 startups from YC Demo Day that investors are talking about\nGoogle Cloud outage brings down a lot of the internet\nWaymo rides cost more than Uber or Lyft — and people are paying anyway\nEurope, we’re not leaving. Period.\nOpenAI releases o3-pro, a souped-up version of its o3 AI reasoning model\n© 2025 TechCrunch Media LLC.",
    "url": "https://techcrunch.com/2025/06/16/tech-layoffs-2025-list/",
    "source": {
      "name": "TechCrunch"
    },
    "publishedAt": "2025-06-16T13:48:36Z"
  },
  {
    "title": "Toyota’s China joint venture partners with Huawei and Xiaomi in EV push",
    "content": "GAC Toyota, a joint venture between Toyota and its Chinese partner GAC, announced that it has collaborated with Huawei and Xiaomi to integrate their technologies into its upcoming electric vehicle models. This initiative aims to meet the expectations of Chinese customers by offering more localized products. According to a statement published on Thursday, Toyota’s Bozhi 7 will be the first Chinese-manufactured model from a global automaker to feature Huawei’s HarmonyOS—Huawei’s alternative to Google’s Android operating system—as well as access to Xiaomi’s hardware ecosystem. Xiaomi owners will be able to seamlessly use the company’s electronic devices, from tablets to car stereos, in Toyota’s Chinese models, the companies said. The five-meter-long electric sedan will also be powered by Huawei’s Drive One electric motor and equipped with its digital key, which pairs with Huawei smartphones. [TechNode reporting,GAC Toyota announcement, in Chinese]\n",
    "url": "https://technode.com/2025/06/13/toyotas-china-joint-venture-partners-with-huawei-and-xiaomi-in-ev-push/",
    "source": {
      "name": "TechNode (動點科技)"
    },
    "publishedAt": "2025-06-13T09:04:36Z"
  },
  {
    "title": "Huawei Pura 80 to debut dual focal-length periscope lens, explores continuous optical zoom",
    "content": "Huawei will launch its Pura 80 series smartphones this Wednesday, featuring a new dual focal-length periscope lens. The innovative design uses a folded optical structure and moving parts to switch between two distinct optical focal lengths. According to tech blogger Digital Chat Station, the switch between focal lengths is not seamless, as software is used to bridge the gap. Huawei is also testing true continuous optical zoom, which is not yet ready. Compared with traditional zoom systems, continuous optical zoom offers more consistent image quality, color accuracy and white balance, as it uses a single lens system for all magnifications. Major Chinese brands such as Oppo and Vivo are also exploring this next-generation zoom technology. [My Drivers, in Chinese]",
    "url": "https://technode.com/2025/06/09/huawei-pura-80-to-debut-dual-focal-length-periscope-lens-explores-continuous-optical-zoom/",
    "source": {
      "name": "TechNode (動點科技)"
    },
    "publishedAt": "2025-06-09T08:53:34Z"
  },
  {
    "title": "Opinion: Space startups are pivoting to defence. That’s great for innovation",
    "content": "Afew months ago, atthe SmallSat Symposium, a panel issued a sobering warning to space startups: do not chase defence dollars at the expense of long-term sustainability. Why? Because companies, particularly in the space sector, might be tempted to follow the money rather than focus on producing valuable products and services with broader, longer-term applications. It’s of course true thatanycompany should be wary of “leaning in” too closely to what seem like passing fads. But the warning overlooks an important reality: the shift towards defence investing is not a trend. It’s a transformation in space and space investment, and one that will have positive — albeit unintended — consequences.\nAcross the space sector, there has been a noticeable shift towards focusing on pure defence investing. Companies that once prioritised commercial applications, or at most maintained dual-use business models, are now making full-scale pivots to defence. Needless to say, that move isn’t random. It’s the product of geopolitical changes, such as the ongoing conflict in Ukraine, and a widespread belief that the world is changing. As Michael Gove, who served in the Cabinets of four British prime ministers,put it recently: “The ideal of a rules-based international order, where multilateral institutions restrain states pursuing their self-interest, has proved to be a false hope… we are back to a world closer to that ofThucydidesin which the strong do what they can and the weak suffer what they must.”\nThe change is happening at the public sector level, too. In 2024, global governmental expenditure onspaceprogrammes surged to $135 billion (€119 billion) — up 10% from the year before. The primary driver was rising defence budgets. Arecent Bruegel reportconcluded that without support from the United States, “Europe could need 300,000 more troops and an annual defence spending hike of at least €250 billion” to keep the continent safe. As geopolitical tensions rise, governments worldwide have been funnelling money into space-based defence technology, a recognition that the sector is the cornerstone of any modern military.\nOne of the unintended yet highly beneficial consequences of this shift amongstartupsis its impact on the private space sector. Increased defence investment is breathing new life into aerospace and deep-tech innovation. Companies that previously struggled to secure commercial funding are now benefiting from sustained government investment, allowing them to work on cutting-edge technologies. These include (among many others) optical communications, needed for secure and high-speed space-based data transmission; Earth observation, crucial for climate monitoring, disaster response, and resource management; and synthetic aperture radar (SAR), enabling all-weather, day-and-night imaging capabilities with high precision.\nDespite the opportunities that await here, moving from purely commercial to defence markets is not without its hurdles. Startups can face significant challenges. Government contracts often come withdelayed payments and long procurement cycles, creating cashflow issues for smaller firms that lack financial reserves. Defence-related technologies are subject to stringent export controls and compliance requirements, heaping bureaucratic burdens on startups that many are ill-equipped to bear.\nBut for those companies that make the pivot successfully, the rewards far outweigh these obstacles. Defence funding provides long-term stability and a runway for companies to develop world-class technology that may later be commercialised in other sectors. In other words, to pivot into space isn’t necessarily to leave behind the commercial world.\nSome startups are making full-blown pivots to defence, but the real sweet spot remains in the world of dual-use technology — those innovations that serve both commercial and defence markets. Companies that maintain this balance benefit from diverse revenue streams, greater resilience to market fluctuations, and the ability to shift emphasis as commercial demand evolves.\nThe success of this dual-use approach is plain to see in the companies that have seamlessly integrated their offerings across sectors. Take the SAR satellite company ICEYE, whose data is used in flood response, maritime activity monitoring, andconflict zones like Ukraine. Or FibreCoat, whose advanced materials protect satellites from the harsh conditions of space, regardless of what those satellites are used for.\nGiven the scale of government investment, as well as the ongoing volatility in the broader geopolitical landscape, it’s highly unlikely that the present shift in focus towards defence is merely a fad. There is anew world orderin place, and national security considerations will play a defining role in geopolitics for years to come.\nHowever, the space sector’s ultimate goal should be a balanced ecosystem where defence and commercial efforts reinforce one another. The current surge in defence spending is helping accelerate technological innovation, funding infrastructure that will benefit the commercial sector in the long run. As companies continue to develop dual-use applications, they can ensure that the innovations sparked by defence priorities also drive broader commercial progress.\nThat’s good news because space touches almost every area of modern life. It’s the backbone of the world economy. It plays a vital role in navigation, communication, connectivity, and sustainability. The space economy is projected to reach $1.8 trillion (€1.58 trillion) by 2035, accordingto a reportby McKinsey and the World Economic Forum. We may well be entering anew golden agefor the industry, one in which entrepreneurs have access to more capital, investors are more willing to back high-risk ventures, and technology development is progressing at an unprecedented pace.\nIf companies can navigate the challenges of defence contracting while remaining mindful of the broader commercial applications of their products, the entire space ecosystem stands to benefit. For startups, the key will be balancing short-term defence opportunities with long-term strategic growth, so ensuring that today’s pivot does not become tomorrow’s dead end. But if the evolution towards greater defence investing is managed wisely by all involved parties, it could propel the space industry into its most vibrant era yet.\nDefence tech will be a hot topic atTNW Conference, which takes place inAmsterdam on June 19-20.Tickets for the event arenow on sale— use the code TNWXMEDIA2025 at the checkout to get 30% off.\nBogdan Gogulan is the CEO and Managing Partner of NewSpace Capital, the world’s first private equity firm devoted exclusively to growth-stag(show all)Bogdan Gogulan is the CEO and Managing Partner of NewSpace Capital, the world’s first private equity firm devoted exclusively to growth-stage companies working in the space technology sector. By backing these companies, NewSpace Capital helps them to tackle some of the greatest challenges facing us today, from sluggish productivity to the climate crisis.\r\nWith two decades' experience in finance and defence, Bogdan has held business development and strategy positions at AT Communication, American Express, and Deutsche Bank, and managed projects for security and defence agencies.\nGet the most important tech news in your inbox each week.",
    "url": "https://thenextweb.com/news/space-startups-defence-tech-pivot",
    "source": {
      "name": "The Next Web (TNW)"
    },
    "publishedAt": "2025-06-13T06:00:27Z"
  },
  {
    "title": "Live selling: the next big hustle sweeping Europe",
    "content": "Tinny music plays in a dimly lit basement as we watch a teenager pull football shirts off a nearby clothing rack and hold them up to the camera. He describes each item monotonously — the team, season, colour, and condition — before sticking on a numbered label and transferring them to another rack. Each item gets less than a minute in the limelight.\nBid rates and prices are listed at the bottom of the screen with eager buyers swiping a yellow bar to bid, while exchanging questions, comments, and emojis in the live chat box. When a buyer wins a bid, their username pops up with bursts of brightly coloured confetti. After live streaming for just over an hour, the teen has made €1,000 in sales.\nGenerating this kind of cash onVinted, eBay, Depop, or any other static peer-to-peer marketplace would have taken days, even weeks. Instead of writing detail-heavy descriptions, uploading multiple images, and fielding a laundry list of questions from interested parties, independent resellers and small retailers are turning the camera on themselves to livestream video auctions on the shopping app Whatnot.\nThe Californian startup has been quietly plugging away since 2019, when product management whizz Grant LaFontaine and software engineer Logan Head founded it to solve the pain points experienced by sellers of the plasticFunko Popfigurines, includingcounterfeit sellers and scams.\nThe success has been a slow burn, with the focus still on niche hobbyist and fan communities. This year, however, has been pivotal for the app. It kicked off by raising$265mn(€233mn) in a Series E funding round, which brought its valuation to $4.97bn (€4.37bn). When TikTok went dark in the US earlier this year, Whatnot placed ads in a number ofnational newspapersto reach sellers using the platform’s Shop feature, whose livelihoods were at risk from the federal ban. Since then, its growth in the UK, Europe, and North America has been remarkable, with a100% increasein both new sellers and first-time buyers over the past year.\nWith sellers across 140 shopping categories and nine geographies, flogging everything from hair products and luxury bags to bullion and Plushies, it’s eBay meets Twitch, with a distinct DIY, lo-fi feel. Sellers aren’t broadcasting from pristine, influencer-grey homes, they’re experimenting from bedrooms in shared housing, squeezing shows in between the school run, or beaming in from quiet moments in thrift stores. For many, it’s shaping up to be a full-time job, with some even employing a team to manage their operations.\nLivestreaming and “shoppable” video content have been booming in China for years, where platforms like Douyin (TikTok’s Chinese equivalent) and Taobao host thousands of daily livestreams.Over 600 million Chinese consumersregularly watch shopping live streams, and the breadth of what they can buy through this medium is staggering. A newlife insurance policy,still wriggling crabsdirect from a small village farmer, a discountedMcDonald’s chicken sandwich, asecondhand car— the list goes on. Top live sellers, often called “Key Opinion Leaders” such asAustin Li (aka The Lipstick King) have built mega followings and can easily generate $100mn (€88mn) in sales in a single session. In 2024, the Chinese livestream commerce market reached5.86 trillion yuan,equivalent to about€715bn. By 2026, it’s projected to reach 8.16 trillion yuan (€996bn).\nWhile China will forever remain streets ahead, the medium is undeniably taking root in Europe. On Whatnot’s platform, there’s been a600% year-on-yearincrease in European sellers specifically, and they host more than 20,000 hours of live shows a week. Over half (59%) generate the majority of their revenue from live selling, which rises to 70% for UK sellers, according to the platform’s data from early 2025. This real-time, interactive approach to shopping is attractive for small resale businesses, but is also pulling in passionate buyers-turned-sellers, many of whom have never been in front of an audience before.\nIt chimes with a trend thatSam Shaw, strategy director at cultural insights practiceCanvas8, has been tracking for over a decade — the desire to be your own boss, which is especially prevalent among younger generations. Nearlytwo-thirds of people aged 18 to 35say they’ve started a side gig to supplement their income, or plan to start one, according to a survey by Intuit. Nearly half of those surveyed say their primary motivation for starting a side hustle is to be their own boss. “There’s a strong desire for independence and to build something personal,” says Shaw. “Live selling lets people turn their interests or products into a business.”\nAndrew Tubman, for example, hadn’t heard of live selling before he attended the London Card Show with his young son in 2023. A punter with a penchant for Pokémon cards, it was here that he first came across Whatnot. He downloaded the app and used it to buy more trading cards, and spent big on several limited edition Disney collections. “I was watching how livestreamers were doing it, what works and what doesn’t,” explains the 35-year-old from Cranleigh, Surrey. “Then I took the leap to do my first show as a seller in February last year — it was addictive.”\nWorking a 48-hour week in the motor trade industry, Andrew — known as@TubmanBreakson Whatnot — managed to fit in a couple of shows weekly, selling sports and entertainment trading cards. He began to see that it could be a viable sideline business. Less than two months after Andrew and his wife Chantel registered as a company, it was clear that demand was high, and live selling alongside the day job wasn’t sustainable.\n“At least six nights a week, I was streaming all night, then staying up to pack the cards for postage — it was exhausting,” explains Andrew. “I’d been doing my full-time job for a decade, and although stable, I didn’t enjoy it — it was just to pay the bills and put food on the table for my three kids.” Since leaving his salaried role and putting everything into the business in the spring of 2024, Andrew hasn’t looked back. Monthly turnover now easily exceeds £1mn (€1.2mn), with Andrew and his wife each paying themselves an annual salary of £50,000 (€59,600). “It’s not been a get-rich-quick scheme though — we’ve put a lot of hours in, and plenty of revenue has gone straight back into the business so we can grow,” he says.\nIn a sea of social selling platforms, why is Whatnot netting so many sellers? First off, the earning potential is hard to ignore. Andrew’s balance sheet is far from an anomaly on Whatnot. Almost two-thirds(65%) of European live sellersare making more than £10,000 (€11,900) a month, and one in four earn over £50,000 (€59,600) a month. They have an eye on further growth too — 78% plan to expand their efforts this year.\nUp against other live selling platforms, Whatnot’s seller fees are largely aligned. In Europe, it charges astandard commission feeof 6.67% plus VAT on the final price, compared toTikTok Shop, which raised its UK seller fees from 5% to 9% in 2024, andInstagram Live, which charges a 5% selling fee per shipment. For shipments that are £7.96 (€9.49) or less, a flat fee of 23p (€0.27) is charged instead. Fee comparisons with static selling platforms like eBay and Poshmark are almost pointless, though, as many are battling to keep fees low or eliminate them entirely. For example, there are no seller fees on Vinted; instead, the platform collects 5% and €0.70 per item from the buyer.\nJon-Luc Greenwood, 26, from Manchester, UK, has been in the resale business across several platforms since he left college over 10 years ago, and had been predominantly making a living selling clothes on eBay until he discovered Whatnot. He met girlfriend Char Williams three years ago after she asked him for business advice, and not long after, moved down to live with her in Plymouth, Devon.\n“I have a degree in beauty promotion, and worked across several cosmetics counters, but a period of ill health meant I couldn’t work a normal nine-to-five job,” says 27-year-old Char, who stumbled upon selling on apps while recovering. With Char’s knowledge of makeup and skincare, and Jon-Luc’s resale expertise, they set up as@jonlucandcharon Whatnot in November 2023. Within months, the pendulum of earnings swung from eBay to Whatnot.\nSoon, 90% of their income was generated through the livestream app and by Q4 of 2024, weekly sales reached £15,000 (€18,000) a week. For them, the draw is “instant gratification” and the ability to shift a high volume of products, for example, through flash sales, yet also garner high bids for one-off editions. Payment for shipping is integrated within the platform, which saves hours when selling thousands of goods at a time.\nWhen asked about the benefits of Whatnot over other platforms, increased sales volumes came outtop (43%) for European live sellerstoo, followed by larger revenue (42%). Naturally, sellers get a kick out of seeing their earnings tick up in real-time as they stream, but Jon-Luc, Char, and Andrew all highlight the boost they get from their audiences too. “Most of my friends think I’m mad for buying pieces of shiny cardboard, but through this, I’ve met so many new friends and people I speak to on a daily basis via WhatsApp,” says Andrew.\nJon-Luc points out that with skincare and beauty being strongly rooted in community, their livestreams have become a social space too, with many of the same women joining. Some watch every minute of every stream — roughly 20 hours a week, spread across three evenings. They might not shop, but they just like being there. “Everyone comes and talks about their day or their problems in the chat,” says Jon-Luc. “We also have aFacebookcommunity page where people put photos of themselves using our products, ask questions, and make suggestions of what they want next — we can see people getting really friendly with one another.”\nChar compares livestreaming to “being on FaceTime with a friend,” and often tailors recommendations to individual budgets and medical needs like rosacea or severe acne. “Ultimately, I’m putting on a show, so the banter and giveaways need to be good, but it’s making people feel less alone too — they’re finding a companionship they might not get elsewhere,” explains Char. “I spend eight hours at a time talking to these people so I get to know them.” With all the adrenaline, she says the minutes fly by, and she’s more than accustomed to talking continuously on camera, having built up “the live presenting muscle”.\nTypically, Char goes live from the warehouse at 5pm, finishes at 1am, goes home to cook dinner, and is asleep by 3am. The day after a show is spent packing goods and breathing a sigh of relief, she says. While there’s a physical, location-based element to this kind of work — holding up items and having space to store and pack them afterwards — there’s a freedom to it too. With the right kind of organisation, portable tech, and staff to pack and send items, live sellers can broadcast from anywhere. “We went live for an hour when we were on holiday in Dubai, and sold thousands of pounds worth of stuff,” says Jon-Luc.\nWhile videocommerce — or v-commerce — may be just nudging at mainstream status in Europe, the videoification of almost everything else, from podcasts and news to education and medical care, is at fever pitch level. Research by network insights firmSandvinefound that live and on-demand video constituted an estimated 62.46% of EMEA internet traffic by volume in 2022. And at the end of last year,Ericsson’s 2024 Mobility Reportfound that video traffic was anticipated to account for 74% of all global mobile data traffic.“If we’re already FaceTiming, Zooming, and doing Google Hangouts, why would we continue to shop static?” says Maryam Ghahremani, CEO ofBambuser, a social commerce platform that works with brands likeAudi,Sonos, andZarato produce livestream and shoppable content. “Shopping and e-commerce will, over time, pivot into video, because customers are already spending their time with that medium.” McKinsey predicts that by 2026,20% of online saleswill flow through live shopping platforms.\nIn the brand space, Ghahremani has seen live selling move from “nice-to-have to a standard e-commerce channel” in a short space of time. Founded in 2007 with a focus on mobile broadcasting and citizen journalism, the Swedish-born Bambuser now works on providing retailers with the technology to produce live selling content across any digital channel, saving them from hiring a production and web development team.\nLooking to the future, Ghahremani expects more large brands to begin training up their internal staff to be live sellers. Whether it’s floor staff, shop assistants, buyers, or directors, they already know the products inside-out, and so only require training in being on camera and using the technology. Electricals storeCurrysbegan by offering one-way video calls between customers and in-store staff members, which has grown into theUK retail industry’s largest video commerce channel, with designated spaces in physical stores for staff to live sell and advise.\nReliability and a human touch certainly play a role in the v-commerce influx, in part, driven by the ongoing cost-of-living crisis, which sees people having to do more thorough research into purchases. A report from 2025 found that55% of European consumerscan’t afford to make the wrong choice, with quality and trust now trumping price. “While live selling in China is transactional, I see the shift in EMEA and the US being more about brand storytelling, transparency, and education,” says Ghahremani. “People aren’t going with just the goal of shopping — they want to be entertained, and educated with brand or product knowledge.”\nAs major players like TikTok Shop, Instagram Live, Whatnot, and Amazon Live work to create and develop full-stack ecosystems that transition from video to checkout seamlessly, more people are going to find themselves live selling on the side — by chance and by design. “Europeans are choosing live selling over traditional jobs because they’re disappointed with conventional career paths and as regular wages aren’t covering expenses, they’re looking for other ways to make money,” says Shaw, of Canvas8. “Live selling seems to offer the chance to set their own hours and directly profit from their efforts.”\nTapping aspects of the gig economy, influencer culture and direct peer-to-peer sales, this model may grant relative freedom, but effectively paves the way for a never-ending hustle. Jon-Luc and Char already have one staff member who manages packing and postage, but want to hire a full-time seller who could stream during the day, making it an almost 24-hour operation. As Char points out: “We know other streamers who are constantly live, and just move from one stream to another throughout the day and into the night — after all, if you’re not live, you’re not making money.”\nMegan Carnegie is a London-based independent journalist who specialises in writing features about the world of technology, work, and busines(show all)Megan Carnegie is a London-based independent journalist who specialises in writing features about the world of technology, work, and business for publications like WIRED, Business Insider, Digital Frontier and BBC. Her work is underpinned by a desire to investigate what's not working in the working world, and how more equitable conditions can be secured for workers — whatever their industry.\nGet the most important tech news in your inbox each week.",
    "url": "https://thenextweb.com/news/live-selling-europe-side-hustle",
    "source": {
      "name": "The Next Web (TNW)"
    },
    "publishedAt": "2025-06-10T06:30:50Z"
  },
  {
    "title": "Apple Announces iOS 26 With Liquid Glass Design, And AI Features At WWDC 2025",
    "content": "During its WWDC 2025 keynote, Apple officiallyintroducediOS 26, a major update for iPhones. The jump in version number—from iOS 18 to 26—is intended to align all Apple operating systems with a uniform naming convention based on the release year, reducing user confusion.\nOne of the most significant changes in iOS 26 is the introduction of theLiquid Glassdesign. This new aesthetic features a translucent, glass-like appearance that refracts and reflects surrounding content. It enhances personalization across controls, navigation elements, app icons, widgets, the home screen, and lock screen.\nLiquid Glass allows for dynamic adjustments—such as adapting time displays to available space—and introduces3D wallpaper effectsthat respond to device movement. Safari receives fluid transitions between pages, and apps like Music, News, and Podcasts now have floating tab bars. Developers will also gain access toAPIsto integrate Liquid Glass into third-party apps.\niOS 26 includes major enhancements throughApple Intelligence, Apple’s generative AI system. Key features include:\nLive Translationin Messages, FaceTime, and Phone apps for real-time multilingual communication.\nIntegration withChatGPTfor context-aware actions, screen content suggestions, and cross-platform searches.\nNew creative tools likeGenmojiandImage Playgroundfor personalized emoji and visual responses.\nSmart shortcutsandautomatic summariesfor tasks like package tracking in emails.\nDevelopers can use the newFoundation Modelsstructure to access AI capabilities directly on the device.\nThePhone appnow consolidates Favorites, Recents, and Voicemail. It supportsLive Voicemail ScreeningandWait Assistant, which notifies users when an agent is available. TheMessages appintroduces new message filters for unknown senders, chat background customization via Image Playground, and features likepoll creationandApple Cashfor peer payments.\nApple Musicnow featuresreal-time lyric translation,lyric pronunciation, andAutoMix, which uses AI for DJ-style transitions between songs.\nApple Mapsintroduces aVisited Placessection, route learning via AI, and real-time travel suggestions with encrypted data protection.\nApple Walletnow offersinstallment payments,rewards tracking, andreal-time flight updatesintegrated with Maps and Find My.\nCarPlaygains acompact call interface, pinned messages, and live widgets, also extending to the newCarPlay Ultrafor premium vehicles.\nApple Games appaggregates installed games, social features, and Arcade integration.\nAirPods updatesallow studio-quality audio recording and remote camera control via the stem.\nSafariintroducesenhanced fingerprinting protectionfor greater privacy.\nParental controlsnow include app approval, FaceTime content blurring, and exceptions for age-restricted downloads.\nAccessibility gets a boost with an improvedAccessibility Reader,Braille Access interface, and enhancedLive Listen,Background Sounds, andPersonal Voicetools.\nIn addition to iOS 26, Apple also unveiledmacOS 26 (Tahoe),iPadOS 26,visionOS 26, andtvOS 26, all unified under the newLiquid Glassdesign language for a consistent and modern aesthetic.macOS 26brings a refreshed interface, dynamic Spotlight search, and a centralized Apple Games app.iPadOS 26inherits many features from iOS 26, including Apple Intelligence and the new multitasking enhancements tailored for the iPad’s larger screen.visionOS 26improves spatial interactions with advanced 3D object handling, enhanced Personas for video calls, and immersive browsing in Safari.tvOS 26introduces a transparent UI, personalized profiles, and new Apple Music features like Sing Mode and real-time lyric translation. These updates collectively demonstrate Apple’s commitment to delivering a seamless and intelligent experience across all its platforms.\niOS 26 is available starting June 9, 2025, as adeveloper beta, with apublic betaexpected inJuly. Compatibility details for supported iPhones are provided in a separate update by Apple.\nFiled inApple. Read more aboutAI (Artificial Intelligence),AppleandApple Intelligence.",
    "url": "https://www.ubergizmo.com/2025/06/apple-ios-26/",
    "source": {
      "name": "Ubergizmo"
    },
    "publishedAt": "2025-06-10T00:33:46Z"
  },
  {
    "title": "WhatsApp Now Allows Users Forwarding Media To Meta AI For Analysis",
    "content": "WhatsApp is introducing a new feature that allows users to forwardphotos, videos, and texttoMeta AI, the platform’s integrated chatbot, for content analysis. Initiallyreleasedthrough thebeta channel (version 2.25.18.8 for Android), the feature is also gradually rolling out to some stable users.\nWith this new capability, Meta AI can analyze forwarded content to providecontextual information, such as identifying thelocation where a photo was taken,describing images,cross-referencing data, and evenverifying the authenticity of viral videos. This function aims to enhance the chatbot’s utility, especially for users seeking quick insights about media content.\nAccording to WhatsApp, the feature has potentialanti-misinformation benefits. By enabling users to verify forwarded content using Meta AI, the tool could become avaluable asset in combating fake news and misinformation, particularly in viral media shared across chats.\nIn terms ofprivacy, Meta AI only accesses contentexplicitly shared by the user. All shared data isend-to-end encryptedduring transmission and isdeleted from cloud serversafter processing. This approach is designed to maintain user trust and uphold WhatsApp’s strong privacy standards.\nTo use the feature, users canselect a photo or video, tap thesharebutton, and check ifMeta AIappears as a sharing option. If it does, the content can be forwarded directly to the chatbot for analysis and feedback.\nThis enhancement follows another recent update to WhatsApp, which introducednew animationsfor sending media, further improving the overall user experience. Additionally, WhatsApp is also testing anew method to copy message content, indicating the company’s broader effort to refine user interactions and expand the app’s functionality.\nThese updates reflect Meta’s ongoing push to integrate AI-driven tools across its platforms, with WhatsApp now becoming a more intelligent and interactive messaging environment. As AI integration deepens, more features like this are likely to emerge, giving users enhanced ways to understand and manage shared content.\nFiled inCellphones>Robots. Read more aboutAI (Artificial Intelligence)andWhatsapp.",
    "url": "https://www.ubergizmo.com/2025/06/whatsapp-forwarding-meta-ai/",
    "source": {
      "name": "Ubergizmo"
    },
    "publishedAt": "2025-06-07T18:00:44Z"
  },
  {
    "title": "iOS 26: Enhancements Coming To Native Apps Including Messages, Music, Notes, And CarPlay",
    "content": "Apple is expected to unveiliOS 26—previously referred to as iOS 19—onJune 9duringWWDC 2025, and new rumors suggest the update will introducea series of minor but useful improvementsacross several native apps. These updates will complement iOS 26’srefreshed visual designand its integration withApple Intelligence, Apple’s evolving AI framework.\nAccording to sources from9to5Mac, Apple is quietly preparingfive small enhancementsacross its core iOS apps to deliver a more polished and intelligent user experience.\nStarting with theMessages app, users can expect two key additions:\nApple Music now has an animated art feature in iOS 17pic.twitter.com/PfF2nwCsYa\n— Apple Hub (@theapplehub)September 15, 2023\n\nApple Musicwill also gain a visual enhancement. Theanimated album covers, introduced in iOS 17, will now be displayed on thelock screen, bringing a more dynamic and stylish aesthetic to music playback while aligning with the broader visual updates of iOS 26.\nIn theNotes app, users will finally receiveMarkdown file support—a long-requested feature. Markdown allows for advanced text formatting such as headers, bold text, and lists. Previously, users relied on third-party note-taking apps to access this functionality, but it will now be natively supported within Apple’s Notes.\nCarPlayis also set to receive arefreshed interface, although details remain scarce. The update is expected to incorporatemultiple design changesthat match the updated iOS 26 look and feel, improving the in-car user experience.\nThese changes may be relatively modest in scope, but they are designed toenhance usability and integrate seamlessly with Apple’s AI and design goalsfor the platform. While larger Apple Intelligence announcements may be downplayed at WWDC 2025, theseincremental app updatescould make iOS 26 more appealing to users looking for smarter and more visually cohesive experiences.\nOverall, iOS 26 appears to be a refinement-focused update, enhancing functionality and aesthetics across key apps, while laying the groundwork for deeper AI integration in future releases.\nFiled inApple>Rumors. Read more aboutApple Music,iOSandRumors.",
    "url": "https://www.ubergizmo.com/2025/06/ios-26-enhancements/",
    "source": {
      "name": "Ubergizmo"
    },
    "publishedAt": "2025-06-06T18:00:17Z"
  },
  {
    "title": "GMail Introduces AI Summaries By Default On Android And iOS",
    "content": "Googlehas begun rolling outautomatic AI-generated email summaries in the GMail app for Android and iOS. This update representsa shift from Gemini, Google’s AI assistant, being an optional feature to becoming a standard tool for certain users. The aim is to provide a quicker overview of long or multi-reply conversations without requiring manual input.\nPreviously,AI-generated summaries had to be triggered manually. Now, they appear automatically at the top of selected emails. The Gemini assistant determines when a summary is relevant based on the structure and content of the conversation. Typically, summaries are generated for extended email threads or discussions with numerous responses. These summaries are presented as concise bullet points and update dynamically as new messages are added to the conversation.\nInitially, this feature is being made available toGoogle Workspace users,Google One subscribers with the AI Premium plan, andusers with Gemini Education add-ons. For now, it islimited to emails written in Englishandonly available on mobile devices.\nUsers who prefer not to use AI summaries can opt out, but doing so comes with a trade-off. Disabling this feature requires turning off Gmail’s “smart features” entirely. This action also disables useful functionalities such aspriority notifications,package tracking,smart reply, andwriting suggestions.\nThe summarization feature is powered bylarge language models (LLMs)—the same technology that underpins modern AI assistants and chatbots. These models analyze email content to generate summaries, and in turn, Google may use anonymized data from emails to improve its AI systems.\nBy introducing automatic AI summaries, Google signals a broader strategy to integrate generative AI into its core products. The update is part of an ongoing effort to enhance Gmail’s efficiency for users who manage high volumes of emails. However, there isno official timelinefor when this feature will become available forpersonal Gmail accountsor for theweb version of Gmail.\nFiled inCellphones. Read more aboutAI (Artificial Intelligence),GMailandGoogle.",
    "url": "https://www.ubergizmo.com/2025/06/gmail-ai-summaries-by-default/",
    "source": {
      "name": "Ubergizmo"
    },
    "publishedAt": "2025-06-02T18:00:37Z"
  },
  {
    "title": "One In Four European Firms Ban Grok AI Chatbot Over Security Concerns",
    "content": "According to a new report by cybersecurity firmNetskope,25% of European organizations have banned Grok, the generative AI chatbot created by Elon Musk. The data indicatesa significant level of distrusttoward Grok compared to other AI tools currently in use across Europe.\nBy comparison,OpenAI’s ChatGPT, the most widely adopted AI application, is blocked by only9.8%of European firms, whileGoogle’s Geminiis restricted by9.2%. The discrepancy reflects growing scrutiny over how different AI platforms handlesecurity, privacy, and content moderation.\nGrok has recently come under fire forspreading misinformation, includingfalse narratives about a “white genocide” in South Africaandquestionable claims related to the Holocaust. These incidents have prompted many organizations toopt for alternatives perceived as more secure and reliable.\nNeil Thacker, Global Privacy and Data Protection Officer at Netskope, explained that the bans reflect increasing corporate awareness arounddata privacy, model transparency, anddata usage policies. Businesses are beginning to distinguish between AI apps based on how responsibly they handle user inputs and data training practices.\nThe report also shows that91% of European organizationsnow utilize cloud-based generative AI chatbots, indicating widespread adoption of AI technology. However,usage is selective: some tools face resistance due tolicensing, transparency, or privacy concerns.\nStable Diffusion, the image-generation AI developed by UK-based Stability AI, holds the title of the most blocked AI app in Europe, restricted by41% of organizations. It is frequently flagged due toprivacy risks or ambiguous licensing practices.\nGianpietro Cutolo, a cloud threat researcher at Netskope, noted that organizations are becoming more sophisticated in assessing thesecurity risks of specific AI platforms. This growing caution is particularly visible in the case of Grok, which, despite being branded by Musk as a “truth-seeking AI,” is losing credibility in the enterprise space.\nThe backlash against Grok comes amid broader reputational challenges for Musk, including a reported52% drop in Tesla’s sales in the EUlast month. Some analysts suggest that Musk’spolitical associationsand public persona may benegatively impacting trustin his AI products as well.\nFiled inRobots. Read more aboutAI (Artificial Intelligence),Elon MuskandEurope.",
    "url": "https://www.ubergizmo.com/2025/05/european-firms-ban-grok/",
    "source": {
      "name": "Ubergizmo"
    },
    "publishedAt": "2025-05-31T17:16:20Z"
  },
  {
    "title": "Google Announces AI Ultra Subscription Plan With Premium Features",
    "content": "During the latest edition ofGoogle I/O, the company introduced several updates, including the launch ofGoogle AI Ultra, a new premium subscription plan. Contrary to what the name might suggest, AI Ultra is not a new artificial intelligence model, but rathera high-end service packageoffering advanced features and enhanced access to Google’s AI tools and platforms.\nTheAI Ultra planis designed for power users who want access to Google’s most advanced tools, including expanded usage limits and priority access to cutting-edge technologies.\nKey features include enhanced use of the Gemini AI model, extended capabilities for deep research, and early access to the upcomingVeo 3video generation platform. The current version,Veo 2, is already included.\nOne of the most notable aspects of the plan is its price:$249.99 per month. For now,availability is limited to the United States, but Google has confirmed plans to expand to other countries in the near future, although no specific timeline has been given.\nThe subscription also includes a bundle of existing premium services. Users receiveYouTube Premium,30 TB of cloud storageacross Google Drive, Photos, and Gmail, and access toGeminiintegrated into various Google Workspace apps like Chrome, Gmail, Docs, and the newVidsplatform. In addition, theNotebookLMtool—Google’s AI-powered research assistant—will be part of the offering.\nSubscribers will also gain access toWhisk,Flow, and theMariner Project, which are tools focused on advanced image creation, video production, and task management. These additions highlight Google’s aim to create a more comprehensive productivity and creativity suite powered by AI.\nGoogle AI Ultra is positioned as a premium-tier service aimed at professionals, researchers, and creators who require robust tools and early access to innovation. While the high monthly fee may limit its adoption, the plan reflects Google’s strategy to monetize its AI ecosystem and compete with other enterprise-level AI platforms.\nFiled inComputers>Photo-Video>Robots. Read more aboutAI (Artificial Intelligence),GoogleandGoogle I/O 2025.",
    "url": "https://www.ubergizmo.com/2025/05/google-announces-ai-ultra/",
    "source": {
      "name": "Ubergizmo"
    },
    "publishedAt": "2025-05-23T18:00:01Z"
  },
  {
    "title": "Windows 11 Introduces AI Actions In File Explorer For Enhanced Productivity",
    "content": "Microsofthas beguntesting anew AI-powered feature in File Explorer for Windows 11, aimed at streamlining common tasks such as summarizing documents and editing images. This functionality is currentlybeing rolled out to users enrolled in the Windows Insider Program, specifically within theDev and Beta channels.\nThe update is part of a broader initiative focused on integrating AI into the operating system, especially on new Copilot+ PCs. These AI Actions are being introduced gradually, with some features available for manual activation by advanced users who wish to try them early.\nIn File Explorer, right-clicking supported files now revealsAI-driven options. These include editing images, summarizing text documents, and even generating FAQs based on document content. The features are designed to integrate tools from Microsoft Copilot and apps like Paint and Photos more seamlessly into the user workflow.\nFile Explorer with the context menu open on a file, highlighting the new AI actions inside a red box. (Image: Microsoft)\nAI Actions related to images support formats such as JPG, JPEG, and PNG. Users can applyeffects like background blur,object removal, and background replacementusing either thePhotos or Paint apps, depending on the action.\nDocument-related featuresare also being enhanced. Users with OneDrive or SharePoint storage can benefit from AI tools such asdocument summarization, especially if they have a Microsoft 365 Copilot subscription. Supported formats include .docx, .pptx, and .pdf. Additionally,automatic Q&A generationis available for certain file types but requires a corporate account and is limited in availability.\nFor those wanting early access, the features can be manually enabled using theViVeToolutility with feature IDs54792954and55345819. However, Microsoft recommends waiting for the official rollout, expected in the coming weeks, to ensure stability and compatibility.\nThese AI enhancements are part of a larger update to Windows 11 that also includes improvements to the widgets panel, energy management, and advanced system settings. Microsoft’s push to embed intelligent features directly into the operating system reflects its broader strategy to enhance user productivity and integrate AI more deeply into everyday computing tasks.\nFiled inComputers. Read more aboutAI (Artificial Intelligence),MicrosoftandWindows 11.",
    "url": "https://www.ubergizmo.com/2025/05/windows-11-ai-actions/",
    "source": {
      "name": "Ubergizmo"
    },
    "publishedAt": "2025-05-22T18:00:10Z"
  },
  {
    "title": "Google Reveals Android XR And Gemini Integration At I/O 2025",
    "content": "AtGoogle I/O 2025, Mountain View sharednew detailsabout its plans to integrate theGemini AIintoAndroid XR, a specialized version of the Android operating system designed for extended reality (XR) environments. This move reinforces Google’s commitment to the future of augmented reality (AR) and virtual reality (VR), even as the industry continues to progress at a measured pace.\nAndroid XR is Google’s platform for powering headsets and AR glasses, and theintegration with Geminiaims to make these devices more intuitive and helpful in everyday use. The goal is to bring the capabilities of Gemini’s generative AI directly into the user’s immersive experience—providing real-time information, task assistance, and contextual support based on the user’s perspective.\nAccording to Google, the integration will enhance usability by allowing users tointeract with their devices more naturally and efficiently. By embedding Gemini into Android XR devices, the user interface becomes more intelligent and proactive, reducing the need for manual inputs or reliance on smartphones.\nOne of the main advantages highlighted is the hands-free experience enabled by AI, especially when using smart glasses outside the home. Gemini can supportvoice-based interactions and visual context awareness, making it easier for users to stay informed and productive on the go. To support this vision, Google has partnered with eyewear brandsGentle MonsterandWarby Parkerto develop smart glasses that are not only functional but also stylish.\nIn the future, Google plans to collaborate withKering Eyewear, known for high-end fashion accessories, to create additional models. This aligns with Google’s strategy of merging advanced technology with everyday wearability, ensuring that its XR devices are both useful and visually appealing.\nThe integration of Gemini into Android XR signals a major step in the evolution of wearable technology. By combining artificial intelligence with AR/VR hardware, Google aims to create a more seamless, hands-free, and personalized computing experience, bringing the power of AI closer to the user’s real-world environment.\nFiled inGadgets. Read more abouteXtended Reality (XR),Google,Google geminiandGoogle I/O 2025.",
    "url": "https://www.ubergizmo.com/2025/05/google-reveals-android-xr/",
    "source": {
      "name": "Ubergizmo"
    },
    "publishedAt": "2025-05-22T14:44:57Z"
  },
  {
    "title": "CRDB Bank Migrates Acquiring and Issuing Systems to BPC SmartVisa Platform",
    "content": "Migrating to SmartVista platform has enabled CRDB Bank to consolidate its multi-country ecosystem under one microservices architecture, boosting operational efficiency while aligning with the national regulations and the international scheme certifications.\nCRDB Bank said it selected BPC as it sought a modern, scalable multi-institutional technological platform with the capacity for instant innovative card product launches, advanced integrational capabilities and affordable total cost of ownership.\nFollowing the move, CRDB Bank plans to expand its operations across Tanzania, Burundi, and DR Congo.\n“Migrating our switch and card management systems to BPC’s platform has significantly expanded our issuing and acquiring capabilities,” explainedAbdulmajid Nsekela, group CEO for CRDB Bank. “This strategic partnership provided us with tools to keep up with our goal to offer modern, secure, and convenient banking services.”\nBPC migrated the issuing and acquiring functionality of CRDB Bank, its subsidiaries in Burundi and DR Congo, and affiliates such asAmana,VisionFund, andKCBL(now part of bank CBT). The revamped card issuing capabilities extend from the ability to issue any type of card, from corporate, virtual, proprietary, loyalty, specialised cards like fuel and hospital cards, to internationally branded cards,Visa,Mastercard, andUPI.\nOn the acquiring side, CRDB Bank now accepts global brands across all of itsPOSnetwork, as well as offering cardless withdrawals, foreign exchange at ATMs and advanced services like utility payments and dynamic currency conversion.\nLeveraging the advanced integration capabilities of the SmartVista platform, CRDB Bank has connected its core modules with its own mobile banking (Simbanking) and agency banking (Wakala), facilitating seamless, omnichannel experiences for its customers through its entire multi-institutional network.\nGrant Truter, chief commercial officer, business development and SaaS operations – MEA at BPC, also commented: “It is an honour to have CRDB place its trust in BPC’s expertise for this critical legacy migration. We specialise in delivering scalable, future-proven solutions that empower our customers to expand their networks and bring payment innovations to their customers. Through our next-generation SmartVista platform, we support CRDB’s vision of providing modern banking experiences and help them drive financial inclusion and innovation.”\nThrough the adoption of BPC’s platform, CRDB Bank benefits from the new modular infrastructure that has ensured seamless integration of all applications and components and compliance with international schemes and PCI-DSS standards, has offered instant onboarding of affiliate institutions to the CRDB platform, and boosted flexibility for continuous innovations. Over 4.5 million cards have already been issued through the upgraded issuing platform, marking a significant milestone in CRDB Bank’s digital transformation journey.\nThe Fintech Times",
    "url": "https://thefintechtimes.com/crdb-bank-migrates-acquiring-and-issuing-systems-to-bpc-smartvisa-platform/",
    "source": {
      "name": "Fintech Times"
    },
    "publishedAt": "2025-06-17T04:00:26Z"
  },
  {
    "title": "Mastercard Ramps Up Customer Onboarding and Streamlines Payments With Cloud Edge in APAC",
    "content": "Cloud computing will account for over $1trillion in value across the world’s top 500 companies, but in the Asia Pacific region specifically, the technology is going to be integral for the growth of fintech. In fact, according toMordorIntelligence, it is set to drive the market to a projected value of nearly $311billion by 2029.\nFintechs worldwide are expected togrow approximately three times fasterthan the overall banking industrythrough 2028, powered largely by emerging markets growth in Asia Pacific. To ensure fintechs worldwide have the best opportunity to grow, Mastercard has made Cloud Edge available in Asia Pacific markets (including India,Australia,Singapore, Hong Kong SAR, Thailand), the United States, Canada and parts of Europe, Latin America, the Caribbean, Middle East and Africa.\nMastercard Cloud Edge provides customers, including issuers, acquirers, network enablement partners and payment processors, with:\n“With Cloud Edge, Mastercard brings pioneering innovations in cloud and payments to Asia Pacific banks, financial institutions, and cloud-native organisations – meeting forward-thinking customers where they want to be,” saidSandeepMalhotra, executive vice president, core payments, Asia Pacific, Mastercard.\n“Cloud Edge reinforces Mastercard’s commitment to resiliency, redundancy and security while offering customers cost efficiency as well as greater choice, speed and flexibility. For instance, with cloud computing, fintechs can serve customers easily during demand spikes like national holidays or sales events without needing more physical infrastructure.”\nFor example,Episode Six, a global provider of enterprise-grade ledger and cards infrastructure, is using Cloud Edge to assist banks, fintechs and payments organisations in Asia Pacific as they design and launch leading digital payment propositions like credit and B2B payments.\n“All of Episode Six’s bank-grade technology was created specifically for the cloud, and as such, we understand how important infrastructure is for partners to scale with greater security now and in the future,” saidJohnMitchell, co-founder and CEO, Episode Six. “We are excited to collaborate with Mastercard on Cloud Edge so that we can reduce time to market for their clients, while ensuring security, backup and protection by encrypting and storing data in the cloud.”\n“The AWS Regions across Asia Pacific offer Mastercard extensive connectivity and secure cloud services. Together with Mastercard’s global footprint, this provides organisations in the region with payment network access at low latency, ensuring seamless operations as well as compliance with regional data residency regulations,” saidScottMullins, managing director, financial services, AWS.\nThe Fintech Times",
    "url": "https://thefintechtimes.com/mastercard-ramps-up-customer-onboarding-and-streamlines-payments-with-cloud-edge-in-apac/",
    "source": {
      "name": "Fintech Times"
    },
    "publishedAt": "2025-06-17T00:30:09Z"
  },
  {
    "title": "Stable Launches to Help UK SMEs ‘Stop Wasting Time’ and ‘Start Smashing Growth Goals’",
    "content": "Acting as a strategic layer between SMEs and the often-overwhelming and complex fintech ecosystem,Stableplans to distil complex options into clear, high-performance tools for growth.\nEquals Group‘s former chief commercial officerTom Kiddle, ex-deputy chief financial officerSteve Paul, and founding CTODom Hutson, teamed up to establish the new company after recognising that UK SMEs remain underserved, which is hindering their ability to grow.\n“We created Stable to bring together the best tech under one roof, so British businesses can stop wasting time and start smashing their growth goals in 2025,” explained co-founder Kiddle.\nStable combines deep sector expertise withAI infrastructurethat streamlines how SMEs access and manage finance: from frictionless onboarding to smart funding options that not only red tape, but also speed up access to essential capital and services.\nIts launch comes having already established partnerships with a number of fintech providers, including Equals Money,Stored,Spark Finance,Navro, andFinseta, to deliver lending, collections, and payment solutions to UK businesses.\nJames Hickman, CEO of Finseta, commented: “UK SMEs are bombarded by choice but often rely on their bank for payments and foreign exchange services, where they are underserved and overcharged. The Stable partnership gets world-class payment capabilities quickly into the hands of UK businesses that rely on them for growth.”\n“Our partnership with Stable means we can reach more business owners who need funding quickly and effectively,” addedJulian Dobbin, founder of Spark Finance.\nRecognising that the financial industry is fragmented in many ways,Stablesays it aims to position itself as a trusted broker and aggregator of high-performance fintech solutions. Ultimately, it hopes to empower SMEs in the UK by simplifying and expanding access to smarter tools, enabling them to grow faster and more confidently.\nIan Strafford-Taylor, co-CEO ofEquals-Railsr, also commented: “I am delighted to see two graduates of the ‘Equals Academy’ coming up with such an innovative business idea that will provide much-needed service to smaller business that are so often overlooked. We are delighted to be a partner to this nascent business and look forward to assisting in its success.”\nTom joined The Fintech Times in 2022 as part of the operations team; later joining the editorial team as a journalist.",
    "url": "https://thefintechtimes.com/stable-launches-to-help-uk-smes-stop-wasting-time-and-start-smashing-growth-goals/",
    "source": {
      "name": "Fintech Times"
    },
    "publishedAt": "2025-06-16T12:30:10Z"
  },
  {
    "title": "RiseUp and Salt Edge Join Forces to Bridge Financial Insights and Payments With Open Banking",
    "content": "Simply integrating open banking isn’t enough. Organisations that utilise the tech must differentiate themselves by creating value from the data they gain. By partnering withSalt Edge, RiseUp is doing just that. UK businesses will receive a richer financial experience and a deeper understanding of their customers’ financial behaviours. The integration will seeRiseUpsimplify money management through the combination of AI-driven insights, smart behavioural technology, and real-time data analysis.\nBy combining RiseUp’s behavioural intelligence and AI-powered insights with Salt Edge’s secure, open banking-compliant platform, the partnership allows businesses to move from data aggregation to meaningful customer engagement. This enables financial institutions to identify key financial moments better and help consumers take action, whether it’s saving, lending, or building long-term financial well-being.\nStephenWinyard, chief sales officer at Salt Edge, said: “We’re thrilled to be partnering with RiseUp to bring a smarter, more connected financial experience to UK users. By integrating Salt Edge’s robust open banking infrastructure, we’re helping to make financial management more intuitive, personalised, and secure.\n“Our comprehensive suite of services, including AIS and PIS, ensures that RiseUp can offer seamless access to real-time financial data and enable frictionless payments, all while maintaining the highest levels of compliance and security. Together, we’re enabling businesses to deliver smarter financial solutions and creating a more connected, actionable experience that drives better financial outcomes for consumers.”\nFounded in 2017, RiseUp harnesses open banking and AI to deliver smarter financial experiences that drive growth and improve KPIs for financial institutions and fintechs. Salt Edge brings expertise in secure bank connectivity, offering regulated access to account information services (AIS) and payment initiation services (PIS) across thousands of financial institutions in over 50 countries.\nThis partnership empowers businesses to unlock new value by turning financial data into personalised experiences that engage users and accelerate innovation.\nIt represents a step change in how financial institutions can connect insights to action, enabling real-time, personalised nudges and seamless payment journeys that help consumers build lasting financial wellbeing.\nYuvalSamet, CEO and co-founder of RiseUp, said: “Open banking has given us unprecedented access to financial data, but the true value lies in transforming that data into meaningful action. Our partnership with Salt Edge enables exactly that, combining their trusted infrastructure with RiseUp’s AI on top, to help financial institutions identify key financial moments and drive real customer engagement.\n“Together, we’re moving beyond data aggregation to unlock real growth and empower people to make smarter, more confident financial decisions.”\n\nThe Fintech Times",
    "url": "https://thefintechtimes.com/riseup-and-salt-edge-join-forces-to-bridge-financial-insights-and-payments-with-open-banking/",
    "source": {
      "name": "Fintech Times"
    },
    "publishedAt": "2025-06-16T10:01:17Z"
  },
  {
    "title": "Ria Money Transfer Sets Sights on Supporting Businesses in Malaysia to Manage Worker Wages",
    "content": "By digitally streamlining wage distribution, the Ria Prepaid Card programme, in collaboration withMastercard, provides an omnichannel solution to employers struggling with conventional banking access for their workforce.\nThe Ria Wallet enables users to deposit funds, withdraw cash from ATMs, pay bills, and also facilitates domestic and international transfers. Customers can also make payments in millions of locations in Malaysia via QR payment linked toDuitNow.\nAccording to the United Nations-ledInternational Organization of Migration(IOM), Malaysian migrants represent an estimated 15.3 per cent of Malaysia’s total workforce, many of whom are unbanked. The Ria Wallet addresses the challenges faced by both workers and employers in the country’s cash-centric payment landscape.\nEspen Kristensen, Ria Money Transfer’s managing director, Asia Pacific, expressed his excitement for the expansion of Ria’s service portfolio in Malaysia: “We understand the challenges employers in Malaysia face when it comes to managing wages for their workers. Through the Ria Wallet, companies will be able to benefit from a digital solution that improves transparency and compliance across their operations.”\nThe Ria Wallet also streamlines payroll management for Malaysia-based companies throughout industries heavily dependent on migrant workers, including construction, agriculture, and manufacturing.\nHaving established a presence inMalaysiain 2001, Ria Money Transfer is now considered a trusted provider of money transfer services locally. Leveraging a large physical network of 624,000 locations worldwide and its presence in nearly 200 countries and territories, Ria aims to provide a diverse and seamless service experience to all customers.\nIn collaboration with Mastercard, the Ria Prepaid Card programme underscores the company’s commitment to driving positive social impact through the financial empowerment of different communities worldwide.\nThe Fintech Times",
    "url": "https://thefintechtimes.com/ria-money-transfer-sets-sights-on-supporting-businesses-in-malaysia-to-manage-worker-wages/",
    "source": {
      "name": "Fintech Times"
    },
    "publishedAt": "2025-06-16T02:30:08Z"
  },
  {
    "title": "Marqeta and Klarna Extend Partnership to Roll Out the Klarna Card in the US",
    "content": "In July 2024,Marqetabecame the first issuer processor in the US certified for Visa Flexible Credential (VFC). With VFC, Marqeta will enableKlarnacustomers to pay immediately or pay later when needed, all on the same card.\nThis milestone builds on years of collaboration between Marqeta and Klarna, including powering Klarna’s virtual cards in the US since 2018. The card is currently in a trial phase in the US, with a broader rollout in the US expected later this year.\n“The future of payments is flexible, and we’re proud to enable this new offering together with Visa,” saidRahulShah, chief product and engineering officer, Marqeta. “Our ongoing partnership with Klarna is a true testament to what’s possible with Marqeta’s platform and how we enable our customers to grow and innovate at global scale.”\n“Through our continued partnership with Marqeta and Visa, we’re evolving the Klarna Card into a truly dynamic and versatile payment experience,” saidDavidSandström, chief marketing officer, Klarna. “We’re excited to continue innovating alongside Marqeta as we scale the Klarna Card to provide smart, seamless payments that empower smarter, more informed shoppers everywhere.”\nWith its modern, flexible card issuing platform, Marqeta makes it possible for firms like Klarna to expand to new markets and offer innovative payment options tailored to evolving customer needs. Marqeta currently supports Klarna in six countries, helping to drive global growth and deliver seamless, consumer-first experiences.\nThe Fintech Times",
    "url": "https://thefintechtimes.com/marqeta-and-klarna-extend-partnership-to-roll-out-the-klarna-card-in-the-us/",
    "source": {
      "name": "Fintech Times"
    },
    "publishedAt": "2025-06-15T16:30:08Z"
  },
  {
    "title": "Banks Go Digital-First: The New Standard for 2025",
    "content": "Banking is no longer just about managing money—it’s about delivering digital experiences that are seamless, secure, and deeply personalized. In 2025, banks across the globe are making bold moves to go digital-first, driven by changing consumer habits, rising fintech competition, and the demand for real-time financial access.\nThis shift isn’t a trend—it’s a transformation. And it’s happening fast.\nA study by Visa and Tink revealed that almost half (44%) of young consumers in the UK believe neobanks offer significantly better tools and services than high street banks, and 27% already use third-party money management tools. This generation doesn’t just want digital options—they expect them to be fast, friendly, and helpful.\nRead more:Revolut Leads Digital Banking Surge in The UK as Downloads Top Legacy Banks\nThe research also found that 37% of UK consumers like their bank to give them more visibility over their finances. These numbers underline how digital experience now drives trust and loyalty.\nTraditional banks, meanwhile, are feeling the pressure. 57% of banking executives say that attracting young customers is their biggest challenge for the coming year, and 79% see money management tools as critical to winning new clients.\nDigital-first banking is no longer about just checking balances. Today’s leading banks are building features that give customers insights, guidance, and control over their financial lives.\nAccording toVisaand Tink’s research, modern mobile banking apps are starting to act like digital financial coaches. Features now being built into apps include:\nProactive balance forecasting to help avoid overdrafts\nPersonalized alerts for unusual spending or duplicate charges\nAutomated budgeting suggestions based on previous transactions\nSubscription tracking with the ability to cancel or pause in-app\nIn fact, 50% of UK customers said they want their bank to help them manage subscriptions, and 30% said they’d switch providers just to receive alerts on double charges or budgeting tips.\nThis digital coaching approach benefits both sides. Banks gain more engaged, loyal users; customers gain clarity and control over their spending.\nGoing digital-first doesn’t just mean speed and convenience—it must also mean safety.\nAccording to Visa, implementing world-class security across the entire customer journey is now a baseline expectation. This includesbiometric logins(face and fingerprint) and real-time fraud alerts.\nAs fraud risks grow with faster payments, banks are shifting to proactive fraud detection, using AI models to spot suspicious behaviour in real time. These systems don’t just stop fraud—they also help reduce friction for good transactions.\nDigital-first banks are also embracing embedded finance, where banking services are built into non-banking platforms.\nVisa notes that embedded finance tools are gaining traction, especially within the merchant ecosystem. For example, lending services are now being integrated into checkout flows, and white-label payment systems are enabling marketplaces to offer their own branded wallets.\nThis approach benefits everyone:\nBanks gain new distribution channels\nPlatforms improve user stickiness\nConsumers get seamless, contextual financial services\nDevelopers can build fast using Visa’s open APIs and SDKs\nThe rise of open banking is also pushing banks to become more flexible and API-driven. One practical use case is subscription management—where banks help customers track, control, and cancel recurring charges directly within the app.\nVisa’s solution includes identifying where a user’s card is stored, flagging new subscriptions, and offering controls to pause or stop charges instantly.\nFor example, YellowPepper in Peru used Visa’s aliasing technology to launch PLIN, a peer-to-peer app where users can send money with just a phone number, showing how banks can partner with fintechs to deliver user-friendly experiences.\nDigital-first isn’t a product. It’s a mindset—and a long-term strategy. Banks that succeed in 2025 and beyond will be those that put mobile tools at the heart of their offering, use AI to drive personalized insights, build secure, real-time payment rails, partner through APIs to extend reach, and stay responsive to shifting customer expectations.\nFor banks, this isn’t just about digital transformation—it’s about future survival.\nThe digital-first wave is not coming. It’s already here. Banks that lead with technology, simplicity, and customer value will be the ones that thrive in the fast-changing world of payments. Those that don’t may find themselves outpaced by more agile, customer-focused competitors.\nBanking is no longer just about managing money—it’s about delivering digital experiences that are seamless, secure, and deeply personalized. In 2025, banks across the globe are making bold moves to go digital-first, driven by changing consumer habits, rising fintech competition, and the demand for real-time financial access.\nThis shift isn’t a trend—it’s a transformation. And it’s happening fast.\nA study by Visa and Tink revealed that almost half (44%) of young consumers in the UK believe neobanks offer significantly better tools and services than high street banks, and 27% already use third-party money management tools. This generation doesn’t just want digital options—they expect them to be fast, friendly, and helpful.\nRead more:Revolut Leads Digital Banking Surge in The UK as Downloads Top Legacy Banks\nThe research also found that 37% of UK consumers like their bank to give them more visibility over their finances. These numbers underline how digital experience now drives trust and loyalty.\nTraditional banks, meanwhile, are feeling the pressure. 57% of banking executives say that attracting young customers is their biggest challenge for the coming year, and 79% see money management tools as critical to winning new clients.\nDigital-first banking is no longer about just checking balances. Today’s leading banks are building features that give customers insights, guidance, and control over their financial lives.\nAccording toVisaand Tink’s research, modern mobile banking apps are starting to act like digital financial coaches. Features now being built into apps include:\nProactive balance forecasting to help avoid overdrafts\nPersonalized alerts for unusual spending or duplicate charges\nAutomated budgeting suggestions based on previous transactions\nSubscription tracking with the ability to cancel or pause in-app\nIn fact, 50% of UK customers said they want their bank to help them manage subscriptions, and 30% said they’d switch providers just to receive alerts on double charges or budgeting tips.\nThis digital coaching approach benefits both sides. Banks gain more engaged, loyal users; customers gain clarity and control over their spending.\nGoing digital-first doesn’t just mean speed and convenience—it must also mean safety.\nAccording to Visa, implementing world-class security across the entire customer journey is now a baseline expectation. This includesbiometric logins(face and fingerprint) and real-time fraud alerts.\nAs fraud risks grow with faster payments, banks are shifting to proactive fraud detection, using AI models to spot suspicious behaviour in real time. These systems don’t just stop fraud—they also help reduce friction for good transactions.\nDigital-first banks are also embracing embedded finance, where banking services are built into non-banking platforms.\nVisa notes that embedded finance tools are gaining traction, especially within the merchant ecosystem. For example, lending services are now being integrated into checkout flows, and white-label payment systems are enabling marketplaces to offer their own branded wallets.\nThis approach benefits everyone:\nBanks gain new distribution channels\nPlatforms improve user stickiness\nConsumers get seamless, contextual financial services\nDevelopers can build fast using Visa’s open APIs and SDKs\nThe rise of open banking is also pushing banks to become more flexible and API-driven. One practical use case is subscription management—where banks help customers track, control, and cancel recurring charges directly within the app.\nVisa’s solution includes identifying where a user’s card is stored, flagging new subscriptions, and offering controls to pause or stop charges instantly.\nFor example, YellowPepper in Peru used Visa’s aliasing technology to launch PLIN, a peer-to-peer app where users can send money with just a phone number, showing how banks can partner with fintechs to deliver user-friendly experiences.\nDigital-first isn’t a product. It’s a mindset—and a long-term strategy. Banks that succeed in 2025 and beyond will be those that put mobile tools at the heart of their offering, use AI to drive personalized insights, build secure, real-time payment rails, partner through APIs to extend reach, and stay responsive to shifting customer expectations.\nFor banks, this isn’t just about digital transformation—it’s about future survival.\nThe digital-first wave is not coming. It’s already here. Banks that lead with technology, simplicity, and customer value will be the ones that thrive in the fast-changing world of payments. Those that don’t may find themselves outpaced by more agile, customer-focused competitors.",
    "url": "https://www.financemagnates.com/fintech/payments/banks-go-digital-first-the-new-standard-for-2025/",
    "source": {
      "name": "Finance Magnates – FinTech"
    },
    "publishedAt": "2025-06-16T04:21:47Z"
  },
  {
    "title": "The Future of B2B Payments: Will Blockchain Finally Solve Cross-Border Payment Inefficiencies?",
    "content": "Cross-border transactions are costing companies over $120 billion per year in transaction fees, a report by Oliver Wyman and J.P. Morgan found. In spite of great fintech advances, conventional payment systems are still inefficient.\nAlthough originally designed as a platform to support decentralized cryptocurrencies, blockchain is emerging as a dynamic tool that can be used to greatly improve B2B cross-border payments.\nIt can significantly reduce transaction costs and dependency on intermediary banks, as well as increase speed and security by promoting direct peer-to-peer transactions on a protected distributed ledger.\nWithin B2B cross-border payments, blockchain can act as a decentralized payment rail. With automated compliance checks through the use of smart contracts and custom transaction tracking, it can enable businesses to perform transfers directly across borders in minutes.\nAs blockchain-based payment systems become adopted by fintech companies, the industry is currently at a turning point. Will regulation complexities and slower integration stand in the way of blockchain truly reshaping the future ofB2Bpayments?\nGlobalB2B paymentsare still processed through an older, dated infrastructure despite improvements within fintech. Some significant problems hindering this include:\nMost companies are researching B2B payment solutions to streamline costs and speed up transactions. International remittance complexities typically affect many intermediary banks, each charging its own processing fees.\nForeign exchange (FX) markups by banks and financial institutions also add additional fees to transactions.\nKey cost factors include:\nCross-border B2B payments are settled for an average of two to five business days, usually due to time zones, bank holidays, and manual authentication procedures. TheSWIFTnetwork, utilized by over 11,000 institutions, has several steps, each with failure points and delays.\nThis inefficiency creates cash flow issues and increases counterparty risks for international companies. The rising cost of cross-border transactions has generated a need for alternative payment methods, such as stablecoins and blockchain settlements.Lack of Transparency\nMany standard B2B payments are based on unseen banking processes without real-time tracking. Consumer payments benefit from innovations like real-time payment networks, but cross-border business transactions still rely on traditional systems. Consequently, after initiating the payment, businesses hardly have any idea where the funds are at any point in time. The lack of transparency can lead to:\nWe're excited to announce the successful completion of a cross-chain Delivery versus Payment (DvP) transaction in collaboration with Kinexys by J.P. Morgan (@jpmorgan) and@OndoFinance.https://t.co/W2IC8NeO18This milestone marks the first-of-its-kind cross-chain, atomic…pic.twitter.com/0J1tA3AYWk\nCompliance Barriers\nThe limitations of anti-money laundering (AML), know-your-customer (KYC), as well as counter-terrorist financing (CTF) can be quite restricting for cross-border B2B transactions. Regulations differ in each jurisdiction, and companies must go through a complex web of compliance requirements.\nSanctions violations must be screened through transactions by financial institutions, which is time-consuming. The ever-changing nature of the regulations means that companies must continually update compliance systems, and this naturally adds to the expense of administrative costs and operating expenses.\nBlockchain technology can combat these challenges within B2B payments by offering decentralized, transparent, andefficient payment systems. The biggest advantages of making use of blockchain-based B2B payments are:\nLowering Costs\nBlockchain eliminates the presence of intermediaries like correspondent banks, minimizing the cost of transactions in conventional payment systems. In contrast to SWIFT-based transfers where both parties are served a portion of the transaction fee, blockchain transactions take place over a P2P (peer-to-peer) network that minimizes cost significantly.\nFaster Settlement Times\nBlockchain payment technologies decrease cross-border payment delays from multiple days to just minutes, which unlike the multi-step payment processes of traditional payment systems, revolutionizes fintech cross-border innovation.\nThis is how cryptocurrencies and stablecoins like USDC (USD Coin) and USDT (Tether)facilitate faster paymentsbetween companies. Ethereum and Solana networks have been shown to be able to sustain high-speed, large-scale transactions without bank authorization, making them perfect for B2B settlements.\nTransparency & Security\nBlockchain employs a distributed ledger technology (DLT) to store all the transactions in an open, fixed ledger. This degree of transparency thus enables businesses to see transactions in real-time, minimizing the scope for fraud and inefficiency in reconciliations. Compared to traditional banking infrastructure, where transaction histories might have been hidden due to banking regulations, blockchain provides an unerasable history of transactions.\nSmart Contracts\nBlockchain payment solutions can also facilitate compliance automation via smart contracts, self-executing contracts with coded instructions to execute based on regulatory requirements.\nThe contracts can automate AML and KYC checks prior to a transaction,enhancing the regulatory complianceof blockchain payments. Some blockchain networks have incorporated compliance-friendly frameworks to make regulatory adoption easier.\nAI-Powered Fraud Detection\nArtificial intelligence (AI) is being increasingly used in blockchain payments to provide greater anti-fraud capability and regulatory reporting. AI-powered systems can analyze transaction behavior in real time, detect suspicious behavior, and stop fraudulent payments from being sent.\nCyber crime Unit Hyderabad city as a part Cyber Jaagrookta Diwas conducted cyber awareness program about Parcel Scam&digital arrest, trading, APK files, Crypto currency, part time job& Investment, OTP, customer care, other social media trolling at State Bank of India Patny centrepic.twitter.com/AaS67Suloj\nAI improves payment automation through cash management optimization, predicting delays, and automating transactional flows reconciliation. AI and blockchain together offer greater security levels and business operational efficiency improvement in B2B payments.\nThe Rise of Stablecoins in B2B Transactions\nStablecoins, digital currencies pledged against money, are emerging as a solution of choice for effortless B2B payments. The world's biggest banks and fintech giants, such as Bank of America, Standard Chartered, PayPal, Revolut, and Stripe, are moving into a space long dominated by Tether and Circle.\nWith increasing regulatory support, stablecoins provide a quicker, cheaper alternative to traditional banking systems. Regulators now tackle concerns aboutstablecoin adoption, clearing the way for its inclusion in the global financial system.\nInstitutional Adoption\nFinancial institutions are realizing the potential of how blockchain technology can improve payment systems. The advances align with a trend of mainstream financial institutions embracing blockchain technology in business with the objective of improving efficiency, security, and transparency for B2B payments.\nNotable institutional blockchain initiatives include:\nCBDCs and the Future of Government-Issued Digital Currencies\nWorld central banks are looking into the implementation of digital forms of their domestic currencies, or Central Bank Digital Currencies (CBDCs). The digital currency will be a safe, low-cost, and efficient payment medium that can replace cash and upgrade the payment system. CBDCs could bypass intermediaries in payments to reduce expenses and enhance speed.\nBlockchain must be able to seamlessly integrate with standard financial systems for it to be applied successfully in mass within B2B payments. Projects like mBridge are a central bank initiative that aims to enable instant, peer-to-peer cross-border payments in the form of CBDCs.\nMeanwhile, solutions for seamless payments across different platforms are being designed by companies like Visa. For instance, cross-chain interoperability solutions which allows CBDCs to work with Real-Time Payments (RTP) systems. All these developments are leading us to wider blockchain adoption in traditional finance.\nAs B2B payments shift more toward blockchain, regulators are syncing the compliance frameworks. Whereas AML/KYC and CBDC regulations remain divided, efforts such as the Atlantic Council's digital asset policy roadmap are working towards creating international standards.\nPolicymakers are also seeking frameworks to bring CBDCs,stablecoins, and blockchain payments under a common legal framework. Regulatory sandboxes are empowering fintech companies to test blockchain solutions in pilot environments before implementing them on a full scale.\nSantander, one of the biggest banking groups in Europe, is using RippleNet to enable cross-border payments via its One Pay FX service. The blockchain technology enables Santander to settle payments in seconds, whereas the usual 3–5 business days for SWIFT-based payments are required.\nSantander launched a blockchain-based foreign exchange service that uses Ripple's technology.https://t.co/oPSPDuAP3Npic.twitter.com/YNTO3kt2k9\nThe bank has shown cost savings on cross-border remittances, proving the economic advantage of using blockchain.\nIBM's World Wire: A Cross-Border Payment Solution for Banks\nIBM’s World Wire uses the Stellar blockchain to enable cross-border payments between banks. The platform makes it possible for companies to pay in various digital assets, including stablecoins, offering a safe and regulatory-compliant payment method outside the traditional payment networks.\nWorld Wire has gone global, promoting financial inclusion and reducing global payment flows. Blockchain is revolutionizing B2B payments by offering reduced costs, quicker settlements, and improved transparency.\nCross-border transactions are costing companies over $120 billion per year in transaction fees, a report by Oliver Wyman and J.P. Morgan found. In spite of great fintech advances, conventional payment systems are still inefficient.\nAlthough originally designed as a platform to support decentralized cryptocurrencies, blockchain is emerging as a dynamic tool that can be used to greatly improve B2B cross-border payments.\nIt can significantly reduce transaction costs and dependency on intermediary banks, as well as increase speed and security by promoting direct peer-to-peer transactions on a protected distributed ledger.\nWithin B2B cross-border payments, blockchain can act as a decentralized payment rail. With automated compliance checks through the use of smart contracts and custom transaction tracking, it can enable businesses to perform transfers directly across borders in minutes.\nAs blockchain-based payment systems become adopted by fintech companies, the industry is currently at a turning point. Will regulation complexities and slower integration stand in the way of blockchain truly reshaping the future ofB2Bpayments?\nGlobalB2B paymentsare still processed through an older, dated infrastructure despite improvements within fintech. Some significant problems hindering this include:\nMost companies are researching B2B payment solutions to streamline costs and speed up transactions. International remittance complexities typically affect many intermediary banks, each charging its own processing fees.\nForeign exchange (FX) markups by banks and financial institutions also add additional fees to transactions.\nKey cost factors include:\nCross-border B2B payments are settled for an average of two to five business days, usually due to time zones, bank holidays, and manual authentication procedures. TheSWIFTnetwork, utilized by over 11,000 institutions, has several steps, each with failure points and delays.\nThis inefficiency creates cash flow issues and increases counterparty risks for international companies. The rising cost of cross-border transactions has generated a need for alternative payment methods, such as stablecoins and blockchain settlements.Lack of Transparency\nMany standard B2B payments are based on unseen banking processes without real-time tracking. Consumer payments benefit from innovations like real-time payment networks, but cross-border business transactions still rely on traditional systems. Consequently, after initiating the payment, businesses hardly have any idea where the funds are at any point in time. The lack of transparency can lead to:\nWe're excited to announce the successful completion of a cross-chain Delivery versus Payment (DvP) transaction in collaboration with Kinexys by J.P. Morgan (@jpmorgan) and@OndoFinance.https://t.co/W2IC8NeO18This milestone marks the first-of-its-kind cross-chain, atomic…pic.twitter.com/0J1tA3AYWk\nCompliance Barriers\nThe limitations of anti-money laundering (AML), know-your-customer (KYC), as well as counter-terrorist financing (CTF) can be quite restricting for cross-border B2B transactions. Regulations differ in each jurisdiction, and companies must go through a complex web of compliance requirements.\nSanctions violations must be screened through transactions by financial institutions, which is time-consuming. The ever-changing nature of the regulations means that companies must continually update compliance systems, and this naturally adds to the expense of administrative costs and operating expenses.\nBlockchain technology can combat these challenges within B2B payments by offering decentralized, transparent, andefficient payment systems. The biggest advantages of making use of blockchain-based B2B payments are:\nLowering Costs\nBlockchain eliminates the presence of intermediaries like correspondent banks, minimizing the cost of transactions in conventional payment systems. In contrast to SWIFT-based transfers where both parties are served a portion of the transaction fee, blockchain transactions take place over a P2P (peer-to-peer) network that minimizes cost significantly.\nFaster Settlement Times\nBlockchain payment technologies decrease cross-border payment delays from multiple days to just minutes, which unlike the multi-step payment processes of traditional payment systems, revolutionizes fintech cross-border innovation.\nThis is how cryptocurrencies and stablecoins like USDC (USD Coin) and USDT (Tether)facilitate faster paymentsbetween companies. Ethereum and Solana networks have been shown to be able to sustain high-speed, large-scale transactions without bank authorization, making them perfect for B2B settlements.\nTransparency & Security\nBlockchain employs a distributed ledger technology (DLT) to store all the transactions in an open, fixed ledger. This degree of transparency thus enables businesses to see transactions in real-time, minimizing the scope for fraud and inefficiency in reconciliations. Compared to traditional banking infrastructure, where transaction histories might have been hidden due to banking regulations, blockchain provides an unerasable history of transactions.\nSmart Contracts\nBlockchain payment solutions can also facilitate compliance automation via smart contracts, self-executing contracts with coded instructions to execute based on regulatory requirements.\nThe contracts can automate AML and KYC checks prior to a transaction,enhancing the regulatory complianceof blockchain payments. Some blockchain networks have incorporated compliance-friendly frameworks to make regulatory adoption easier.\nAI-Powered Fraud Detection\nArtificial intelligence (AI) is being increasingly used in blockchain payments to provide greater anti-fraud capability and regulatory reporting. AI-powered systems can analyze transaction behavior in real time, detect suspicious behavior, and stop fraudulent payments from being sent.\nCyber crime Unit Hyderabad city as a part Cyber Jaagrookta Diwas conducted cyber awareness program about Parcel Scam&digital arrest, trading, APK files, Crypto currency, part time job& Investment, OTP, customer care, other social media trolling at State Bank of India Patny centrepic.twitter.com/AaS67Suloj\nAI improves payment automation through cash management optimization, predicting delays, and automating transactional flows reconciliation. AI and blockchain together offer greater security levels and business operational efficiency improvement in B2B payments.\nThe Rise of Stablecoins in B2B Transactions\nStablecoins, digital currencies pledged against money, are emerging as a solution of choice for effortless B2B payments. The world's biggest banks and fintech giants, such as Bank of America, Standard Chartered, PayPal, Revolut, and Stripe, are moving into a space long dominated by Tether and Circle.\nWith increasing regulatory support, stablecoins provide a quicker, cheaper alternative to traditional banking systems. Regulators now tackle concerns aboutstablecoin adoption, clearing the way for its inclusion in the global financial system.\nInstitutional Adoption\nFinancial institutions are realizing the potential of how blockchain technology can improve payment systems. The advances align with a trend of mainstream financial institutions embracing blockchain technology in business with the objective of improving efficiency, security, and transparency for B2B payments.\nNotable institutional blockchain initiatives include:\nCBDCs and the Future of Government-Issued Digital Currencies\nWorld central banks are looking into the implementation of digital forms of their domestic currencies, or Central Bank Digital Currencies (CBDCs). The digital currency will be a safe, low-cost, and efficient payment medium that can replace cash and upgrade the payment system. CBDCs could bypass intermediaries in payments to reduce expenses and enhance speed.\nBlockchain must be able to seamlessly integrate with standard financial systems for it to be applied successfully in mass within B2B payments. Projects like mBridge are a central bank initiative that aims to enable instant, peer-to-peer cross-border payments in the form of CBDCs.\nMeanwhile, solutions for seamless payments across different platforms are being designed by companies like Visa. For instance, cross-chain interoperability solutions which allows CBDCs to work with Real-Time Payments (RTP) systems. All these developments are leading us to wider blockchain adoption in traditional finance.\nAs B2B payments shift more toward blockchain, regulators are syncing the compliance frameworks. Whereas AML/KYC and CBDC regulations remain divided, efforts such as the Atlantic Council's digital asset policy roadmap are working towards creating international standards.\nPolicymakers are also seeking frameworks to bring CBDCs,stablecoins, and blockchain payments under a common legal framework. Regulatory sandboxes are empowering fintech companies to test blockchain solutions in pilot environments before implementing them on a full scale.\nSantander, one of the biggest banking groups in Europe, is using RippleNet to enable cross-border payments via its One Pay FX service. The blockchain technology enables Santander to settle payments in seconds, whereas the usual 3–5 business days for SWIFT-based payments are required.\nSantander launched a blockchain-based foreign exchange service that uses Ripple's technology.https://t.co/oPSPDuAP3Npic.twitter.com/YNTO3kt2k9\nThe bank has shown cost savings on cross-border remittances, proving the economic advantage of using blockchain.\nIBM's World Wire: A Cross-Border Payment Solution for Banks\nIBM’s World Wire uses the Stellar blockchain to enable cross-border payments between banks. The platform makes it possible for companies to pay in various digital assets, including stablecoins, offering a safe and regulatory-compliant payment method outside the traditional payment networks.\nWorld Wire has gone global, promoting financial inclusion and reducing global payment flows. Blockchain is revolutionizing B2B payments by offering reduced costs, quicker settlements, and improved transparency.",
    "url": "https://www.financemagnates.com/fintech/the-future-of-b2b-payments-will-blockchain-finally-solve-cross-border-payment-inefficiencies/",
    "source": {
      "name": "Finance Magnates – FinTech"
    },
    "publishedAt": "2025-06-12T14:24:03Z"
  },
  {
    "title": "Klarna CEO—AI Might Tank the Economy, Takes Calls on an AI Hotline",
    "content": "Klarna CEO Sebastian Siemiatkowski warns that AI will kill jobs and trigger a\nrecession—right before talking to customers on an AI hotline.\nIf you’ve ever worried thatartificial intelligence (AI)Artificial Intelligence (AI)Artificial Intelligence (AI) is a term coined by in 1956, which defines the automation of robotics to the actual process of robotics.The evolution of technology has since led to the gradual adoption of AI in several aspects of our lives. One of the most pertinent is its impact in the financial services industry, which provides a wide range of possibilities moving forward.Ways AI Can Transform FinanceAI has the potential to transform the financial services industry forever. This can take shape inArtificial Intelligence (AI) is a term coined by in 1956, which defines the automation of robotics to the actual process of robotics.The evolution of technology has since led to the gradual adoption of AI in several aspects of our lives. One of the most pertinent is its impact in the financial services industry, which provides a wide range of possibilities moving forward.Ways AI Can Transform FinanceAI has the potential to transform the financial services industry forever. This can take shape inRead this Termis coming for\nyour job, congratulations—you’ve got something in common with Klarna CEO\nSebastian Siemiatkowski. In recent comments, Siemiatkowski didn’t mince words: AI\nis slashing jobs at such speed,it\nmight just tip the global economy into a recession.\nYou might expect this kind of doom-laden forecast from a labor\neconomist or tech ethicist. But this is coming from the CEO of a company that’s\nembraced AI so enthusiastically it replaced 700 customer service agents with AI-powered\nbots this February.Only to hire them back. At least some of them.\nYour daily reminder that AI is gonna replace your job.In this video, Klarna CEO Sebastian Siemeatkowski explains how they use OpenAI to replace around 20% of employees with AI every year. And that's just the beginning.An hour ago I posted the interview with OpenAI's CFO from…pic.twitter.com/Tx8cFAFNmN\nMistakes aside, it seems Siemiatkowski sees the use of AI as a tidal change,\nsweeping across industries, apart from various positions that require manual\nskills, “if you look at the factory workers today, lorry drivers, waiters,\nchefs, salaries are going up at a pretty good rate,”he\nsaid.\nLet’s not pretend that AI couldn't potentially deliver results. Klarna claims its assistanthandled\ntwo-thirds of its customer chats in just its first month. Siemiatkowski\nsays that translated into massive cost savings and better customer\nsatisfaction.\nBut this uptick in productivity comes with a darker shadow: mass\nlayoffs.Siemiatkowski\nhighlightedhow quickly AI made its mark at Klarna, pointing to its role in\nboosting efficiency—and noted that other CEOs are seeing the same trend unfold\nin their own companies.\n\"Once gunning to be OpenAI CEO Sam Altman's 'favorite guinea pig,' Klarna is now plotting a big recruitment drive after its AI customer service agents couldn't quite hack it.\"pic.twitter.com/oTsg9ZEnM3\nThe sting in the tale? Klarna wasn't happy with the results of total AI domination when it came to customer and had to scrabble to re-hire.\nThe pivot has been fast, “We think offering human customer service is always going to be a VIP thing,”he told TechCrunch, while comparing AI service to bespoke clothes. “So we think that two things can be done at the same time. We can use AI to automatically take away boring jobs, things that are manual work, but we are also going to promise our customers to have a human connection.”\nWhile many tech CEOs are hyping up AI’s benefits, Siemiatkowski is\nurging governments to brace for the fallout. His message? If we don’t act fast,\nrising unemployment could tank the global economy.\nKlarna's CEO warns rapid AI cuts in white-collar roles might spark recession risks. Dive into how automation is reshaping the workforce:https://t.co/x3Fd60UKnM#AI#Automation#Economypic.twitter.com/JEwGeUkpc0\nHe\nurged businesses, governments and broader society to wake up and prepare for AI‑driven\njob disruption, warning its impact on white‑collar work “usually leads to\nat least a recession in the short term.” He went on to say, “I want to be\nhonest, I want to be fair, and I want to tell what I see so that society can\nstart taking preparations.”\nIt’s a pretty stark contrast from most corporate messaging, which tends\nto focus on “AI empowerment” and “enhancing human potential.” Klarna’s boss is\nsaying: forget the buzzwords—this could break the economy.\nNow, here’s where things get darkly humorous.\nAfter warning the world that AI is about to upend jobs and potentially\ncollapse economies, and after reversing course on AI customer service, Siemiatkowski went and made himself the star of... wait for\nit... Klarna’s AI-powered customer service hotline.\nCheck out this summarized news story 👀Klarna’s CEO is now taking your calls — over an AI hotlinehttps://t.co/WEjwbMvjIJ\nThe hotline allows customers to call Klarna and get a response from the\nCEO—sort of. When you ring up, you’re greeted by a synthesized version of\nSiemiatkowski’s voice, which cananswer\nquestions, resolve issues, and, we hope, crack a few jokes. It’s his voice,\npowered by AI, handling your mundane customer queries—because nothing says\n“human-centered leadership” like turning your CEO into a chatbot.\nKlarna claims that these chats could “translate into tangible product\nimprovements already the following day.”\nIt’s a neat PR move. It’s also peak irony.\nKlarna’s whole business model hinges on fast, efficient digital\ntransactions—so embracing AI makes strategic sense. But Siemiatkowski’s\nwarnings reveal a deeper paradox haunting every tech-forward company: if you\ninnovate too fast, you risk contributing to the very economic instability\nyou’re trying to avoid.\nCan companies both adopt AI and avoid contributing to systemic\nunemployment? Is it possible to champion innovation without gutting the\nworkforce? Siemiatkowski seems to be asking those questions himself—between\nAI-powered customer calls, of course.\nSo is Sebastian Siemiatkowski the tech CEO we deserve—or the one we\nneed? On one hand, he’s voicing concerns most of his peers are too busy\npitching investor decks to address. On the other, he’s diving headfirst into\nthe same automation trend he’s warning us about.\nIn the race to dominate the future of fintech, Klarna is running full\nthrottle. But if its own CEO is right, the cost of that speed could be\nmassive—and felt far beyond the walls of any call center.\nKlarna CEO Sebastian Siemiatkowski warns that AI will kill jobs and trigger a\nrecession—right before talking to customers on an AI hotline.\nIf you’ve ever worried thatartificial intelligence (AI)Artificial Intelligence (AI)Artificial Intelligence (AI) is a term coined by in 1956, which defines the automation of robotics to the actual process of robotics.The evolution of technology has since led to the gradual adoption of AI in several aspects of our lives. One of the most pertinent is its impact in the financial services industry, which provides a wide range of possibilities moving forward.Ways AI Can Transform FinanceAI has the potential to transform the financial services industry forever. This can take shape inArtificial Intelligence (AI) is a term coined by in 1956, which defines the automation of robotics to the actual process of robotics.The evolution of technology has since led to the gradual adoption of AI in several aspects of our lives. One of the most pertinent is its impact in the financial services industry, which provides a wide range of possibilities moving forward.Ways AI Can Transform FinanceAI has the potential to transform the financial services industry forever. This can take shape inRead this Termis coming for\nyour job, congratulations—you’ve got something in common with Klarna CEO\nSebastian Siemiatkowski. In recent comments, Siemiatkowski didn’t mince words: AI\nis slashing jobs at such speed,it\nmight just tip the global economy into a recession.\nYou might expect this kind of doom-laden forecast from a labor\neconomist or tech ethicist. But this is coming from the CEO of a company that’s\nembraced AI so enthusiastically it replaced 700 customer service agents with AI-powered\nbots this February.Only to hire them back. At least some of them.\nYour daily reminder that AI is gonna replace your job.In this video, Klarna CEO Sebastian Siemeatkowski explains how they use OpenAI to replace around 20% of employees with AI every year. And that's just the beginning.An hour ago I posted the interview with OpenAI's CFO from…pic.twitter.com/Tx8cFAFNmN\nMistakes aside, it seems Siemiatkowski sees the use of AI as a tidal change,\nsweeping across industries, apart from various positions that require manual\nskills, “if you look at the factory workers today, lorry drivers, waiters,\nchefs, salaries are going up at a pretty good rate,”he\nsaid.\nLet’s not pretend that AI couldn't potentially deliver results. Klarna claims its assistanthandled\ntwo-thirds of its customer chats in just its first month. Siemiatkowski\nsays that translated into massive cost savings and better customer\nsatisfaction.\nBut this uptick in productivity comes with a darker shadow: mass\nlayoffs.Siemiatkowski\nhighlightedhow quickly AI made its mark at Klarna, pointing to its role in\nboosting efficiency—and noted that other CEOs are seeing the same trend unfold\nin their own companies.\n\"Once gunning to be OpenAI CEO Sam Altman's 'favorite guinea pig,' Klarna is now plotting a big recruitment drive after its AI customer service agents couldn't quite hack it.\"pic.twitter.com/oTsg9ZEnM3\nThe sting in the tale? Klarna wasn't happy with the results of total AI domination when it came to customer and had to scrabble to re-hire.\nThe pivot has been fast, “We think offering human customer service is always going to be a VIP thing,”he told TechCrunch, while comparing AI service to bespoke clothes. “So we think that two things can be done at the same time. We can use AI to automatically take away boring jobs, things that are manual work, but we are also going to promise our customers to have a human connection.”\nWhile many tech CEOs are hyping up AI’s benefits, Siemiatkowski is\nurging governments to brace for the fallout. His message? If we don’t act fast,\nrising unemployment could tank the global economy.\nKlarna's CEO warns rapid AI cuts in white-collar roles might spark recession risks. Dive into how automation is reshaping the workforce:https://t.co/x3Fd60UKnM#AI#Automation#Economypic.twitter.com/JEwGeUkpc0\nHe\nurged businesses, governments and broader society to wake up and prepare for AI‑driven\njob disruption, warning its impact on white‑collar work “usually leads to\nat least a recession in the short term.” He went on to say, “I want to be\nhonest, I want to be fair, and I want to tell what I see so that society can\nstart taking preparations.”\nIt’s a pretty stark contrast from most corporate messaging, which tends\nto focus on “AI empowerment” and “enhancing human potential.” Klarna’s boss is\nsaying: forget the buzzwords—this could break the economy.\nNow, here’s where things get darkly humorous.\nAfter warning the world that AI is about to upend jobs and potentially\ncollapse economies, and after reversing course on AI customer service, Siemiatkowski went and made himself the star of... wait for\nit... Klarna’s AI-powered customer service hotline.\nCheck out this summarized news story 👀Klarna’s CEO is now taking your calls — over an AI hotlinehttps://t.co/WEjwbMvjIJ\nThe hotline allows customers to call Klarna and get a response from the\nCEO—sort of. When you ring up, you’re greeted by a synthesized version of\nSiemiatkowski’s voice, which cananswer\nquestions, resolve issues, and, we hope, crack a few jokes. It’s his voice,\npowered by AI, handling your mundane customer queries—because nothing says\n“human-centered leadership” like turning your CEO into a chatbot.\nKlarna claims that these chats could “translate into tangible product\nimprovements already the following day.”\nIt’s a neat PR move. It’s also peak irony.\nKlarna’s whole business model hinges on fast, efficient digital\ntransactions—so embracing AI makes strategic sense. But Siemiatkowski’s\nwarnings reveal a deeper paradox haunting every tech-forward company: if you\ninnovate too fast, you risk contributing to the very economic instability\nyou’re trying to avoid.\nCan companies both adopt AI and avoid contributing to systemic\nunemployment? Is it possible to champion innovation without gutting the\nworkforce? Siemiatkowski seems to be asking those questions himself—between\nAI-powered customer calls, of course.\nSo is Sebastian Siemiatkowski the tech CEO we deserve—or the one we\nneed? On one hand, he’s voicing concerns most of his peers are too busy\npitching investor decks to address. On the other, he’s diving headfirst into\nthe same automation trend he’s warning us about.\nIn the race to dominate the future of fintech, Klarna is running full\nthrottle. But if its own CEO is right, the cost of that speed could be\nmassive—and felt far beyond the walls of any call center.",
    "url": "https://www.financemagnates.com/fintech/klarna-ceo-ai-might-tank-the-economy-takes-calls-on-an-ai-hotline/",
    "source": {
      "name": "Finance Magnates – FinTech"
    },
    "publishedAt": "2025-06-12T08:31:45Z"
  },
  {
    "title": "Payments in 2025: A Simpler, Smarter, and Faster World—But Challenges Remain",
    "content": "The payments industry is going through one of its most transformative periods yet. In 2025, the focus is clear: make payments faster, more secure, and more integrated into people’s daily lives. Businesses and consumers alike are demanding smoother experiences, whether they’re shopping online, paying bills, sending money abroad, or managing subscriptions.\nAt the centre of this shift is technology. From real-time payment systems and digital wallets to AI-powered personalisation and biometric security, innovation is reshaping every part of the payment journey.\nLet's explore the top trends definingthe payments industry in 2025—from the rise of real-time global transactions and smart money management to the growing importance of digital identity and biometric security. These changes aren’t just shaping how money moves—they’re reshaping what customers expect from financial services.\nToday’s users want more than just a place to store money—they want tools that help them manage it better. Whether it’s tracking subscriptions, setting savings goals, or getting alerts on spending patterns, customers expect intuitive, in-app features that make daily money management easier. And if their provider doesn’t offer it, many are happy to switch.\nAccording to Visa and Tink, over 70% of consumers in Europe already use digital apps to manage their finances, and younger generations are leading the shift.\nThat’s why traditional banks and issuers are under pressure to deliver slick, mobile-first experiences—especially as neobanks and fintechs raise the bar with fast, flexible services.\nReal-time payments (RTP) are becoming standard in many domestic markets, but the next frontier is cross-border. Businesses and individuals want to send money abroad as easily as they do within their own country—quickly, clearly, and at low cost.\nBut there’s a gap between what users expect and what they get. Many cross-border payments still take days, carry high fees, and lack transparency.Visaresearch found that 67% of marketplace sellers say slow payouts hurt their ability to do business. And only 2.3% of small businesses are satisfied with their current cross-border options.\nEfforts are underway to fix this. Global RTP initiatives, digital wallet innovation, andsolutions like Visa Direct aim to make cross-border transfers real-time, transparent, and seamless. But the complexity of managing different regulations, currencies, and networks still poses major hurdles.\nAI is transforming how payments are processed and secured. It’s helping businesses spot fraud faster, tailor financial tools to users, and automate customer service. Expect to see moreAI-powered personalisation in the coming years, from spending advice to predictive budgeting suggestions.\nAt the same time, digital identity tools—like facial recognition and fingerprint scans—are replacing old-school passwords. These biometric tools offer more convenience and stronger security, making it easier for users to confirm payments with a simple touch or glance.\nThe rise of subscription services has changed how people spend, but also introduced new pain points—like forgotten renewals or hidden charges. Half of UK consumers want banks to help manage their subscriptions, with tools to flag recurring charges and cancel unwanted payments.\nBy adding these features, banks and payment providers can boost engagement and show they care about users’ actual financial needs, not just transactions.\nMore payment experiences are now built directly into apps and platforms. Whether it’s paying in a ride-sharing app or getting a loan during checkout, embedded finance is becoming part of everyday commerce. At the same time, Account-to-Account (A2A) payments are gaining ground, offering a direct, cost-effective way to move money without using cards.\nBut with new channels come new risks. Fraud is growing in RTP and A2A networks, and providers must invest in real-time protection tools to stay ahead.\nThe payments space in 2025 is full of opportunity—but not without pressure. Consumers want faster, easier, and more secure services. Businesses want efficiency and reach. And regulators want safety and compliance.\nTo succeed, payment providers need to offer more than just transactions. They must become trusted partners that help users understand, manage, and move their money with confidence. That means using smart technology, fixing cross-border pain points, and building tools that put users in control.\nIn a world where payments are expected to be as easy as sending a message, anything less simply won’t do.\nThe payments industry is going through one of its most transformative periods yet. In 2025, the focus is clear: make payments faster, more secure, and more integrated into people’s daily lives. Businesses and consumers alike are demanding smoother experiences, whether they’re shopping online, paying bills, sending money abroad, or managing subscriptions.\nAt the centre of this shift is technology. From real-time payment systems and digital wallets to AI-powered personalisation and biometric security, innovation is reshaping every part of the payment journey.\nLet's explore the top trends definingthe payments industry in 2025—from the rise of real-time global transactions and smart money management to the growing importance of digital identity and biometric security. These changes aren’t just shaping how money moves—they’re reshaping what customers expect from financial services.\nToday’s users want more than just a place to store money—they want tools that help them manage it better. Whether it’s tracking subscriptions, setting savings goals, or getting alerts on spending patterns, customers expect intuitive, in-app features that make daily money management easier. And if their provider doesn’t offer it, many are happy to switch.\nAccording to Visa and Tink, over 70% of consumers in Europe already use digital apps to manage their finances, and younger generations are leading the shift.\nThat’s why traditional banks and issuers are under pressure to deliver slick, mobile-first experiences—especially as neobanks and fintechs raise the bar with fast, flexible services.\nReal-time payments (RTP) are becoming standard in many domestic markets, but the next frontier is cross-border. Businesses and individuals want to send money abroad as easily as they do within their own country—quickly, clearly, and at low cost.\nBut there’s a gap between what users expect and what they get. Many cross-border payments still take days, carry high fees, and lack transparency.Visaresearch found that 67% of marketplace sellers say slow payouts hurt their ability to do business. And only 2.3% of small businesses are satisfied with their current cross-border options.\nEfforts are underway to fix this. Global RTP initiatives, digital wallet innovation, andsolutions like Visa Direct aim to make cross-border transfers real-time, transparent, and seamless. But the complexity of managing different regulations, currencies, and networks still poses major hurdles.\nAI is transforming how payments are processed and secured. It’s helping businesses spot fraud faster, tailor financial tools to users, and automate customer service. Expect to see moreAI-powered personalisation in the coming years, from spending advice to predictive budgeting suggestions.\nAt the same time, digital identity tools—like facial recognition and fingerprint scans—are replacing old-school passwords. These biometric tools offer more convenience and stronger security, making it easier for users to confirm payments with a simple touch or glance.\nThe rise of subscription services has changed how people spend, but also introduced new pain points—like forgotten renewals or hidden charges. Half of UK consumers want banks to help manage their subscriptions, with tools to flag recurring charges and cancel unwanted payments.\nBy adding these features, banks and payment providers can boost engagement and show they care about users’ actual financial needs, not just transactions.\nMore payment experiences are now built directly into apps and platforms. Whether it’s paying in a ride-sharing app or getting a loan during checkout, embedded finance is becoming part of everyday commerce. At the same time, Account-to-Account (A2A) payments are gaining ground, offering a direct, cost-effective way to move money without using cards.\nBut with new channels come new risks. Fraud is growing in RTP and A2A networks, and providers must invest in real-time protection tools to stay ahead.\nThe payments space in 2025 is full of opportunity—but not without pressure. Consumers want faster, easier, and more secure services. Businesses want efficiency and reach. And regulators want safety and compliance.\nTo succeed, payment providers need to offer more than just transactions. They must become trusted partners that help users understand, manage, and move their money with confidence. That means using smart technology, fixing cross-border pain points, and building tools that put users in control.\nIn a world where payments are expected to be as easy as sending a message, anything less simply won’t do.",
    "url": "https://www.financemagnates.com/fintech/payments/payments-in-2025-a-simpler-smarter-and-faster-worldbut-challenges-remain/",
    "source": {
      "name": "Finance Magnates – FinTech"
    },
    "publishedAt": "2025-05-30T09:40:51Z"
  },
  {
    "title": "How SS&amp;C Intralinks is driving growth in Asia with AI-powered M&amp;A and seamless alternative investment fund management",
    "content": "Despite rising trade tensions and ongoing uncertainty around US policy, M&A and financing professionals remain optimistic about dealmaking in APAC. This confidence reflects the upbeat sentiment at the start of the year where 94% of respondents in the SS&C Intralinks ‘2025 APAC M&A Dealmakers Sentiment Report,’ produced with Reuters, anticipated increased deal activity, with nearly half predicting significant growth.\n“This tells us there was confidence and a renewed appetite for growth,” said Alex Turner, Vice President, Sales - Asia Pacific, at SS&C Intralinks. While the report was published before the latest bout of volatility, growth in early-stage M&A and fundraising activity continues. “Dealmakers are preparing to launch projects once the market settles.”\nTurner’s view reflects conducive conditions for deals – from more stable interest rates in key markets, to growth in China+1 supply-chain strategies, to plans to put dry powder to work. “As a result, we expect there will be a shift from middle-market deals to larger, high-value deals this year,” explained Turner.\nAt the same time, deal financing remains a key challenge, he added. “Over half of the dealmakers we surveyed expect financing conditions to become more difficult over the next year, with 28% identifying it as the most challenging aspect of dealmaking.”\nThis is no surprise. Today’s high-pressure environment may be more intense than ever, with economic volatility, geopolitical tensions and fragmented regulations compounding already tight deal timelines. Adding to the challenge is the exponential growth of the volume of data involved in due diligence — leaving little room for inefficiency.\nA more intelligent approach to doing deals\nSS&C Intralinks has spent years developing proprietary AI models and technologies to bring powerful, deal-ready innovation to its clients. In today’s environment, AI-driven insights are no longer optional — they’re essential to getting deals get done so firms can begin driving value from day one.\n“Those who can move quickly while making informed choices and demonstrating control over their data and workflows gain a real competitive edge,” explained Turner.\nThe ability to efficiently ingest, analyse and act on an overwhelming volume of information through automation can help to alleviate many bottlenecks that have traditionally slowed down transactions, he added. “Whether it’s consolidating and analysing massive volumes of due diligence data, streamlining investor communication, or maintaining full visibility across complex deal structures, smarter workflows are enabling teams to work faster and more confidently across borders and stakeholder groups.”\nUsing AI is becoming essential to meet evolving expectations from investors, advisors and regulators in terms of real-time reporting and auditable transparency. In fact, 98% of respondents in the survey said they expect AI-powered tools in M&A and financing to increase in the coming year.\nYet with adoption in its early stages, the goal is to find the right partners and solutions that offer robust AI features plus align with the regulatory and security requirements of a specific industry.\n“This is one of the key reasons the next generation of the SS&C Intralinks platform has been built to fully integrate AI into the tools, analytics and workflows used by dealmakers in DealCentre AI™,” said Turner.\nFinding new ways to fuel fundraising\nSpeed and transparency have become increasingly key success factors for fundraising, too.\nAccording to Turner, a mindset shift among fund managers has led to an increasing focus on managing the entire experience for limited partners (LPs) and other investors end-to-end, from fundraising to onboarding to reporting.\n“As fundraising cycles lengthen and investor attention becomes more fragmented, general partners (GPs) need to offer a more personalised and intuitive investor experience that builds trust throughout the entire fundraising cycle,” he added.\nUltimately, the fund managers that will thrive in this environment are the ones that treat fundraising as more of a dynamic and data-informed process that moves with the investor and the market.\nThis will therefore meet the increasingly selective approach LPs are taking when it comes to the quality, transparency and timeliness of information they receive. “It’s that level of visibility that gives them the confidence to commit capital,” Turner added.\nLiving up to changing expectations\nAs AI becomes more embedded in dealmaking and fundraising, technology needs to feel intuitive and purposeful. Achieving this will close the gap between what Turner calls “the promise of AI and the day-to-day reality for most teams”.\nThis is the foundation of thoughtful guidance and partnership, aimed at achieving key goals such as:\nUnderpinning the solutions, however, is a commitment to service, said Turner. “Technology is essential, but one of our most valuable differentiators is the depth of our industry expertise. Having supported trillions in transactions, our experience shapes every decision we make — and that’s what keeps us at the forefront of innovation in dealmaking.”\nClick here for more details onSS&C Intralinks,DealCentre AIandFundCentre™\nReference sources",
    "url": "https://www.financeasia.com/article/how-ssc-intralinks-is-driving-growth-in-asia-with-ai-powered-ma-and-seamless-al/502783",
    "source": {
      "name": "FinanceAsia"
    },
    "publishedAt": "2025-06-10T10:00:00Z"
  }
]