[
  {
    "title": "OpenAI’s $200M DoD contract could squeeze frenemy Microsoft",
    "content": "Latest\nAI\nAmazon\nApps\nBiotech & Health\nClimate\nCloud Computing\nCommerce\nCrypto\nEnterprise\nEVs\nFintech\nFundraising\nGadgets\nGaming\nGoogle\nGovernment & Policy\nHardware\nInstagram\nLayoffs\nMedia & Entertainment\nMeta\nMicrosoft\nPrivacy\nRobotics\nSecurity\nSocial\nSpace\nStartups\nTikTok\nTransportation\nVenture\nEvents\nStartup Battlefield\nStrictlyVC\nNewsletters\nPodcasts\nVideos\nPartner Content\nTechCrunch Brand Studio\nCrunchboard\nContact Us\nOpenAI saidMondaythe U.S. Department of Defense granted it a contract for up to $200 million to help the agency identify and build prototype systems that use its frontier models for administrative tasks and more.\nOpenAI provides a few examples of possible tasking, such as helping service members get healthcare, streamlining data on various programs, and “supporting proactive cyber defense.” The company also said that “All use cases must be consistent with OpenAI’s usage policies and guidelines.”\nTheDoD’s announcementused slightly more straightforward wording. It says, “Under this award, the performer will develop prototype frontier AI capabilities to address critical national security challenges in both warfighting and enterprise domains.”\nWhether that reference to war-fighting applies to the weapons themselves or just other areas associated with wars, like paperwork, remains to be seen. OpenAI’s guidelines do forbid individual users to use ChatGPT or its APIs to develop or use weapons. However, OpenAI deleted the explicit prohibitions of “military and warfare” in its terms of service backin January 2024.\nGiven how heavily some powerful people in Silicon Valley have warned of the dangers of China’s advanced LLM models, it’s not surprising the DoD wants to use OpenAI for whatever purposes it wants. For instance, Marc Andreessen, co-founder of VC firm Andreessen Horowitz, an OpenAI investor, recently appeared on Jack Altman’s “Uncapped” podcast (Jack is Sam Altman’s brother). Andreessen described the race between China’s AI andthe Western world’s models as a “cold war.”\nStill, perhaps an equally interesting part of this announcement is what it says about OpenAI’sincreasingly strained relationship with its major investor Microsoft.\nMicrosofthas thousands of contractswith the federal government worth hundreds of millions of dollars. It has, for decades, been implementing the strict security protocols necessary for the government — especially the DoD — to use its cloud.\nOpenAI announced this deal as part of its broader new “OpenAI for Government” program, which consolidates a number of other programs it uses to sell wares directly to government agencies, including the U.S. National Labs⁠, the Air Force Research Laboratory, NASA, NIH, and the Treasury, according to the company.\nBut it was only in April thatMicrosoft announcedthe DoD had approved its Azure OpenAI Service for all classified levels. Now the DoD is also going straight to the source. From Microsoft’s perspective: Ouch.\nMicrosoft declined to comment and OpenAI did not respond to a request for comment.\n\nTopics\nVenture Editor\nFrom seed to Series C and beyond—founders and VCs of all stages are heading to Boston. Be part of the conversation. Save $200+ now and tap into powerful takeaways, peer insights, and game-changing connections.\nFinland warms up the world’s largest sand battery, and the economics look appealing\nGoogle reportedly plans to cut ties with Scale AI\nNew details emerge on Meta’s $14.3B deal for Scale\n11 startups from YC Demo Day that investors are talking about\nGoogle Cloud outage brings down a lot of the internet\nWaymo rides cost more than Uber or Lyft — and people are paying anyway\nEurope, we’re not leaving. Period.\n© 2025 TechCrunch Media LLC.",
    "category": "startup_ai",
    "region": "Global",
    "score": 9.0
  },
  {
    "title": "Facilitating Real-Time Transactions From Canada to the World: Zūm Rails Partners with Western Union",
    "content": "A recent survey conducted byInteracfound that nearly nine in 10 Canadians (88 per cent) have used Interac e-Transfer, a money-moving service inCanada. Canadians continue to rely on this product to move $338billion over the past 12 months, and over $625billion since the pandemic began, with 49 per cent indicating that they have increased their use in this period.\nHowever, moving money beyond Canada is challenging. This is where integrating Zūm Rails’ APIs into Western Union’s network is helpful. This will in turn enable the company to drive real-time movement of funds for Western Union customers using Interac eTransfer. With Interac eTransfer, customers can instantly fund their money transfers in Canada, then send the money to anywhere in the world.\nWith the rise of real-time payments and other digital experiences, consumers have become accustomed to sending and receiving money in seconds. However, speed is dictated by the payments rails technology integrated into a financial institution’s network. While new options have emerged to facilitate transactions in real-time, building the technology to integrate these rails and supporting compliance protocols into their existing infrastructures requires significant time and resources.\n“Our work with Western Union reflects a larger trend across the payments industry, defined by real-time money movement as a non-negotiable service for consumers and enterprises alike,” saidMiles Schwartz, CEO atZūm Rails.\n“Partnerships between traditional financial institutions and fintechs are proving to be a catalyst in accelerating this trend. Western Union is in a unique position to lead the industry forward, leveraging its technological innovation and its deep history in the cross-border remittance industry. We look forward to working with them to support their efforts in delivering an exceptional customer experience.”\n“Consumers should be able to send payments anywhere in the world at the same speed as they can with native peer-to-peer applications. Our work with Zūm Rails makes this a reality,” saidRanjit Sarai,vice president of digital and ecosystem at Western Union in Canada. “That is only part of what we have in store for Western Union customers as we work to bring a number of entirely new digital financial experiences to market, to complement the reliable service they’ve come to expect.”\nThe Fintech Times",
    "category": "finance_ai",
    "region": "Global",
    "score": 8.5
  },
  {
    "title": "EigenLayer Gets $70M From a16z to Launch Off-Chain Verifiability Platform",
    "content": "$104,784.00\n$2,525.14\n$2.17\n$652.05\n$148.02\n$0.999791\n$0.272912\n$0.170667\n$2,521.14\n$0.613424\n$104,812.00\n$40.23\n$3,047.43\n$2.85\n$474.82\n$13.07\n$9.24\n$18.71\n$0.252789\n$2.97\n$0.999824\n$48.23\n$0.0000117\n$2,525.78\n$2,704.14\n$85.23\n$0.149701\n$0.999803\n$321.03\n$0.999804\n$3.74\n$4.42\n$104,740.00\n$7.48\n$0.00001019\n$0.553323\n$266.99\n$1.18\n$352.67\n$48.86\n$1.00\n$4.46\n$5.18\n$0.088264\n$179.03\n$2.14\n$1.055\n$16.55\n$29.92\n$0.751337\n$0.999753\n$0.599852\n$16.02\n$9.55\n$4.42\n$0.071739\n$0.02152508\n$4.04\n$0.084488\n$104,543.00\n$0.194354\n$0.656214\n$0.279985\n$3.23\n$2.39\n$1.001\n$2,522.36\n$0.304694\n$0.997653\n$4.39\n$0.917744\n$101.84\n$0.169971\n$0.999805\n$11.15\n$156.91\n$1.32\n$1.22\n$0.01794378\n$2,871.66\n$0.400087\n$2,643.50\n$1.68\n$1.70\n$1.10\n$0.00001416\n$10.97\n$0.325341\n$1.00\n$0.01567428\n$0.999456\n$0.563197\n$3.29\n$0.163086\n$0.999887\n$0.058167\n$2,694.71\n$0.169364\n$0.613105\n$2,645.32\n$104,829.00\n$651.44\n$104,167.00\n$2,656.67\n$3,406.47\n$3,383.44\n$0.08428\n$105,807.00\n$0.507821\n$0.583557\n$1.11\n$0.418007\n$0.778958\n$165.23\n$2.14\n$192.56\n$0.00007431\n$2,728.03\n$2.22\n$111.47\n$0.775385\n$0.692038\n$0.999335\n$41.26\n$20.04\n$0.01436489\n$0.00000065\n$3.96\n$1.094\n$0.257508\n$31.56\n$0.163309\n$0.745897\n$0.99791\n$0.01247684\n$0.443344\n$104,817.00\n$40.13\n$0.0093032\n$0.09956\n$0.541897\n$0.999075\n$0.555643\n$2,526.32\n$0.512726\n$104,388.00\n$0.345317\n$2,526.55\n$0.20865\n$2.05\n$2,642.30\n$2,692.72\n$0.653054\n$1.46\n$104,320.00\n$8.77\n$2,525.12\n$0.995777\n$0.255928\n$40.06\n$0.01351971\n$50.12\n$0.415671\n$0.170741\n$0.060761\n$1.00\n$0.999798\n$2.32\n$1.38\n$0.04264089\n$1.43\n$37.41\n$0.00000041\n$1.09\n$0.999573\n$0.99565\n$0.506823\n$0.398922\n$2,526.37\n$13.70\n$0.3258\n$2,681.63\n$5.44\n$0.114331\n$0.997784\n$1.011\n$0.383659\n$0.00001898\n$0.00643334\n$0.073164\n$2.28\n$0.508712\n$0.00395516\n$5.54\n$1.17\n$0.00359771\n$0.136775\n$0.00407388\n$2,783.41\n$0.03491934\n$0.03538975\n$0.00000088\n$0.01757233\n$0.161381\n$2,754.83\n$1.38\n$0.332974\n$104,861.00\n$0.132697\n$0.03301207\n$2,527.62\n$104,541.00\n$0.807997\n$19.47\n$0.00005803\n$161.07\n$0.756372\n$0.998968\n$0.477376\n$0.998369\n$0.999759\n$1.12\n$0.00000149\n$2,531.60\n$0.00359219\n$0.064973\n$111.44\n$0.999964\n$18.70\n$1.002\n$0.295254\n$0.194455\n$1.018\n$1.75\n$104,819.00\n$0.00539466\n$0.617235\n$0.608988\n$9.26\n$0.01777347\n$102,471.00\n$0.19058\n$2,105.68\n$6.24\n$102,764.00\n$0.00363995\n$22.65\n$0.03544674",
    "category": "blockchain_ai",
    "region": "Global",
    "score": 7.5
  },
  {
    "title": "Luo Yonghao’s digital avatar draws over 13 million viewers in AI-powered Baidu live commerce debut",
    "content": "On June 15, Luo Yonghao’s digital avatar hosted its first livestream on Baidu’s e-commerce platform, attracting more than 13 million views and generating over 55 million yuan ($7.66 million) in gross merchandise value. Several 3C and food product categories reportedly surpassed the sales figures from Luo’s real-person debut in May, marking a new high for AI-driven livestreams. The session featured several technical firsts for the industry. It was the first time a top-tier Chinese influencer was represented by an AI-generated avatar for an entire livestream, which lasted more than six hours. The stream also introduced multi-avatar interaction, with Luo’s avatar and a co-host engaging in synchronized gestures and banter, mimicking real human behavior. According to Baidu, the AI system drew from a 13,000-item knowledge base and generated 97,000 words of product descriptions, coordinating more than 8,300 avatar movements during the session. Luo, founder of Smartisan Technology and Thin Red Line, began livestreaming sales on Douyin to pay off his debts. He continued until 2022, when he announced his exit from all social media to focus on Thin Red Line. [Technode report]",
    "category": "startup_ai",
    "region": "East Asia",
    "score": 9.0
  }
]